[
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread June 15, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 9,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1lc7ep4/biweekly_advice_thread_june_15_2025_all_your/",
        "created_utc": 1750012290.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Seeking financial advice on how to invest, details in post (young adult under 30)",
        "text": "Hi experts, need you advice for the following\n\n**Investment Goals:**\n\n* Monthly Investment Capacity: ₹5,000-10,000 since I am already investing around 25k in diff mutual funds SIP, as follows:\n\nSBI Large and Midcap fund  \nTata Business Cycle fund  \nEdelweiss small cap fund  \nTata Hybrid equity fund\n\nHDFC midcap opportunities fund  \nHSBC small cap fund  \nNippon India large cap fund\n\n* Target Return: 12-15% annually\n* Focus: Long-term wealth building, not short-term gains\n* No dependents currently, but planning for future\n\n**Proposed Portfolio Allocation:**\n\n1. Emergency Fund: Around 2lakhs parked in the Tata hybrid equity fund (want to move this to a safer place, FD/ RD or liquid funds or arbitrage funds. where and how to research this)\n2. Health Insurance: ₹5L coverage, new India mediclaim policy (changing it to 10L, research done)\n3. Term Insurance: none, maybe will get in 2-3 years\n4. Mutual Funds (SIP): ₹11L across large/mid/small cap mentioned above\n5. Direct Stocks: none, want to start\n6. PPF: 14L\n7. EPFO: 2-3L (16-25k) deducted every month by employer and employee contribution)\n8. Gold: none\n\n**Questions:**\n\n1. What changes are needed in allocation to make sense for my age and goals?\n2. Which one of the funds in my current portfolio are good for long term? Which ones to move out of?\n3. Should I adjust allocation percentages?\n4. How to track and rebalance effectively?\n5. Any major gaps in my strategy?\n6. If I am planning to move out of India (either job or masters) should I still get health and life insurance? How does my investment strategy change considering this?\n7. Is PPF good to keep emergency fund?\n\nThanks in advance for your advice!",
        "score": 4,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1leilax/seeking_financial_advice_on_how_to_invest_details/",
        "created_utc": 1750257032.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Need advice on Index MF investment(Nifty 50 or Nifty largemidcap 250)",
        "text": "I currently invest in the 360 nifty 50 ELSS MF. my goal is to invest in it for the next 15-20 years as my primary fund. but the low AUM of 85cr has me concerned. I dont want the fund shutdown or my units transferred to a non-index fund\n\nI am only looking for ELSS in index funds since I am a very impulsive person and the 3 year lock in makes me disciplined. Nothing for tax saving since I am on the new regime.\n\nI found another index ELSS MF. that is the Zerodha Largemidcap 250 ELSS. It has a AUM of 200Cr despite being less than 2 years old.\n\nI only want to invest in nifty 50 elss but all the MF's in the category have a AUM of < 100Cr. Seeing no choice i am thinking of moving to the zerodha largemidcap 250 for the peace of mind but at the cost of high volatility . Is it a good move  ?",
        "score": 6,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1le8l9y/need_advice_on_index_mf_investmentnifty_50_or/",
        "created_utc": 1750222528.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Building a Diversified ₹1 Crore Equity Portfolio: Striking a Balance Between Diversification & Manageability (India Focus)",
        "text": "Hey all,\nI'm working on building out my equity portfolio with a target allocation of roughly ₹1 Crore, and I'm aiming for a highly diversified approach across market caps (large, mid, small, flexi) and geographies (India + International). I want to include both actively managed funds and passive index funds/ETFs.\nMy initial thought was to go quite broad – something like 3-4 schemes for each of 8 categories, potentially landing me with 28-30 total funds. My reasoning was that this would maximize diversification even within sub-asset classes.\nHowever, after some internal debate and thinking about practical management, I'm second-guessing this high number. My main concerns are:\n * Over-diversification / Overlap: Will I just end up holding the same top stocks across multiple funds, effectively paying multiple expense ratios for the same underlying assets? This seems to dilute true diversification and lead to \"closet indexing.\"\n * Manageability: Tracking 28-30 funds, rebalancing, and managing tax implications seems like a massive undertaking.\nI'm looking for the sweet spot between robust diversification and practical manageability. Here's a revised proposal for my equity allocation (for ₹1 Crore), keeping in mind Indian and International exposure. I'd love to hear your thoughts, especially on the number of schemes per category and overall.\nMy Proposed Diversified Equity Portfolio (~₹1 Crore Allocation):\nI. Indian Equity (Active Funds & Index Funds)\n * Large Cap:\n   * 1 Nifty 50 Index Fund/ETF (Core, low cost, broad exposure)\n   * Optional: 1 well-researched active large-cap fund (if I believe in a manager's consistent alpha here, though I'm leaning towards just the index for large caps due to difficulty in outperformance).\n   * Proposed Schemes: 1-2\n * Mid Cap:\n   * 1 Midcap Index Fund/ETF (e.g., Nifty Midcap 150 Index Fund/ETF - for passive exposure)\n   * 1 Active Midcap Fund (where active management has historically shown more potential for alpha)\n   * Proposed Schemes: 2\n * Small Cap:\n   * 1 Active Smallcap Fund (higher risk, higher reward - potentially good for active management alpha)\n   * Optional: 1 Smallcap Index Fund/ETF (e.g., Nifty Smallcap 250 Index Fund/ETF - for broader, low-cost exposure, though I'd prioritize active for this segment if picking just one)\n   * Proposed Schemes: 1-2\n * Flexi Cap:\n   * 1 Active Flexi Cap Fund (offers fund manager flexibility across market caps; there aren't dedicated Flexi Cap Index Funds in India as far as I know, so active is the primary route here).\n   * Proposed Schemes: 1\nII. International Equity (ETFs & Index Funds)\n * International Diversification:\n   * 1 Global/Developed Markets Index Fund/FoF (e.g., tracking MSCI World or S&P 500 – for broad developed market exposure, often US-heavy)\n   * Optional: 1 specific region/country ETF/FoF (e.g., Nasdaq 100 for tech exposure, or an Emerging Markets ex-India fund if I want more granular EM exposure).\n   * Proposed Schemes: 1-2\nTotal Proposed Equity Schemes: Roughly 6-8 funds.\n * (1 Large Cap Index) + (1 Active Midcap + 1 Midcap Index) + (1 Active Smallcap) + (1 Active Flexi Cap) + (1 Global Index/FoF + 1 US-focused/other regional fund) = 7 funds (This feels like a good balance to me).\nMy Rationale for this approach:\n * Diversification: Covers major Indian market cap segments and adds crucial international exposure.\n * Active vs. Passive: Balances the lower costs and consistent market returns of index funds with the potential alpha of active funds in less efficient market segments (mid, small, flexi).\n * Manageability: 6-8 funds seems far more manageable for tracking, rebalancing, and tax purposes compared to 28-30.\nRegarding Expense Ratios:\nMy understanding is that expense ratios are charged as a percentage of the AUM, effectively reducing the fund's NAV. So, for a fixed ₹1 Crore portfolio, the total absolute amount paid in fees is the same whether it's in 1 fund or 20 funds, provided the average expense ratio is the same. However, the argument against many funds is that having more actively managed funds with higher expense ratios will lead to a higher overall average expense ratio for the portfolio, thereby eating into returns more significantly in the long run. Also, the overlap means I'm paying multiple managers for the same underlying stocks. Is my understanding correct here?\nKey Questions for the Community:\n * Does my proposed 6-8 fund structure sound reasonable for a ₹1 Crore equity portfolio aiming for good diversification and manageability?\n * Are there any critical gaps or redundancies you see in this scheme selection strategy?\n * Any specific fund recommendations (Direct Growth plans only, please!) that fit these categories and have a good track record / low tracking error (for index funds)?\n * Thoughts on my understanding of expense ratios and overlap – am I on the right track with avoiding excessive funds for that reason?\n * What allocation percentage would you typically suggest for each of these categories within the ₹1 Crore equity portion? (e.g., Large:Mid:Small:Flexi:Intl)\nLooking forward to your valuable insights!\nThanks in advance!",
        "score": 0,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1lep6p8/building_a_diversified_1_crore_equity_portfolio/",
        "created_utc": 1750272544.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Vested offering 1% cashback in 12 monthly installments if you bring in your US stocks to their platform, what are your thoughts on this ?",
        "text": "https://preview.redd.it/hr258n4sdu6f1.png?width=1080&format=png&auto=webp&s=03400125ce14b237143e9cf1873ba5072db26dfc\n\nDoes anyone know if the cost basis for the shares will be preserved when they are transferred?\n\nIs there any downsides/risk to using Vested over a US based broker like Interactive brokers? Do they charge fees for doing wire transfers?\n\nI'm considering doing this as it is quite tempting and wanted to get this community's opinion on this.",
        "score": 26,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1lb2k03/vested_offering_1_cashback_in_12_monthly/",
        "created_utc": 1749884787.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "What things should I keep in mind before entering into US Stock Market via IND Money?",
        "text": "I'm thinking to start investing in US Stock Market via IND Money (specially in Semiconductor & Software Companies)  \nWhat things should I keep in mind before moving ahead?\n\nI'm specifically looking to invest in the following stocks:  \n\\- Nvidia  \n\\- Monolithic Power Systems  \n\\- InterDigital  \n\\- Exelixis Pharma  \n\\- Solar First\n\nAny suggestions are highly welcome 🙂🙏🏻",
        "score": 37,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1l7fq61/what_things_should_i_keep_in_mind_before_entering/",
        "created_utc": 1749501302.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "How do you research real estate market before buying or selling property?",
        "text": "Hey folks,\n\nI’m a new investor exploring the real estate market and wanted to understand how others approach their research before buying, selling, or investing in property.\n\nI'm not talking about legal checks or physical site visits - I’m more focused on **market research**: stuff like analyzing prices, understanding trends, choosing locations, estimating ROI, or even identifying red flags from a data/market perspective.\n\nHere are some questions I’m curious about:\n\n* Where do you usually start when researching a neighborhood or city?\n* Do you rely more on property listing sites, government data, or word of mouth?\n* How do you compare one project or locality to another?\n* If you’re an investor, how do you evaluate potential returns?\n* What data points do you wish you had easy access to?\n* Have you found any tools, platforms, or methods that really helped you make a decision?\n\nI would love to hear how different people go about this, whether you're a first-time buyer, seasoned investor, or just casually browsing.\n\nThanks in advance!",
        "score": 14,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1l743ue/how_do_you_research_real_estate_market_before/",
        "created_utc": 1749473850.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread June 08, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 2,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1l6j9l5/biweekly_advice_thread_june_08_2025_all_your/",
        "created_utc": 1749407490.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Which companies are you investing in for long term to gain from India's semi conductor mission?",
        "text": "India holds a meagre 1% share of the global semiconductor manufacturing. With government heavily focused on increasing our global market share in semiconductor manufacturing, this segment has huge potential to give multibagger in the next 15 years. \n\nWhat stocks are you investing in and why? \n\nAre there any mutual funds that track the semiconductor industry closely? ",
        "score": 31,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1l1h8ap/which_companies_are_you_investing_in_for_long/",
        "created_utc": 1748868726.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Shriram Properties (SHRIRAMPPS) - Undervalued Gem in India's Real Estate Market?",
        "text": "Hey everyone! I just published a detailed analysis on Shriram Properties Ltd. (SHRIRAMPPS), a Bangalore-based real estate developer making waves in India’s affordable housing sector. \nHere’s why I think it’s worth a look:\n\nFinancials: Q4 FY25 PAT surged 137% YoY to ₹47.7Cr, with a 52.75 msf project pipeline valued at ₹9,770Cr GDV.\n\nValuation: P/E of 20x vs. sector avg of 45.5x—potentially undervalued?\n\nPrice Targets: 12-month: ₹100-120 | 3-year: ₹150-160.\n\nMarket Tailwinds: India’s real estate is set to hit US$845.7B by 2030 (CAGR 7.3%), fueled by policies like PMAY and a repo rate at 6.00%\n\nHowever, there are risks—execution challenges and a low ROE of 5.7% could be hurdles. I’ve recommended a Buy rating, balancing the growth potential against these concerns.\n\nCheck out the full report linked to this post: Shriram Properties Ltd. - Analysis Report \n\nWhat do you think about SHRIRAMPPS? \nAre you bullish on India’s real estate sector, or do the risks outweigh the upside? Let’s discuss!",
        "score": 0,
        "url": "https://www.researchgate.net/publication/392284237_Shriram_Properties_Ltd_-Analysis_Report",
        "created_utc": 1748849409.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread June 01, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 0,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1l0w643/biweekly_advice_thread_june_01_2025_all_your/",
        "created_utc": 1748802691.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Help me sanity check my financial life and 1 lakh in monthly investments.",
        "text": "1. 28 years old. Monthly gross salary is ~2.95 lakhs.\n\n2. I have an education loan at 7.7% interest, 8 year term, 24 lakh rupee principle. The EMI comes out to ~35,000 per month. It's an unsecured loan.\n\n3. I have 1 crore in health insurance and 3 crore in term life insurance until the age of 50. I also have 5 lakhs in group term health insurance and 50 lakhs in group term life insurance through my employer.\n\n4. I have a high risk tolerance, no dependents, parents are self sufficient for the next 10 years at least.\n\n5. My investment horizon is 22 years because I want to retire at 50.\n\n6. My current portfolio is ~12 lakhs, largely in index funds and across a hodgepodge of mutual funds. I've stopped all SIPs that were regular.\n\n7. I have 4.5 lakhs in fixed deposits and another 1.5 lakhs in highish interest accounts in the way of an emergency fund. I maintain at least 1 lakh rupees in my salary account for general expenses. I also have ~20 lakh rupees in credit limits across my credit cards for liquidity in a pinch.\n\n8. I don't have a PF account because I don't believe in having my money held hostage by sarkaari naukri types.\n\n9. I plan to invest 1 lakh rupees every month.\n\n* NIFTYBEES - 30,000\n* JUNIORBEES (NIFTY Next 50) - 18,000\n* MID150BEES (MidCap 150) - 12,000\n* VUAA (Ireland domiciled S&P500 accumulating ETF) - 20,000\n* Nippon Small Cap Fund - 5,000\n* Bandhan Small Cap Fund - 5,000\n* GILT5YBEES (5 year government securities index ETF) - 10,000\n\n* I'll just do a Zerodha stock SIP for everything except for VUAA, which I'll purchase through IBKR via an Indian Overseas Bank account.\n\n* Any left over money I have at the end of the month, I intend to either chuck at MAFANG or collect into a separate pool to load larger sums into IBKR at once.\n\n* I am looking for feedback on the distribution, the setup, anything else that I need to take into account, any blind spots, diversification suggestions etc. etc.\n\n* Also looking for small cap mutual fund suggestions other than/in addition to Bandhan that I could invest into to minimise overlap.\n\n* I'm particularly looking for feedback on the debt portion of my portfolio, since I don't have a PF account. Are there any actively managed instruments which would be a better fit for me?\n\n* Also looking for advice on investing into NPS, I believe the tax benefit is only on the employer portion and not your own Tier 1 investments? Is there a solid reason to make that investment then? My employer doesn't presently offer an employer match to the best of my knowledge.",
        "score": 78,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kzs2e6/help_me_sanity_check_my_financial_life_and_1_lakh/",
        "created_utc": 1748679627.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "I [27 M] would like to trim down my portfolio from 19 to 6 Mutual Funds.",
        "text": "Hi guys! I have been investing since 2022. And more aggressively since 2024. And have investments close to 46 lakhs in the market. I had overdiversified my portfolio. where I had 19 Mutual Funds. and 10 ETFs. My major investments were in Nifty Next 50 Index fund, Quant Infrastructure. Now I am reallocating all my funds, and choosing only one fund in a category. Besides I have 7 lakhs in FD and Bonds, for extra safety. I have long term goals, thinking for next 10 years.\n\n| Fund Name                          | Category   | Allocation |\n|-----------------------------------|------------|------------|\n| ICICI Multi Asset                 | Multi      | 10%        |\n| SBI Contra                        | Contra     | 20%        |\n| Parag Parikh Flexi Cap            | Flexi      | 20%        |\n| Nippon Large Cap                  | Large      | 15%        |\n| HDFC Mid Cap Opportunities        | Mid        | 15%        |\n| Bandhan Small Cap                 | Small      | 15%        |\n| Gold                              | ETF        | 5%         |\n\n\nI was going to make the decision and move things around, but I would love any insight, open to suggestions, as this is a big move for my life.",
        "score": 13,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kyu7v8/i_27_m_would_like_to_trim_down_my_portfolio_from/",
        "created_utc": 1748575485.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread May 25, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 2,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kv9jne/biweekly_advice_thread_may_25_2025_all_your/",
        "created_utc": 1748197892.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "IDFC raises money and gives out a dividend at the same time. What gives? A fun read.",
        "text": "*Original Source:* [*https://boringmoney.in/p/idfc-asks-cash-gives-away*](https://boringmoney.in/p/idfc-asks-cash-gives-away) \n\n*(if you like what you read, please visit* [*boringmoney.in*](http://boringmoney.in) *to subscribe and receive future posts directly in your inbox)*\n\n*--*\n\nThe idea of a company giving out a dividend is that it has “excess cash” that it can return to its shareholders. The company is presumably doing well, has invested in whatever assets it needs for the next few years, is earning a healthy profit, and wants to make investors happy by returning some of their money.\n\nThe idea of a company *raising* money from investors is the opposite. It needs money to do things. It could be to get more customers, move into new business lines, etc. Giving out a dividend and raising money from investors are ideas at odds with each other. A company can’t both have excess cash and need external money to be able to do stuff.\n\nLast month IDFC First Bank [announced](https://www.livemint.com/companies/idfc-first-bank-warburg-pincus-adia-investment-npa-ratio-investors-11744887960666.html) a fund-raise:\n\n>Private equity major Warburg Pincus and sovereign fund Abu Dhabi Investment Authority (ADIA) have agreed to invest ₹7,500 crore in IDFC First Bank for close to 15% stake, delivering a capital boost for the private lender accelerating its credit cards and wealth management businesses.\n\n>The bank will issue compulsorily convertible preference shares (CCPS) worth ₹4,876 crore to a Warburg Pincus affiliate, and shares worth ₹2,624 crore at ₹60 each to an ADIA subsidiary. While the Warburg affiliate will hold 9.48% stake, the ADIA unit will hold 5.10%.\n\nAnd almost immediately after that, the bank came back [announcing](https://www.bseindia.com/xml-data/corpfiling/AttachLive/60f98aa3-1c8d-419b-bf05-f79f9ac1e4d0.pdf) a dividend:\n\n>\\[…\\] recommended dividend of ₹ 0.25/- (2.50% of face value) per equity share…\n\nIDFC is raising ₹7,500 crore ($900 million) from investors and turning around and giving away ₹183 crore of that to its shareholders. \\[1\\] Warburg Pincus and the Abu Dhabi Investment Authority (ADIA) are the ones buying the shares paying ₹60 per share for a combined 14.5% stake in IDFC First.\n\nThe market price at the time of announcement of this deal was ₹63, so the two investors got about a 5% discount. That’s not a lot! Anyone buying a stake as large as this would expect a discount, and 5% is on the lower end of what would be reasonable.\n\nBut there are two unknowns:\n\n1. Why would the two new investors be okay with the company flipping cash they’ve just raised over to the rest of the shareholders?\n2. The last time IDFC gave out a dividend was 7 years [ago](https://trendlyne.com/equity/Dividend/IDFCFIRSTB/1786/idfc-first-bank-ltd-dividend/). Why would IDFC want to randomly give out a dividend right now even though it needs the cash?\n\nFor (1) I really don’t know. Maybe they weren’t okay with it but IDFC didn’t care? They probably would’ve wanted to negotiate a larger discount had they known that the bank would be distributing money.\n\nFor (2) there’s a clue.\n\nBoring Money is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.\n\nWarburg and ADIA didn’t buy IDFC’s shares. They bought a [special type](https://legacypartners.in/insights-and-research/convertible-preference-shares-smart-funding-option-for-startups) of preference shares which will eventually convert to regular shares. These are the kind of shares that VC investors in startups usually like. I mean, they do invest a lot on vibes and need a bunch of conditions and safeguards to go with their investment. Stuff like “you can’t just sell your company and exit, and if you do then you have to give us at least 3X our money back”. Investors in listed companies can just read the company’s financials. More regulations, less vibes.\n\nAnyway so the two investors have preference shares which will eventually convert to regular shares. *When* these shares convert is conditional. [Here’s](https://www.bseindia.com/xml-data/corpfiling/AttachHis/044da87d-991d-4d7c-b6a8-92ec3a33eb13.pdf) IDFC’s CEO V Vaidyanathan from the bank’s meeting with analysts last month:\n\n>The terms of the contract are that if the stock stays above Rs. 60 for a period of 45 trading days, then it automatically stands converted. So to make it clear, therefore, we don't have to really exactly wait for 18 months and all that stuff. If all goes well, within 45 days of allotment, it might just stand converted. And in the interim, they will get an 8% return.\n\nIf IDFC’s average share price remains above ₹60 for 45 days, Warburg and ADIA’s preference shares convert to regular shares right away. If it doesn’t, the two get an additional 18 months to convert their shares and the bank will have to pay them an interest at 8% pa until they do. \\[2\\] That’s an additional ₹900 crore ($105m) over 18 months, a lot of money!\n\nNow, from a company’s valuation perspective, dividends don’t make a lot of difference. A company is, for the most part, valued based on its earnings. Dividends are issued post-earnings, they don’t affect the company’s profit figure. So they don’t make a company inherently more or less valuable. In general though shareholders like dividends. If you do nothing and money hits your bank account, there’s a nice, warm, fuzzy feeling to it. Shareholders seem to give this feeling some value, \\[3\\] and [it’s basically a thing](https://www.investopedia.com/articles/investing/091015/how-dividends-affect-stock-prices.asp#:~:text=The%20stock's%20price%20often%20increases,of%20the%20company%20remains%20stable.) that a dividend can cause a temporary bump in the company’s stock price. Especially if it’s come after a 7-year gap.\n\nA temporary bump is exactly what IDFC needed. And that’s what they got. It’s been more than 30 days now and its stock price has been safely above ₹60. Of course, it was also affected by the fact that two prominent investors were taking a large stake in the bank. But an additional push never hurt. After all, spending ₹183 crore to save ₹900 crore seems like a great deal.\n\n**Footnotes**\n\n\\[1\\] Technically, this money comes from its profits and not from the money it’s raised. But yeah, we know.\n\n\\[2\\] I find it funny that this interest is actually referred to as a dividend just because it comes from preference “shares”. In this particular situation, it’s definitely an interest.\n\n\\[3\\] I was, of course, being a little facetious. There are legitimate reasons for why shareholders might like a dividend. Earnings for retirees and pension funds, which have to give out money every year, etc., need dividends to survive. But then again, these are not the folks who would’ve invested in a bank that hasn’t paid out a dividend in the last 7 years.\n\n*Original Source:* [*https://boringmoney.in/p/idfc-asks-cash-gives-away*](https://boringmoney.in/p/idfc-asks-cash-gives-away)",
        "score": 36,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kskuze/idfc_raises_money_and_gives_out_a_dividend_at_the/",
        "created_utc": 1747899217.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "How can someone in India start learning about financial literacy from scratch?",
        "text": "I'm looking to understand the whole spectrum—how money works, basics of budgeting, mutual funds, SIPs, share market, bonds, insurance, taxes, credit, and everything else that makes one financially literate and independent in the Indian context.\n\nWhere should I start? Any YouTube channels, websites, books, or courses you'd recommend for beginners?",
        "score": 106,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kqjttr/how_can_someone_in_india_start_learning_about/",
        "created_utc": 1747680807.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Global Macro Watch: India Takes the Lead, but the Road Ahead Is Complex",
        "text": "**May 2025 | Issue: Economic Pulse**\n\nAs the dust settles on the latest global economic data, one headline stands out: **India is now the fastest-growing major economy in the world**. But the story is bigger than a single number. In this issue, we go beyond growth rates to unpack where India really stands, how global peers are faring, and what this means for policymakers, investors, and market watchers.\n\n# 🔢 The Big Picture: Growth Divergence Widens\n\nWhile global GDP growth remains uneven, the divergence between developed and emerging markets is stark.\n\n|Country|YoY GDP Growth|2025 Forecast|Inflation (YoY)|Unemployment|\n|:-|:-|:-|:-|:-|\n|**India**|**8.4%**|**6.7%**|4.8%|7.4%|\n|**China**|4.9%|4.0%|\\-0.1% (deflationary)|5.2%|\n|**United States**|2.0%|2.3%|2.3%|4.2%|\n|**Euro Area**|1.2%|1.0%|2.2%|6.2%|\n|**Germany**|\\-0.2%|0.6%|2.2%|3.5%|\n|**Philippines**|5.2%|6.0%|3.1%|4.5%|\n|**Taiwan**|5.4%|3.8%|2.0%|3.4%|\n\nIndia’s GDP growth is not only higher than peers; it’s accelerating even as others slow down. With a **6.7% growth forecast for 2025**, India is expected to retain its lead.\n\n# 📈 What's Fueling India's Outperformance?\n\n1. **Domestic Demand**: A growing middle class, strong festival and discretionary consumption cycles, and rural recovery are lifting household demand.\n2. **Public Capex**: Government spending on infrastructure (roads, rail, digital public goods) is crowding in private investment.\n3. **Services Exports**: IT, digital services, and back-office outsourcing continue to be global competitive advantages.\n4. **Policy Continuity**: Stable monetary and fiscal frameworks have helped maintain investor confidence.\n\n# 🧮 Macro Fundamentals: How Sound Is the Base?\n\n|Indicator|India|Global Context|\n|:-|:-|:-|\n|**Current Account Deficit**|\\-0.3% of GDP (2025F)|Among lowest in EMs|\n|**Budget Deficit**|\\-4.4% of GDP|Moderate; better than US (-7.6%) or Brazil (-7.1%)|\n|**Currency Depreciation**|\\-2.1% YoY|Resilient; vs Argentina (-21.5%), Colombia (-7.7%)|\n|**Bond Yield (10Y)**|6.9%|Stable; 88bps rise YoY suggests gradual tightening|\n\nIndia's macro picture shows **strength without excess**. Inflation is moderate, twin deficits are manageable, and FX reserves remain healthy. The rupee has been relatively stable compared to other emerging markets, reflecting investor confidence.\n\n# ⚠️ Key Risks to Monitor\n\n* **Labor Market Weakness**: Despite headline growth, India’s unemployment remains high (7.4%), and informal sector underemployment is underreported.\n* **Global Headwinds**: Slowing demand from US/EU could hurt exports; China’s supply chain reorganization might create new trade frictions.\n* **Monetary Tightening Risks**: Rising interest rates globally could impact capital inflows; India’s bond yields have risen, albeit modestly.\n* **Weather & Agri Volatility**: A weak monsoon or food price spikes could feed inflation and reduce rural spending power.\n\n# 🗺️ How India Compares to Its Peers\n\n|Indicator|India|China|US|Brazil|Taiwan|\n|:-|:-|:-|:-|:-|:-|\n|GDP Growth|**8.4%**|4.9%|2.0%|2.1%|5.4%|\n|Inflation|4.8%|\\-0.1%|2.3%|4.7%|2.0%|\n|Fiscal Deficit|\\-4.4%|\\-4.0%|\\-7.6%|\\-7.1%|\\-2.5%|\n|Currency Stability|\\-2.1%|\\-1.3%|—|\\-4.0%|\\-3.2%|\n\nIndia is outperforming across growth, price stability, and fiscal management. Taiwan and Philippines are emerging as interesting runners-up among EMs, particularly with export-led resilience.\n\n# 💡 Takeaways for Readers\n\n* **For Policymakers**: India’s macro strength gives headroom to push structural reforms—particularly in jobs, labor mobility, and trade competitiveness.\n* **For Investors**: Sectors tied to domestic consumption, digital services, and infrastructure are well-positioned. However, employment-intensive industries may face headwinds if export demand softens.\n* **For Strategists**: India isn’t just a short-term outlier—it’s increasingly central to global growth narratives, especially as China’s trajectory shifts.",
        "score": 20,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kqantd/global_macro_watch_india_takes_the_lead_but_the/",
        "created_utc": 1747658398.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread May 18, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 3,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kpqvnl/biweekly_advice_thread_may_18_2025_all_your/",
        "created_utc": 1747593091.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Defense stocks have seen a strong rally. Time to book profits?",
        "text": "https://preview.redd.it/szfj8y1wj31f1.png?width=1226&format=png&auto=webp&s=c01bae4aee050efbb14a4fbbaf607c91f4579213\n\nI had taken a very large exposure to Defense sector since Israel Hamas war began. It is now paying off really well and has risen substantially since India Pak war news. I am wondering if it is a right time to trim my holdings in half to capitalize on this solid rally or if there is much more room for expansion? I do still like defense but some names may appear overvalued now.",
        "score": 61,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1knv10x/defense_stocks_have_seen_a_strong_rally_time_to/",
        "created_utc": 1747380696.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Do NIFTYBEES or ICICI Prudential Next 50 IETF have DIRECT vs REGULAR plans?",
        "text": "Hi, so I am in the process of transitioning from my HDFC Securities account to Zerodha Kite and Coin due to the reason that HDFC does not provide access to Direct Plans, and the Regular Plans offered eat away at your gains over the long term as mentioned in the wiki.\n\n  \nCurrently, I have ICICI Prudential Next 50 IETF and Nippon NIFTYBEES in my portolio in HDFC Securities. But I am not able to find these in Zerodha Coin. They are present in Zerodha Kite, without any labelling indicating if they are Direct Plans or Regular investment plans. \n\n  \nI checked my NSDL repository and also cant find any labelling saying that my current plans are \"Direct\" there. \n\n  \nSo I am pretty confused, can you not buy ETFs on Zerodha Coin? Does that mean that the concept of Direct or Regular does not apply to them? In that case is this whole activity of moving my investments between platforms a useless one..? (as the original purpose is betrayed)\n\n  \nThanks a lot for answering!",
        "score": 1,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kn69zb/do_niftybees_or_icici_prudential_next_50_ietf/",
        "created_utc": 1747310076.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread May 11, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 2,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kk7tcf/biweekly_advice_thread_may_11_2025_all_your/",
        "created_utc": 1746988289.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Comparison of broad Indian index funds which track Nifty 500 or Nifty 750 (Total Market)",
        "text": "Quite a few new funds have been launched in this category, so thought I would do a comparison. Some comments on the table:\n\n* Most of the funds were launched in 2024/2025, with the exception of HDFC, Groww (both 2023) and Motilal Oswal (2009) is the \"grandad\" of the bunch\n* AUM - many of the new funds have only 20\\~30 Cr in AUM; Two funds that stand out here are Motilal with 2100 Cr. and SBI with 800 Cr. Tier-2 seems to be Axis , HDFC and Groww all around 200\\~300 Cr.\n* Expense ratio - the best one is Axis at 0.10%, followed by Mirae at 0.14%; Tier-2 is Motilal and Angel One at 0.2%\\~0.28%; Rest are 0.3%\\~0.4%; For comparison , you can buy the cheapest Nifty 50 index funds at 0.05%\\~0.10% expense ratio\n* Tracking error - Several of these are too new (ICICI, Mirae, Bandhan, Angel One) to have reliable Tracking error data yet. But ones that have been around for some time have a tracking error of 0.1%\\~0.2%; For comparison, the best Nifty 50 index funds have tracking error of 0.05% \\~ 0.10%\n* Performance of the benchmarks (500 or 750 indices) has been slightly better than Nifty 50 (+2\\~3% annually) over the last five years, even though small/mid-caps have corrected in the last year\n* My conclusion: A broader index (500 or 750) seems to be a better way to get exposure to Indian equities; My pick of the bunch (for now) would be Motilal Oswal, given their long operating record and AUM; However, this should be reviewed in 1\\~2 years when we have enough time to gauge the other funds' performance and tracking errors\n\nThanks for reading. Please share your views in the comments!\n\nCheers.\n\nSharad\n\nOpenSourceInvestor @ Substack",
        "score": 36,
        "url": "https://imgur.com/a/ofsx8TG",
        "created_utc": 1746871236.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Does PFIC apply to investments made before moving to the US?",
        "text": "Hi all, yet another PFIC post. Background:\n\n* My parents bought some MFs in my name in 2009-2010 and kept buying till 2015, after which they haven't bought any.\n* I moved to the US in 2015 and have been here since.\n* Now, parents want to liquidate the MFs, but I am unsure if this will fall under PFIC. There are significant gains so not sure how to move forward.\n\nAll the purchases were made before my move to the US as an Indian tax resident. What should I do in this case? If PFIC does apply, and if it's possible, would it be better to transfer them to one of my parents & have them pay the taxes on the gain?\n\nAlso, since I have been in the US, I have transferred money to my NRE account, and my parents have been investing in single stocks (not ETFs or MFs) - based on what I've read, this would be fine and PFIC would not be applicable, right?\n\nAny advice is greatly appreciated. If anyone has any suggestions for CAs that can handle this, then would like some suggestions for that as well. Thank you!",
        "score": 2,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kgcril/does_pfic_apply_to_investments_made_before_moving/",
        "created_utc": 1746558263.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "I [29M] have roughly INR 100K to invest per month. I am looking for good allocation ideas that are hands-off.",
        "text": "Monthly income - 2 lakh per month  \nEmergency fund - None  \nFamily Debt - 10kpm  \nResponsibilities - Household expense 40kpm/5lpa, insurance 60kpa, gym 70kpa. Maybe a bit to enjoy\n\nI am looking to hold for a long term timeline (10+ years). I am somewhat financial literate (CA inter) but don't have the time to sit and study the market.\n\nI'm thinking to simply invest 50% in a NIFTY 50 index fund and the rest in index funds of other countries (eg S&P 500) and \\~10% in gold ETF or real estate fund. It feels safe and diversified for long term and should not need much oversight. Not planning on large/mid cap funds as I've read they require adjustments semi-regularly and I cannot reliably commit to being there at the right time.\n\nDo not know if it will hold water and if I'm in right track, would love some insights from the community.\n\n  \nEdit: For those curious on salary, I switched to tech, am a web dev now",
        "score": 53,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1kf3vwb/i_29m_have_roughly_inr_100k_to_invest_per_month_i/",
        "created_utc": 1746422331.0
    },
    {
        "subreddit": "IndiaInvestments",
        "title": "Bi-Weekly Advice Thread May 04, 2025: All Your Personal Queries",
        "text": "Ask your investing related queries here!\n\nThe members of /r/IndiaInvestments are here to answer and educate!\n\nAlternatively, you could [join our Discord](https://indiainvestments.wiki/discord) and seek answers to your queries\n\nIf you're looking for reviews on any of these following, follow the links:\n\n- [which bank or brokerage to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20banking%20services%20and%20products&restrict_sr=1&sort=new)\n- [which fund house is more capable and trustworthy](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20mutual%20funds%20and%20asset%20management%20services&restrict_sr=1&sort=new)\n- [which investing platform to use](https://www.reddit.com/r/IndiaInvestments/search?q=flair_name%3A%22Reviews%22%20Reviews%20of%20Brokerage%20products%20and%20services&restrict_sr=1&sort=new),\n- [which insurance company is reliable](https://www.reddit.com/r/IndiaInvestments/search/?q=flair_name%3A%22Reviews%22%20%22Reviews%20of%20Insurance%20products%20and%20services%22&restrict_sr=1&sort=new)\n\nGenerally speaking, there is no best stock, or fund, or bank, or brokerage, or investment platform.\n\nAnswers are always subjective to your personal needs, but use those threads a starting point for you to look at what other Redditors have to say about a company, product, fund, or service.\n\nYou can then ask a more specific question about what product or service to buy, once you are able to frame your personal situation.\n\n**NOTE** If your question is _I got 10k INR, what do I do to get most returns out of it?_, or anything similar; there is no single answer to this question. But we will also need A LOT MORE information if we are to provide some sort of answer:\n\n- How old are you?\n- Are you employed/making income?\n- How much? What are your objectives with this money?\n- Do you have any loan, or big expense coming up?\n- What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know it's 100% safe?)\n- What are you current holdings? (Do you already have exposure to specific funds and sectors? Have you invested in equity before?)\n- Any other assets? House paid off? Cars? Partner pushing you to spend more?\n- What is your time horizon? Do you need this money next month? Next 20yrs?\n- Any big debts?\n- Any other relevant financial information about you, that will be useful to give you an informed response.\n\nBeware that these answers are just opinions of fellow Redditors and should only be used as a starting point for your research. This is **NOT** financial advice, in legal sense of the term.\n\nYou should strongly consider consulting a registered fee-only financial advisor before making any financial decisions. Ideally, such advisors should be registered with SEBI, and have a registration number.\n\n[Links to previous threads](https://www.reddit.com/r/IndiaInvestments/search/?q=advice%20thread%20personal%20situation&restrict_sr=1).",
        "score": 1,
        "url": "https://www.reddit.com/r/IndiaInvestments/comments/1keqthb/biweekly_advice_thread_may_04_2025_all_your/",
        "created_utc": 1746383490.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Rate My Portfolio - r/StockMarket Quarterly Thread April 2025",
        "text": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.  \n\n\nPlease share either a screenshot of your portfolio or more preferably a list of stock tickers with % of overall portfolio [using a table.](https://www.reddit.com/r/YouShouldKnow/comments/y37p6/ysk_how_to_make_a_table_on_reddit/)\n\nAlso include the following to make feedback easier:  \n\n\n* Investing Strategy: Trading, Short-term, Swing, Long-term Investor etc.\n* Investing timeline: 1-7 days (day trading), 1-3 months (short), 12+ months (long-term)",
        "score": 71,
        "url": "https://www.reddit.com/r/StockMarket/comments/1jor3bf/rate_my_portfolio_rstockmarket_quarterly_thread/",
        "created_utc": 1743498101.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 17, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 3,
        "url": "https://www.reddit.com/r/StockMarket/comments/1ldiaam/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1750150878.0
    },
    {
        "subreddit": "StockMarket",
        "title": "US Debt Hits Over $37 Trillion",
        "text": "So US national debt just crossed $37 trillion now and kind of scary too if you think about it. \n\nDebt is just compounding nonstop and this is just another reminder that debt spiral is getting closer than ever. \n\nThis $37 Trillion figure is also another reminder that as debt is growing and growing, that means US bonds will be becoming much less appealing as the debt keeps compounding. \n\nBecause of this as Bonds become less appealing for investors and for big sharks then Yields or interest rates would need to go up to make them appealing to investors. \n\nIf Yields starts climbing more and oh well we all know what will happen then. \n\nHouse market and Stock Market and Businesses and especially Small businesses and startups will struggle to stay afloat in high interest rate market.\n\nIt’s not a crash alert or anything but just something to watch especially if you are in stock market or into bonds or even thinking about what Fed might do next\n\nJust wanted to share this thought because $37 trillion is no small number and it will keep affecting markets slowly slowly.",
        "score": 1586,
        "url": "https://i.redd.it/sf1mbi57g08f1.png",
        "created_utc": 1750394053.0
    },
    {
        "subreddit": "StockMarket",
        "title": "The Tel Aviv Stock Exchange ended at its highs of the day",
        "text": "",
        "score": 496,
        "url": "https://i.redd.it/2hxboi9xwv7f1.png",
        "created_utc": 1750339143.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Oil Steadies as Trump Gives Two Weeks for Iran Strike Decision",
        "text": "No paywall: [https://finance.yahoo.com/news/oil-steady-investors-watch-trump-233235478.html](https://finance.yahoo.com/news/oil-steady-investors-watch-trump-233235478.html)\n\n(Bloomberg) -- Oil edged higher, paring earlier gains, after the White House said President Donald Trump would decide within two weeks whether to strike Iran, reducing speculation that the US would plunge into the conflict imminently.\n\nWest Texas Intermediate’s more-active August futures were up 0.5% to around $74 a barrel after White House Press Secretary Karoline Leavitt made the comments on Trump’s timeline for the decision at a White House press briefing. The contract had approached $76 earlier in the session on reports that senior US officials had said the administration was preparing for a possible strike on Iran in the coming days.\n\nThe White House comments take “some of the immediate pressure off,” said Robert Yawger, director of the energy futures division at Mizuho Securities USA. “It looks like US involvement will not happen today or tomorrow.”\n\nThat delay in potential direct US participation in the conflict may prevent crude from reaching new highs, Yawger said.\n\nStill, crude remains markedly higher than before Israel first struck Iran earlier this month, with volatility spiking, options getting more bullish and premiums for nearby crude prices soaring over later ones.\n\nTrump concluded a meeting Wednesday with top advisers, but the White House offered few clues about the path forward. Asked if he was moving closer to bombing Iran, Trump said “I may do it. I may not do it.” The Wall Street Journal reported that the president approved a military attack plan earlier in the week, but withheld the final authorization as he weighed whether Tehran would meet his demands.\n\nShell Plc Chief Executive Officer Wael Sawan warned Thursday of a “huge impact” on global trade if the conflict were to result in a blockage of the Strait of Hormuz, a narrow waterway between Iran and Oman through which about a fifth of the world’s oil passes. Shell has contingency plans in place in the event that the situation deteriorates, Sawan said at the Japan Energy Summit & Exhibition in Tokyo.\n\nSo far there are no signs that Tehran is seeking to disrupt shipping Hormuz. Oil analysts and traders currently see about $8 of geopolitical risk premium priced into the market and are bracing for that to rise further if the US joins in on the attacks.\n\n“We don’t see it as a likely scenario at this time, but given the precarious state that the Iran regime is in right now, I think everybody should be watching” the waterway, Mike Sommers, the president of the American Petroleum Institute, said in a Bloomberg television interview.",
        "score": 63,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lfl1ss/oil_steadies_as_trump_gives_two_weeks_for_iran/",
        "created_utc": 1750364618.0
    },
    {
        "subreddit": "StockMarket",
        "title": "(06/20) CRCL Continuing Climb! - Interesting Stocks Today",
        "text": "CRCL is the most interesting stock today. \n\nHi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Under attack from Israel, Iran’s supreme leader faces a stark choice](https://apnews.com/article/what-to-know-iran-ayatollah-khamenei-b0bb95a8970411db38f4a7cb4719fc79)\n\n[**CRCL (Circle)**](https://finviz.com/quote.ashx?t=CRCL&p=d)\\-U.S. Senate passed the GENIUS Act (StableC Bill); now heads to House before Trump’s desk, with White House targeting approval by August. Considering we've already broken ATH and 3x'd since the IPO, I'm interested in the 250/300 levels. \n\nShort biased, not interested long in this at all. This is a huge landmark bill, and the CEO said that this is the 'iPhone' moment for the company. P/E is over 700×, if House or Trump delay changes or add restrictions, we could see a complete reversal. Also looking at the open for a reversal. \n\nhttps://preview.redd.it/wxtnd2cyy28f1.png?width=1540&format=png&auto=webp&s=87d6ee28c40b2ba88ab3113048592154b4ccc729\n\n[**GMS (GMS Inc.)**](https://finviz.com/quote.ashx?t=GMS&p=d)\\-QXO offered $95.20/share in all-cash (\\~$5B), board is currently evaluating. (I personally think HD is likely to win this because they are many times larger than QXO). Regulatory concerns (antitrust) may complicate integration but the board decision due by June 24.\n\nhttps://preview.redd.it/uzua3c80z28f1.png?width=1018&format=png&auto=webp&s=a8874d47316782bd1f2a61bf899fd9e809e17224\n\n[**OSCR (Oscar)**](https://finviz.com/quote.ashx?t=OSCR&p=d)\\- Up for the third day on news that a new voluntary “Medicare Part E” plan may be introduced alongside private insurance and marketplace plans due to long-term SS/Medicaid solvency concerns. Presumably OSCR can absorb customers from Medicare if it goes insolvent.\n\nhttps://preview.redd.it/qpsua9e2z28f1.png?width=1017&format=png&auto=webp&s=cb58f50b2ec539a3136d9b0f90bb2ec17a36fea2\n\n",
        "score": 2,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lg3hjk/0620_crcl_continuing_climb_interesting_stocks/",
        "created_utc": 1750424685.0
    },
    {
        "subreddit": "StockMarket",
        "title": "The Inglorious Basterds: Uranium ,Plutonium and Thorium - Supply chains and Stocks to own.",
        "text": "\nThe uranium supply chain is a long, multi-step global process that begins with mining and ends with nuclear power generation or waste disposal. Uranium is extracted from the earth, typically in countries like Kazakhstan, Canada, and Australia. After mining, it is milled into a concentrated powder called yellowcake (U3O8). This yellowcake is then transported to conversion facilities where it is turned into uranium hexafluoride gas (UF6). The UF6 is enriched to increase the amount of the U-235 isotope, which is needed to sustain nuclear reactions. The enriched uranium is made into fuel rods, which are used in nuclear reactors to generate electricity. Once the fuel has been used, it becomes radioactive waste, which is either stored, reprocessed, or disposed of permanently.\n\nKazakhstan leads the world in uranium production, supplying over 43 percent of the global total. Canada, Namibia, and Australia also play major roles. However, many uranium-producing countries depend on others, such as France, the United States, and Russia, for enrichment and fuel fabrication. The main users of uranium are countries with large nuclear energy programs, including the United States, China, and France. Because uranium can also be used to make nuclear weapons, its trade and processing are heavily regulated by international organizations like the International Atomic Energy Agency.\n\nIn North America, the Toronto Stock Exchange (TSX) and the New York Stock Exchange (NYSE) dominate uranium-related public investment. The TSX is the global center for uranium exploration and early-stage development, particularly in Canada’s Athabasca Basin, which is home to some of the highest-grade uranium deposits in the world. Major Canadian-listed companies include Cameco, NexGen Energy, Denison Mines, Fission Uranium, and Global Atomic. These firms focus on mining, exploration, and project development.\n\nThe NYSE hosts companies that emphasize uranium production, fuel management, and technology. These include Cameco (dual-listed on TSX and NYSE), Energy Fuels, Uranium Energy Corp, Centrus Energy, and Denison Mines. While Cameco is a major producer, Energy Fuels operates the only conventional uranium mill in the U.S., and Centrus focuses on uranium enrichment services. Uranium Energy Corp is notable for its in-situ recovery operations and large physical uranium inventory.\n\nSeveral companies like Cameco, NexGen, and Denison are listed on both exchanges, bridging Canadian exploration and U.S. capital markets. As Western nations seek to reduce reliance on Russian nuclear materials, these companies have become more strategically important. Explorers such as Fission Uranium and Global Atomic are also gaining attention as potential future producers amid tightening global supply.\n\nPlutonium, unlike uranium and thorium, is not mined. It is produced inside nuclear reactors when uranium fuel is used. A portion of the uranium transforms into plutonium-239, which can then be separated from spent fuel in a process called reprocessing. Countries like France, Russia, and Japan use this method to create MOX fuel (mixed oxide), which combines plutonium with uranium and can be reused in reactors. However, many nations avoid reprocessing because plutonium can be used to make nuclear weapons. Due to these risks, the use and movement of plutonium are tightly controlled. Most activity in this area is government-led, and there are few opportunities for public investment. One exception is BWX Technologies, listed on the NYSE, which is indirectly involved in U.S. naval nuclear programs that deal with plutonium-related technologies.\n\nThorium is a naturally occurring metal that can be mined, often alongside rare earth minerals. Although it is more common than uranium, thorium cannot be directly used as reactor fuel. It must first be converted into uranium-233 in a special type of reactor. This process is still in the research phase. Countries such as India, China, and Norway are working on thorium reactor technology, which could be safer and cleaner than uranium. Thorium reactors generate less long-lived nuclear waste and pose a lower risk of weaponization. Still, there are no commercial thorium reactors in operation today. Some junior mining firms on the TSX, like Ucore Rare Metals, and companies like Energy Fuels on the NYSE, have indirect exposure to thorium through rare earth processing projects involving monazite, a mineral that contains thorium.\n\nIn summary, uranium is the backbone of current nuclear power and has strong representation on both the TSX and NYSE through mining, development, and fuel supply companies. Plutonium is a byproduct of uranium use, primarily managed by governments and used in specialized fuel or military applications, with limited public investment exposure. Thorium is a future-facing nuclear fuel with exciting potential, but its technology is not yet proven or widely commercialized, and its investment footprint remains very small.\n\nRecently, Kazakhstan and China have been building stronger energy ties, signing $25 billion worth of new deals. One major agreement involves working with China’s National Nuclear Corporation on nuclear power and uranium exploration. China is rapidly growing its nuclear program, with 27 reactors currently being built and plans for 150 by 2035. At a recent forum in Astana, the two countries signed 60 deals, many tied to energy and infrastructure. While Kazakhstan doesn’t yet use nuclear power itself, it sees China as a key partner. Trade between the two countries reached a record $44 billion in 2024, and new infrastructure projects under China’s Belt and Road plan will help make Kazakhstan a major transit hub in Central Asia.",
        "score": 12,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lfsorz/the_inglorious_basterds_uranium_plutonium_and/",
        "created_utc": 1750385960.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 20, 2025",
        "text": "Have a general question? Want to offer some commentary on markets? Maybe you would just like to throw out a neat fact that doesn't warrant a self post? Feel free to post here!\n\n​\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n* How old are you? What country do you live in?\n* Are you employed/making income? How much?\n* What are your objectives with this money? (Buy a house? Retirement savings?)\n* What is your time horizon? Do you need this money next month? Next 20yrs?\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)\n* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)\n* Any big debts (include interest rate) or expenses?\n* And any other relevant financial information will be useful to give you a proper answer. .\n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 1,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lg15si/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1750417298.0
    },
    {
        "subreddit": "StockMarket",
        "title": "The rally is \"still hated\"",
        "text": "(market analysis and expectations)\n\n[…]\n\nData from market research firms SentimenTrader, Ned Davis Research, and Vanda, cited by Charles Schwab, show that equity exposure remains below historical averages, with mutual funds, hedge funds, and retail traders slowly rebuilding their risk positions.\n\nThat caution was echoed in Bank of America’s latest Global Fund Manager Survey released Tuesday, which showed a sharp drop in risk appetite with a net 28% of investors taking a more-cautious-than-normal level of risk in their portfolios.\n\nThe survey also revealed that equity allocations remain well below average, currently sitting one standard deviation below their long-term norm.\n\nHowever, that caution, some strategists argue, may be more of a tailwind than a headwind for stocks.\n\n[…]\n\n",
        "score": 174,
        "url": "https://finance.yahoo.com/news/stocks-are-back-near-record-highs-investors-still-arent-buying-this-rally-080039974.html",
        "created_utc": 1750247903.0
    },
    {
        "subreddit": "StockMarket",
        "title": "We are now 22 days away from 9th July. Companies face a hard decision",
        "text": "Ships take roughly 22 days to get to the US, so companies have to plan their imports pretty far ahead. Right now, there’s a lot of uncertainty because of the possible tariffs that might kick in soon. Companies basically have to decide right now whether they want to risk sending shipments that could get hit with higher tariffs by July 9th, or just wait and see what happens. This is especially tricky since a lot of goods coming into the US are things that retailers need to have in stock, especially as they prepare for back-to-school or even the early holiday season. The chances are high that a lot of companies can’t or won’t take that risk. \n\nIf too many companies hold back, there could be shortages. That’s probably when we’ll see high inflationary effects, even if Trump changes his mind or delays the tariffs at the last minute. The uncertainty alone is enough to push prices higher, no matter what eventually gets decided.",
        "score": 203,
        "url": "https://www.reddit.com/r/StockMarket/comments/1ldpjba/we_are_now_22_days_away_from_9th_july_companies/",
        "created_utc": 1750172723.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Sunrun -35%, SolarEdge -30%, First Solar -16% as Senate Bill Cuts Green Incentives, EV Credit Ends Early",
        "text": "No paywall: [https://www.investors.com/news/solar-stocks-dive-senate-bill-cuts-solar-wind-energy-incentives/?src=A00220](https://www.investors.com/news/solar-stocks-dive-senate-bill-cuts-solar-wind-energy-incentives/?src=A00220)\n\nSolar stocks such as Sunrun (RUN), SolarEdge Technologies (SEDG) and First Solar (FSLR) plunged overnight after the newly released Senate budget bill would keep a full phase-out of solar and wind energy tax credits by 2028.\n\nThe GOP-led Senate Finance Committee late Monday unveiled changes to the Trump budget bill that passed the House, but left the wind-down of solar and wind incentives.\n\nSunrun stock dived 35.4% early Tuesday, with SolarEdge down 30.3%, Enphase Energy (ENPH) 19.9% and First Solar stock 16.3%. Array Technologies (ARRY) gave up 13.7%, Shoals Technologies (SHLS) 10.1% and Nextracker (NXT) 13.8%. Nextera Energy (NEE) lost 2.8%.\n\nA decline in solar and wind projects could affect demand for battery storage. But Fluence Energy (FLNC) rose 3.%.\n\nTesla (TSLA) has a notable storage business under Tesla Energy while the Senate bill would end the $7,500 tax credit for EVs 180 days after becoming law. That's vs. the House's end-of-2025 cut-off. Tesla stock dipped 0.6% in premarket action.",
        "score": 35,
        "url": "https://www.reddit.com/r/StockMarket/comments/1ldq1x5/sunrun_35_solaredge_30_first_solar_16_as_senate/",
        "created_utc": 1750173925.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Stocks dip, oil rallies as Middle East tensions keep investors on edge",
        "text": "",
        "score": 44,
        "url": "https://www.reuters.com/world/china/global-markets-wrapup-1pix-2025-06-17/",
        "created_utc": 1750155177.0
    },
    {
        "subreddit": "StockMarket",
        "title": "US and UK say they’ve cemented a trade agreement that Trump calls fair for both nations",
        "text": "No paywall: [https://apnews.com/article/trump-starmer-trade-deal-beef-g7-52bea5eb383a0b45d0d83e1982d277bf](https://apnews.com/article/trump-starmer-trade-deal-beef-g7-52bea5eb383a0b45d0d83e1982d277bf)\n\nPresident Donald Trump and Prime Minister Keir Starmer said Monday that they are signing a trade deal that will slash tariffs on goods from both countries.\n\nThe deal does not include tariffs on steel, an especially important piece of bilateral trade. Instead, talks are still going on about whether steel tariffs will be cut to zero as planned in the provisional agreement.\n\nTrump and Starmer announced in May they’d struck an agreement that would slash U.S. import taxes on British cars, steel and aluminum in return for greater access to the British market for U.S. products including beef and ethanol.\n\nBut it did not immediately take effect, leaving British businesses uncertain about whether the U.K. could be exposed to any surprise hikes from Trump.\n\nBritish businesses, and the U.K. government, were blindsided earlier this month when Trump doubled metals tariffs on countries around the world to 50%. He later clarified the level would remain at 25% for the U.K.\n\nStarmer said Monday that the trade agreement is “in the final stages now of implementation, and I expect that to be completed very soon.”\n\nTrump said the deal is “gonna produce a lot of jobs, a lot of income.”",
        "score": 331,
        "url": "https://www.reddit.com/r/StockMarket/comments/1ld5pil/us_and_uk_say_theyve_cemented_a_trade_agreement/",
        "created_utc": 1750110320.0
    },
    {
        "subreddit": "StockMarket",
        "title": "CRCL Hits New High! Bullish Strategy Sharing",
        "text": "Strategy:\n\nBuy Call Options (Call), target price $165 (near today's high), capitalizing on high volatilitySpread Strategy: Buy $155 Call + Sell $160 Call to reduce cost and lock in partial profitsStop Loss: If the stock falls below $152 (support level), consider closing the position\n\nNote: Possible pullback after hours recommend short-term play!",
        "score": 18,
        "url": "https://i.redd.it/fgogkwnz1c7f1.jpeg",
        "created_utc": 1750098896.0
    },
    {
        "subreddit": "StockMarket",
        "title": "How to Code and Scan Stocks Based on Custom Strategies",
        "text": "Hello everyone,\n\nI’m new to stock trading automation and have a few questions. I want to trade based on specific strategies like:\n\nStocks trading above the 200-day moving average\nCandlestick patterns like the Hammer\nHistorical data-based strategies\nIs there any platform or stock scanner where I can write custom code or strategy logic and get a filtered list of stocks that match the criteria at my desired buying price?\n\nBasically, I want to automate the screening process with my own rules. What tools or platforms (free or paid) would you recommend for this?",
        "score": 0,
        "url": "https://www.reddit.com/r/StockMarket/comments/1ldhf8r/how_to_code_and_scan_stocks_based_on_custom/",
        "created_utc": 1750147264.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Even in war situation Israel market is at all time high. What should we' learn from them ?",
        "text": "",
        "score": 311,
        "url": "https://i.redd.it/2riusfn4o57f1.jpeg",
        "created_utc": 1750021408.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Prompt for stock market indicators, with insight and trends to deepen your market understanding",
        "text": "I've seen a few posts on here that show a single chart with a prediction about where the markets are headed. We all know the market is more complex than any single metric and predictions are always going to be wrong to some degree. \n\nBut if you are interested in trying to understand where things *may* be headed, then learning about the key indicators could be a good start. So I wanted to create and share something that might be useful to understand the markets and forces at play. \n\nI created a prompt that builds a summary table of the top indicators, their values, and how you could interpret them. Note, results will vary based on gen AI tool used, so verify with external research if you really want to be 100% sure of the figures. I used GROK 3.0 w/ deepsearch. I also used AI to help refine this list by asking if there are redundant indicators or glaring omissions. Helped me to remove Gold value and small business optimism.\n\nHow would you modify the prompt? What indicators would you add? \n\nWhat do you think of using a prompt and gen AI in this way? \n\nPrompt:\n\nCreate a table with the current values for each of these market indicators. Include columns the date from when these values are derived, a simple definition, insight into the current value, another that talks to the trend and another that provides a sentiment value. \n\nIndicators:\n\n* Shiller CAPE\n* VIX\n* Equity-Bond Yield Spread\n* Yield Curve Inversion\n* Corporate Profit Margins\n* ISM Manufacturing Index\n* Leading Economic Index (LEI)\n* Credit Spreads Widening\n* Consumer Confidence\n* Housing starts\n* Retail sales\n* Unemployment Rate\n\nContext: I am an amateur investor that is looking to learn more about how the market moves as a system. ",
        "score": 2,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lcyse1/prompt_for_stock_market_indicators_with_insight/",
        "created_utc": 1750094425.0
    },
    {
        "subreddit": "StockMarket",
        "title": "(06/16) History Moves in Circles- Interesting Stocks Today",
        "text": "Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Israel Iran Missile Attacks Nuclear News 06 16 2025 ](https://apnews.com/article/israel-iran-missile-attacks-nuclear-news-06-16-2025-c98074e62ce5afd4c3f6d33edaffa069)\n\n[**ORCL (Oracle)**](https://finviz.com/quote.ashx?t=ORCL&p=d)\\-Had a massive run after earnings, going from 170 -> 220. Mainly interested on the short side of this due to the Iran/Israel conflict and oil surging and affecting all stocks on the market. Was interested in a short on the overnight exchanges yesterday. Watching $220 level. Also likely affected by Meta's superintelligence push and signal to continue spending in AI space.\n\nhttps://preview.redd.it/0ukixb2dha7f1.png?width=1012&format=png&auto=webp&s=78af3368802d521cc2226fee9c8d572d9dc9b8c9\n\n[**SATS (EchoStar)**](https://finviz.com/quote.ashx?t=SATS&p=d)\\-Trump urged EchoStar and FCC to resolve spectrum license dispute. This happened at the close on Friday but it seems this won't hold up the move completely (currently $24 vs $27). DirecTV terminated its agreement to acquire EchoStar's satellite television business last year over a failed debt-exchange offer. The FCC told EchoStar it was investigating the company's compliance obligations to provide 5G service in the U.S. (due to its buildout extension and mobile-satellite service).\n\nhttps://preview.redd.it/0s9mqlheha7f1.png?width=1018&format=png&auto=webp&s=0b85bdf390afb1c253ad1840187b074ba09c0959\n\n[**USO**](https://finviz.com/quote.ashx?t=USO&p=d) **/** [**GLD**](https://finviz.com/quote.ashx?t=GLD&p=d) **/** [**VXX**](https://finviz.com/quote.ashx?t=VXX&p=d) \\- Day 4 of Iran/Israel conflict, USO/Vol/gold has been elevated since the attacks. Mainly looking for escalation, since the conflict has been signaled to last weeks, I will likely not do anything in this until escalation occurs. Middle Eastern conflict (especially between countries) drive energy costs up and gold/vol rallies during risk-off events (like war). Not an immediate trade worth looking at today, likely this will happen during OVERNIGHT or afterhours. \n\nhttps://preview.redd.it/ts9ks8c9ha7f1.png?width=1020&format=png&auto=webp&s=2a1e684f04d446719025a99e55d64151e5314cdc\n\n[**CRCL (Circle)**](https://finviz.com/quote.ashx?t=CRCL&p=d) \\- Set ATH after a recent explosive IPO. IPOs lately have been explosive. Already broke the $140 level, watching the $150 level next but unlikely to go extremely heavy in this even if we get up there. Remember that CRCL is heavily intertwined with the C industry and essentially is one of the stableCs. The big C is already near ATH, so I'm interested in seeing if we're able to make a significant move today.\n\nhttps://preview.redd.it/gomr2988ha7f1.png?width=1532&format=png&auto=webp&s=493b1803a257ec7981a240ee18a6fb488c0c918c\n\n",
        "score": 4,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lcsj0w/0616_history_moves_in_circles_interesting_stocks/",
        "created_utc": 1750079767.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 16, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 2,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lcnza4/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1750064495.0
    },
    {
        "subreddit": "StockMarket",
        "title": "What To Expect in Markets This Week: June 16–20, 2025",
        "text": "No paywall: [https://www.investopedia.com/what-to-expect-in-markets-this-week-fed-rate-decision-juneteenth-holiday-us-retail-sales-tesla-robotaxi-rollout-11753474](https://www.investopedia.com/what-to-expect-in-markets-this-week-fed-rate-decision-juneteenth-holiday-us-retail-sales-tesla-robotaxi-rollout-11753474)\n\nThere's a lot on the domestic calendar this week. But investors and the world are watching global affairs, too.\n\nMeanwhile, several market-driving events are due in the coming days. The Federal Reserve's interest rate decision, consumer spending data, and possible news on President Donald Trump's tariffs headline the week. Thursday's Juneteenth holiday will mean a break from trading.\n\nThe Fed will hand down another decision on interest rates this week, with a decision scheduled for Wednesday. The coming weekend could see Tesla providing a significant update on the direction of the electric vehicle maker.\n\nDid consumers in May continue to prop up the economy? Tuesday's U.S. retail sales will make it clear whether strong spending levels continued, while housing construction data will provide insight into whether builders are catching up with lagging inventory levels. Investors will continue to watch for trade developments as negotiations continue between U.S. officials and key trading partners.\n\nIt’s a light week for corporate earnings, highlighted by expected reports from homebuilder Lennar, accounting firm Accenture, grocery chain Kroger, and online used car seller CarMax.\n\n# Fed Interest-Rate Decision Comes Amid Increasing Pressure for Cuts\n\nFed officials have said they are keeping rates steady amid a strong labor market as they monitor inflation data for signs that Trump’s tariffs are driving up prices.\n\nBut the pressure is on the Federal Reserve after May inflation data came in lower than economists expected. Despite comments from President Donald Trump urging the Fed to make a one-point cut, investors don't expect the central bank to take action when its two-day meeting concludes on Wednesday.\n\nThe CME FedWatch Tool, which measures fed funds futures to determine the path of interest rates, indicates that traders overwhelmingly believe that Fed will keep rates at their current levels in June. They also don't expect the central bank to move rates at its late July meeting.\n\nAfter the meeting concludes on Wednesday, Fed Chair Jerome Powell will provide more insight into the central bank’s view on the economy and interest rates when he takes media questions.\n\nOn Tuesday, retail sales figures from May will provide another barometer of the economy's health Consumer spending makes up about two-thirds of the U.S. economy. Meanwhile, housing data will also be scrutinized as affordability issues continue to depress home sales. The latest homebuilder confidence reading on Tuesday will show if construction industry officials see improvements coming in the market, while Wednesday’s housing starts data will indicate whether construction levels are rising amid a need for more housing inventory.\n\n# Tesla Robotaxi Rollout Could Come as Early as Sunday\n\nAfter months of waiting, investors could soon get a key update from electric vehicle maker Tesla (TSLA). CEO Elon Musk said in a recent social media post that the company could roll out its robotaxi service in Austin, Texas, as early as Sunday, June 22. \"We are being super paranoid about safety, so the date could shift,\" Musk wrote.\n\nThe introduction of the company's robotaxi service could be a key moment for Tesla, which is banking on artificial intelligence (AI) and self-driving vehicles to become the transportation technologies of the future. Tesla is well-positioned to lead the market in the emerging technology, analysts have concluded, with Goldman Sachs writing that the EV maker could have a leg up on the competition through its ability to train self-driving through its AI development and to quickly scale production levels of the technology.\n\nDespite a light corporate earnings schedule this week, investors will still get some expected updates from noteworthy companies.\n\nLennar’s (LEN) expected report after the bell on Monday follows the homebuilder's warning of weakness in the housing market in the prior quarter.  The scheduled Friday reports from accounting firm Accenture (ACN) and online car seller CarMax (KMX) will be posted in the shadow of both companies' lower-than-expected profits in the prior quarter.\n\n# This Week’s Calendar\n\n**Monday, June 16**\n\n* Data to Watch: Empire State manufacturing survey (June)\n* Key Earnings: Lennar\n\n**Tuesday, June 17**\n\n* U.S. retail sales (May)\n* Homebuilder confidence (June)\n* Key Earnings: Jabil (JBL), John Wiley & Sons (WLY), and La-Z-Boy (LZB)\n* More Data to Watch: Import/export price index (May), Industrial production/capacity utilization (May), Business inventories (April)\n\n**Wednesday, June 18**\n\n* Housing starts (May)\n* FOMC interest-rate decision\n* Federal Reserve Chair Powell press conference\n* Key Earnings: GMS (GMS)\n* More Data to Watch: Initial jobless claims (Week ending June 14)\n\n**Thursday, June 19**\n\n* Financial markets closed for the Juneteenth holiday\n* Key Earnings: Smith & Wesson Brands (SWBI)\n\n**Friday, June 20**\n\n* Leading economic indicators (May)\n* Key Earnings: Accenture, Kroger (KR), Darden Restaurants (DRI), and CarMax\n* More Data to Watch: Philadelphia Fed manufacturing survey (June)",
        "score": 63,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lbzlpk/what_to_expect_in_markets_this_week_june_1620_2025/",
        "created_utc": 1749991920.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Pizza orders at Pentagon directly proportionate to global conflict warnings",
        "text": "Now this might be delusional to many, but food orders shows high transient population to key locations and hence activity. I can rely on such info that can impact stock markets as a precursor - may be I wouldn’t have bought that NVDA call after all. Right? ",
        "score": 945,
        "url": "https://i.redd.it/yl5ag7ucuy6f1.jpeg",
        "created_utc": 1749938754.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Tesla Q2-2025 to Q1-2026 Revenue and Net Income Projection - Irrespective of Stock Price Direction.",
        "text": "In the base case for 2024, Tesla reported total revenues of $97.69 billion, with nearly half of this, $47.72 billion (48%) originating from the United States. China contributed approximately $20.94 billion, representing just over 21% of total revenue, while the rest of the world, including key markets such as Europe and Canada, accounted for $29 billion or 30%.\n\nHowever, recent trends indicate a notable decline in performance across several major regions, raising concerns about Tesla’s revenue trajectory for the coming year. In the United States, vehicle registrations were down 16% in April (though lower than what one would have expected), but still signaling weaker domestic demand. In China, Tesla's primary foreign market, shipments from the Shanghai plant declined 15% year-over-year in May, as reported by Reuters. Europe has also shown significant signs of contraction. Tesla’s vehicle sales dropped 49% year-over-year in April, with a 36% decline reported in Germany alone. Even as overall electric vehicle registrations increased by 45% across Europe, Tesla’s market share slipped sharply, with sales down 45% in the UK and 20% in Italy. In Canada, the situation is equally challenging. Tesla’s Q1 2025 sales in Quebec province, a key market due to strong EV incentives and high adoption rates fell by a staggering 87% compared to the previous year.\n\nExtrapolating from these regional trends and assuming pricing, accessory sales, and ancillary revenues remain constant, a significant reduction in revenue is expected for the Q2 2025 to Q1 2026 period. The anticipated 15% decline in Chinese revenue alone would result in a $3.14 billion loss, while a 49% drop in European revenue could yield a reduction of approximately $14 billion. Combined with further softening in all Canada provinces, the total revenue shortfall is estimated at around $17.2 billion. This implies an overall decline of at least 18%, bringing Tesla’s projected global revenue down to $80.49 billion.\n\nAssuming Tesla’s cost structure remains unchanged, with an 18.3% contribution margin and $10.3 billion in fixed costs, net income is projected to fall to $4.43 billion for the period, down from $7.17 billion in 2024. This reflects the dual impact of declining sales and shrinking positions across critical global markets.\n\nA decrease in the resale value of Tesla is also in play. A recent iSeeCars study revealed that used vehicles like the Tesla Model S (1 to 5 years old) are now priced over $50,000 below their original MSRP (\\~$30,000 for Model Y). This presents a prime opportunity for used EV buyers. Cox Automotive reports that total used EV sales surged 27% in April 2025, with average prices dropping nearly 2%.\n\nThe decrease in overall revenue and net income projected for Tesla for Q2-2025 to Q1 2025, would not likely translate into a similar decrease of the stock price in the short to medium term, as Tesla valuation is driven by extraordinary factors.\n\n[https://www.iseecars.com/used-car-prices-study#v=202505](https://www.iseecars.com/used-car-prices-study#v=202505)\n\n[https://finance.yahoo.com/news/tesla-us-registrations-slide-16-in-april-new-data-shows-142207040.html](https://finance.yahoo.com/news/tesla-us-registrations-slide-16-in-april-new-data-shows-142207040.html)\n\n[https://electrek.co/2025/05/28/teslas-sales-fall-quebec-market-gets-wiped-out/](https://electrek.co/2025/05/28/teslas-sales-fall-quebec-market-gets-wiped-out/)\n\n[https://www.msn.com/en-us/autos/news/tesla-s-china-sales-slide-again-is-the-ev-king-losing-its-crown/ar-AA1GGmB1](https://www.msn.com/en-us/autos/news/tesla-s-china-sales-slide-again-is-the-ev-king-losing-its-crown/ar-AA1GGmB1)",
        "score": 27,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lc43m4/tesla_q22025_to_q12026_revenue_and_net_income/",
        "created_utc": 1750004097.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Are we due for another stock market crash?",
        "text": "These companies are left holding up the stock market. \nIf they fall, the entire market falls. And it’s the opposite if they all go up the whole market goes up. But the chart tells a different story of the recent trend. They are going up but rest of market is going down. \nHere is what i think of the stocks left holding up the market. \n\nAAPL - weakness in innovation, losing growth\n\nMSFT - might be overbought here\n\nMETA - good ad business but questionable ai product profitability \n\nNFLX - high pe might give back massive gains its had\n\nNVDA - ai sales increase already priced in. everyone says 170 eoy yet price is stalling. People relying on eoy to save them usually not a good thing. \n\nAMZN - aws has competition with new datacenter companies emerging. Needs to take on more debt just to maintain its margin intensive shipping business \n\nGOOG - losing search dominance, ai is good but not perfect yet, to maintain ai dominance intensive spending must happen will affect earnings\n\nCOST - taking a hit from tarrifs, it had a monster run and might give back a lot of gains\n\nTSLA - lead roles stepping down, doesn’t look good for promises of products happening. \n",
        "score": 1540,
        "url": "https://i.redd.it/jvub765s2x6f1.jpeg",
        "created_utc": 1749917371.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Explain bonds like I’m 5 yrs old",
        "text": "I’ve done lots of investing in stocks/options but never understood how a bond works/the benefit of them.. I understand the very basics of you buy at x and it graduates to x price but how does the process work on an app like Robinhood? You purchase and hold for the 3 months then sell higher guaranteed or? I just don’t understand.. any help is appreciated! ",
        "score": 107,
        "url": "https://i.redd.it/tgp6kx25my6f1.jpeg",
        "created_utc": 1749935992.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Global Liquidity Tide Is finally Rising Once Again",
        "text": "The world’s major central banks have already begun to tiptoe away from 2022-24’s broad tightening. Policy rates are being cut, money-supply growth has turned positive again, and even the Federal Reserve has started to slow quantitative-tightening. \n\nThat said, the shift is cautious: real policy rates are still above zero in most advanced economies, balance-sheet runoff is only tapering (not reversing), and inflation is still hovering above target. In other words, the expansion cycle is underway, yet it remains early, deliberate and fragile.\n\nWhy the pivot is considered an “expansion cycle”\n\nA monetary expansion is usually marked by three concurrent signals: lower policy rates, rising money-supply/credit growth, and central-bank balance-sheet support. When all three start moving in the same direction, liquidity conditions ease for households and firms, setting the stage for the next growth upswing.\n\nKey evidence so far\n\nFederal Reserve – mild but clear easing bias\nAfter lifting the fed-funds rate to 4.50 % in 2023, the Fed cut three times in 2024. Futures now price two more quarter-point cuts by October 2025 while policymakers project the same number in their “dot plot”.  ￼\nQT is still running, yet the FOMC voted on 19 March 2025 to slow the monthly runoff cap – an explicit step toward ending balance-sheet shrinkage.  ￼ ￼\n\nEuropean Central Bank – eight cuts and counting\nThe ECB lowered its deposit rate again in early June, to 2 %, its eighth cut since June 2024, comfortably moving policy back inside its estimated neutral range. Bank of England delivered its first trim in February and market-implied rates point to additional reductions in August and November as UK growth stalls near 1 %.  ￼ ￼\n\nMoney-supply and credit gauges – bottoming out\nUS M2 is growing again at roughly 4 % y/y (January 2025), its highest pace since late-2022.  ￼\nHaver Analytics notes that money growth is “positive and rising except for Japan,” signaling a synchronised global inflection.  ￼\n\nS&P 500 forward returns - baseline expectations point to total returns around 8-12 % a year for the S&P 500 through 2026 – roughly 6-8 % earnings growth plus 2-4 % dividends/​buybacks – assuming valuations bleed lower but not abruptly. A repeat of 2020-21’s 20-30 % surges looks unlikely unless inflation drops faster than expected and the Fed reopens full-scale asset purchases. In short, monetary easing should be good for stocks, just not great by recent pandemic-era standards.",
        "score": 105,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lbgii6/global_liquidity_tide_is_finally_rising_once_again/",
        "created_utc": 1749928248.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 15, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 6,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lbvwly/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749978084.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Gold Mining Stocks Surge as Gold and Silver Break Out: Bull Market Enters Hyperdrive",
        "text": "",
        "score": 86,
        "url": "https://www.jpost.com/business-and-innovation/precious-metals/article-857690",
        "created_utc": 1749917399.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Week Recap: Tesla gained more than 10% this week. The S&P 500 closed below 6,000 again due to Israel-Iran crisis. June 9, 2025 – June 13, 2025",
        "text": "First of all, I don't want to be misunderstood. This heat map is weekly that it reflects closing prices from June. 6 to June 13. \n\nIt was a busy week, but the S&P 500 moved in tight range. Until Friday, it had made movement with baby steps, but Middle East crisis escalated again. This had a negative impact on the stock market, but gold and oil prices spiked.\n\nHere are the S&P 500's week-by-week results,\n\nMay. 9 close at 5,659.91 - May. 16 close at 5,957.63 🟢 (+5.26%)\n\nMay. 16 close at 5,957.63 - May. 23 close at 5,802.82 🔴 (-2.59%)\n\nMay. 23 close at 5,802.82 - May. 30 close at 5,911.69 🟢 (+1.87%)\n\nMay. 30 close at 5,911.69 - June 6 close at 6,000.36 🟢 (+1.49%)\n\nJune 6 close at 6,000.36 - June 13 close at 5,976.97 🔴 (+0.38%)\n\n🔸 Monday: Trump announced a meeting between U.S. and China on 9 June in London last friday. The week began with this news and the stock market opened slightly higher. During the session, we were not hear any updates. The stock market closed nearly same point with open state. 🟢\n\n🔸 Tuesday: Commerce Secretary Lutnick said going well about meeting after yesterday's session. The stock market opened slightly higher again. In the session, Commerce Secretary Lutnick said U.S. and Chinese talks going really well and hope end this evening. Also, U.S. and Mexico near deal to cut steel duties and cap imports. The stock market waited for result from meeting and closed higher. 🟢\n\n🔸 Wednesday: Important key datas will be released in the next 3 day. First one was CPI inflation. It came below expectations, but it raised from 2.3% to 2.4% for annual. The meeting has ended. U.S and China completed a 'framework' and send to Trump, Xi for approval. Trump said done. The stock market opened higher. Meanwhile, Scott Bessent pointed to increase U.S. debt ceiling must be raised and extended. It could be biggest crises since 2008-09. China will add 10% tariff on U.S. products and U.S. will add 55% tariff on China products. Both of news was positive, but the stock market closed lower. The S&P 500 remained above 6,000. 🔴\n\n🔸 Thursday: Like CPI inflation, PPI inflation came below expectations, but it raised from 2.4% to 2.5% for annual. Trump said China deal is great. U.S. Dollar Index falls below 97.5 since March 2022. The stock market opened lower. During the session, gold hit $3,400 again amid Israel attacks on Iran. Bessent said he believes we will see more trade deals coming very quickly. The stock market recovered and closed higher. 🟢\n\n🔸 Friday: Israel striked Iran. Oil and gold prices spiked. The stock market opened under heavy selling pressure. Michigan 1-Year Inflation Expectations preliminary came at 5.1%. It was 6.6% in previous month. Conflict made pressure on the all over the world and the stock market closed lower. The S&P 500 dropped below 6,000 again. 🔴\n\nThe S&P 500 closed 6,000 last week. It came nearly all-time-high value, but it struggled to reach this value. Israel-Iran conflict pulled it back to below 6,000. After the under 5,000 values, it made a strong recover. A bit correction could be healthy for the next level. The S&P5 00 has a gap between 5,820 and 5,843. I think, this points could be good enry point for new positions. On the other hand, if we could reach to 6,100 points, we can open positions there. By the way, gold is benefiting from conflicts. It may be in the portfolio. I've been keeping for a long time. It's a bit insurance. How was your week? What do you think? \n\n❓ Note: Many people have asked where screenshots come from in my previous posts. I'm using Stock+ on iPhone and iPad. You can find it on the App Store. If you're using Android, I'm now sure if it's available, but you can try searching \"Stock Map\" or \"Heat Map\". ",
        "score": 31,
        "url": "https://i.redd.it/66gi1lxsyx6f1.jpeg",
        "created_utc": 1749928143.0
    },
    {
        "subreddit": "StockMarket",
        "title": "S&P 500: Market Cap-Weighted Returns by Sector (Week Ending 14 Jun 2025)",
        "text": "**What are Market Cap-Weighted Returns?**\n\nReturns here represent the market cap-weighted average for each GICS sector. Each stock’s contribution is calculated as its return multiplied by its market cap, then divided by the total market cap of the sector. This method reflects the performance of each sector as influenced by the size of its individual constituents.\n\nX-axis shows 5-day return. Y-axis shows 1-month return. Bubble size reflects the total sector market cap.\n\n*Data source:* [*barchart.com*](http://barchart.com/) *• Not financial advice • For educational use only*",
        "score": 12,
        "url": "https://i.redd.it/jjv6wgv8pv6f1.jpeg",
        "created_utc": 1749900759.0
    },
    {
        "subreddit": "StockMarket",
        "title": "[ORCL] Larry Ellison's customer: \"We will take all the capacity you have wherever it is\"",
        "text": "\\[Edit: reposted images in higher resolution\\]\n\nI view Oracle’s (ORCL) post earnings market rally as an extension of the company’s premium valuation. The FY’25 report assured investors that the company is delivering, which is likely contributing to an extrapolation of success estimates for the company.\n\nSummarizing my valuation below, I estimate an intrinsic value for Oracle of around $324 or $113 per share with projected revenues of $180B by the end of my 10-year forecast period. I also expect the company to maintain momentum and increase its operating margin to 35% by 2030 via cross-selling to new customers and upgrading its infrastructure to an autonomous cloud. In my view, the current rally is pricing the fundamentals above a 5-year premium which is too much of a risk.\n\nhttps://preview.redd.it/06gv1ayj3v6f1.png?width=1037&format=png&auto=webp&s=04901d7c65221ad6bdb50b98fb9f282285c21fcb\n\nAt these price-levels I suspect that many investors \\[including myself\\] may have missed the boat on Oracle, and that is ok.\n\n# Oracle Is Entering A Growth Upcycle\n\nIn Oracle’s FY 25 earnings call, they outlined their move to ramp up cloud infrastructure capacity in order to meet an unprecedented $138B worth of remaining performance obligations – A number which is expected to continue growing.\n\nOracle’s chairman, Mr. Ellison noted that they recently got an order that said\n\n*“We will take all the capacity you have wherever it is.”*\n\nWhile the statement is true, keep in-mind that it’s also a well-crafted pitch to investors.\n\nThe company posted a record $57.4B FY ‘25 revenue, up 8% from the $52.96B in 2024, with the Oracle Cloud Infrastructure \\[OCI\\] contributing 74%. The company expects to break out of its single digit growth rate, and has guided for a >16% revenue growth in 2026.\n\nhttps://preview.redd.it/h8tnim8yzu6f1.png?width=822&format=png&auto=webp&s=fe5be3280a2c2bea4a2b337bfd9d6c2e25fe0894\n\nThere is currently a supply constraint for cloud infrastructure across the industry, and as long as AI applications are producing meaningful demand I expect the revenue growth for Oracle to persist. In my model, I will pull the revenue growth line forward for the next 4 years, but I do expect normalization after that and revert to single digit growth.\n\nAs you can see from the image below, the problem I have with Oracle is that revenues did not meaningfully improve prior to 2022 i.e. when AI entered the scene.\n\nhttps://preview.redd.it/v8alsu553v6f1.png?width=1039&format=png&auto=webp&s=7a6fa899bdd9d32d43eb57aa51ec7b4c38607f86\n\nIn my view, the pre-2022 stagnation was a reflection of a brand-name impact from the past that kept customers away from Oracle’s products. Further, AWS and other cloud vendors provided viable alternatives, drawing market share. However, Oracle now has a chance to reinvent itself as more customers are steered into their cloud due to the lack of supply among cloud peers.\n\n# Going All In On The Cloud\n\nThe company has invested $21.2B in capex, primarily consisting of infrastructure for the cloud business. For 2026, Oracle is intending to ramp up capex to over $25B.\n\nThe company is making a large bet on the cloud, and is even increasing leverage by around $5.6B to fund the projects. They will likely further increase debt levels in order to build their data centers, but I see this as an opportunity to positively recapitalize the company and maximize returns. For reference, Oracle currently has some $115B in debt, representing a Debt to Equity \\[market value\\] ratio of 18.6%. In my view, the company has room to increase this ratio and taking on more debt to fund a high-demand business is the right move.\n\n# Oracle’s Pitch To AI Demand: The Vector Database\n\nThe fundamental product for Oracle is the database. Everything that oracle does, ties in some way to their database products with the core being relational (table) databases such as MySQL. Over time, the company has launched products that complement their database products by offering a place to host their database - such as the cloud, and creating software products from the database such as their ERP/CRM products.\n\nNote that alongside the database, Oracle provides all the standard cloud products such as compute, storage, and their derivatives.\n\nNow with the rise of AI demand, Oracle is optimizing the database for use of AI applications. This comes in the form of a vector database (highly recommended Fireship's YT video on vector databases) that is able to store data by similarity via embeddings, allowing AI applications to draw additional context from the database when the user makes a query.\n\nhttps://preview.redd.it/uhv4ndf10v6f1.png?width=1280&format=png&auto=webp&s=85dae7283c5e4d350e6be0c42f835ff3709d6126\n\nOracle is pitching the vector database as a way for customers to increase the efficacy of their AI model, as well as a completely private product that can be accessed in the cloud. This enables customers to use their own proprietary data for context so that the AI model can produce tailored results. Oracle is not the only vector product on the market, and the space has seen a surge of innovation, but the company does offer database privacy features that are key to customers with proprietary data.\n\nIn my view, it will be a tight race between all cloud providers as they innovate in rapid succession. While Oracle holds the rights for MySQL and lends them under license agreements, competitors offer the open-source alternatives such as Postgresql - a highly scaleable relational database \\[with many plugins, including for vector data\\]. These alternatives are offered and supported in all large cloud providers such as AWS, Google Cloud, etc. This is why I don’t expect Oracle to maintain any persistent technological edge, and that their primary revenue driver will be the supply shortage for cloud infrastructure.\n\nAbout a year ago, I was in a cloud presentation event. After the keynotes, we were chatting around with people. Most of the programmers shared their experience with either AWS or Google, and there was only 1 person that pitched Oracle cloud. He was a bit more on the eccentric side, but made a compelling argument about the price to performance for OCI. In the future, I expect OCI to go much more mainstream among the development community, developers to start experimenting, and later pitching their managers for OCI.\n\nHowever, at the end of the day Oracle’s largest revenue contributors will continue being enterprise-level companies, so a bet on Oracle is a bet that these companies are going to need cloud & database products and a direct line of support.\n\n# Valuation\n\nUsing the assumptions and updated numbers, I have constructed an unlevered DCF model for Oracle:\n\n* Revenue growth 20%, 25%, and 20% in the next three years respectively. Converging on the riskfree rate after that. This results in revenues of $180B at the end of my forecast period, up some 3x from 2025.\n* An increase in profitability after the infrastructure ramp due to moving an increasing portion of infrastructure from gen. 2 cloud to an autonomous cloud.\n* Total reinvestment \\[net of depreciation\\] around $20B in the next 2 years.\n* Negative free cash flows during the ramp period, up to 46B in year 10.\n* Low, 8.5% cost of capital from the outset reflecting the stability of the organization.\n\nhttps://preview.redd.it/s3bzxvh93v6f1.png?width=1040&format=png&auto=webp&s=bdd8aa0fb5d4daa040fc0a39ed444216b8b7804b\n\nThe sum of present value comes up to $421, netting out debt and cash, I get an intrinsic value of $324 or $113 per share for the company.\n\nWhile the debt is a great financing vehicle for CapEx investment, it still weighs on the final valuation and is reducing the intrinsic value by some $100B.\n\n# Pricing At Maturity\n\nUsing the forecasts from my model, I estimate that Oracle will be able to produce around $46B in free cash flows by the end of my 10-year forecast period. At a 2035 20x FCF multiple, the forward pricing comes up to $920B. Discounting at a 8.5% rate back 10 years, I get a pricing of $407B or **$142** per share.\n\n`[920 / 1.085^10 = 407]`\n\nBy comparing both approaches we see that despite being overvalued at the current price levels, the value of the equity may rise by an 8.5% CAGR for 10 years to reach a $920B valuation. I did not assign any excess returns to the company as I expect increased competition in the cloud infrastructure space, database innovation, and the ERP software.\n\nMy $920B pricing is indicative of just how far investors can take Oracle’s valuation with the *generous* assumption that they can wait out the price to value gap. In my view, if Oracle breaks above this point, its fundamentals will be fully priced-in for the next 10 years.\n\n# Conclusion\n\nAs of the time of writing, Oracle has a market cap of $618B, indicating that the market is ahead of my $324B valuation by around 7 years, and 5 years ahead of my $407B pricing. This indicates that investors need to hold the company for 5-7 years before the fundamentals break-even on the current price.\n\nIn my view, 3 years is an acceptable premium for quality companies, and barring any major flaws in my predictions, I view the risk to return asymmetry to be unfavorable at the current price.\n\nUsing my intrinsic value, the 3-year premium range for the company would come up to $144 per share, which is where I would consider Oracle to be a portfolio candidate.\n\n`[113 * 1.085^3 = 148]`\n\nThe company is on a growth uptrend, and I expect it to continue for at least the next 2 years. AI may not be the only growth driver, and Oracle may sustain higher growth rates from its ERP software applications, as well as the opening up of dormant cloud demand for industries such as the military industry with the digitization of drones. Because of this, it is likely that the company will continue trading 3 to 5 years ahead of the fundamentals.\n\nInvestors that had a position in the company pre-earnings may consider taking profit after the company shows a slowdown in its acceleration, which may take at least a few quarters. Finally, going short on the stock may not be wise despite the price being ahead of the fundamentals.\n\n# Risks\n\n* The cloud infrastructure demand cycle may be shorter than expected, and many customers may abandon their AI projects or switch to ready-made solutions by some of the large vendors. Innovation avenues in this space may become more narrow and the demand for training compute will alleviate the supply shortage.\n* Large AI vendors may produce breakthroughs in the amount of compute required for AI inference and training, significantly changing the demand curve. Google, Microsoft and most other large vendors are already releasing light versions of their models \\[phi, gemma\\].\n* Oracle had a 10-year period with little meaningful growth pre-2022 which was partly driven by the innovation of database technologies from cloud competitors. If the company fails to maintain a unique aspect to their value proposition \\[such as the mentioned private cloud\\], it will find it difficult to keep up growth after the next few years.\n* Customers may switch their database preferences from a centralized and highly scalable database like MySQL to smaller and localized versions such as SQLite. MySQL is a good fit for large companies, but there is a case to be made that SMBs do not require the scale of a database of Oracle’s caliber. The development community has been increasingly experimenting with smaller and open-source alternatives, which may lead to more pitches from developers to managers to switch to lighter alternatives.\n* Oracle’s software and infrastructure is sometimes reported to be difficult to work with. This has been a drag on the company’s brand reputation for software and databases alike.\n* AI is great at producing insights from technical documentation, which enables easier implementations & troubleshooting of alternative databases, eroding Oracle’s support services moat.\n* Oracle will keep maintaining pricing power relative to the quality of their competitors – if at any point competitive databases become higher quality or less risky to adopt, we will likely see an increase in the quality of Oracle products.",
        "score": 17,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lb4fcs/orcl_larry_ellisons_customer_we_will_take_all_the/",
        "created_utc": 1749892315.0
    },
    {
        "subreddit": "StockMarket",
        "title": "MASSIVE 60000 SPY PUT are in Play today",
        "text": "Retail and Institution Traders are making BIG BETS on the market outlook for next few weeks. \n\nThis is why:\n\nIn 2020, Iran bombed Several US bases in Iraq as a retaliation when the US killed their general with a drone. \n\nThe tension didn't last long because Biden ordered US forces to stand down and not to retaliate back.\n\nBUT This time will be different !!! If Iran decides to bomb US bases again in Iraq, Trump might order US forces to attack back.\n\nLet hope it is not coming true. Be Safe with your Risk Management Everyone!!! \n\n[Source](https://www.bbc.com/news/world-middle-east-51028954)",
        "score": 202,
        "url": "https://i.redd.it/yq76oic3aq6f1.jpeg",
        "created_utc": 1749835082.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 14, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 0,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lb49h5/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749891663.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 13, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 3,
        "url": "https://www.reddit.com/r/StockMarket/comments/1lab704/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749805271.0
    },
    {
        "subreddit": "StockMarket",
        "title": "(06/12) Interesting Stocks Today- BA Airplane Crash and Offerings",
        "text": "Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Air India Plane Crash ](https://apnews.com/live/air-india-plane-crash-ai171-ahmedabad-london)\n\n[**BA (Boeing)**](https://finviz.com/quote.ashx?t=BA&p=d)\\-Air India Flight AI171, a Boeing 787‑8 Dreamliner carrying 242 people from Ahmedabad to London, crashed shortly after takeoff on June 12, 2025 due to suspected bird strikes. Boeing shares plunged \\~8% pre‑market as this marks the 787’s first ever crash with total loss. Mainly interested to see if there is some kind of selloff and subsequent recovery. BA always has some selloff when there is a plane crash, but frankly this appears to be a bird strike so mainly a fault of the pilots and not the company (for what we know now).\n\nhttps://preview.redd.it/ktr2dr56xh6f1.png?width=1512&format=png&auto=webp&s=6038e5d3093132e8fe234f051f20a4c9f1453710\n\n[**OKLO (OKLO)**](https://finviz.com/quote.ashx?t=OKLO&p=d)\\-Announced a tentative U.S. Air Force contract to provide small modular reactor-based nuclear power to Eielson AFB in Alaska. This stock broke ATH yesterday, one of the more interesting levels I was looking at was $60. They immediately did an offering of $400M in stock afterwards, so looking out to see if there's a continued selloff and we cool off. \n\nhttps://preview.redd.it/1f0tzm98xh6f1.png?width=1017&format=png&auto=webp&s=13b2c5a96ab54741832da35ee132f5025a9e900f\n\n[**GME (GameStop)**](https://finviz.com/quote.ashx?t=GME&p=d)\\-Announced a proposed private placement of $1.75B in convertible senior notes after earnings; Wedbush released a note this morning questioning whether GME can replicate MSTR's BTC strategy. Immediately sold off and I'm interested in the $20 level if there's any kind of bounce. Not interested in any sort of long-term hold, more of a day trade/scalp.  \n\nhttps://preview.redd.it/mnocdtb9xh6f1.png?width=1030&format=png&auto=webp&s=0b0238437137c6fdd58b0d851409e95d41332d37\n\n[**QUBT (Quantum Computing Inc.)**](https://finviz.com/quote.ashx?t=QUBT&p=d) / [**IONQ (IonQ)**](https://finviz.com/quote.ashx?t=IONQ&p=d) / [**RGTI (Rigetti Computing)**](https://finviz.com/quote.ashx?t=RGTI&p=d)\\-Nvidia CEO Jensen Huang stated at GTC Paris that quantum computing is “reaching an inflection point,” triggering a decent move upwards yesterday. Every quantum stock surged on this news near the open yesterday and we've fallen back considerably, overall don't expect this to make a massive move today.\n\nhttps://preview.redd.it/xpwwyxsaxh6f1.png?width=1024&format=png&auto=webp&s=f1372197e95587f792010783a28f20037aa09dee\n\n**IPOs Today:** **CHYM**",
        "score": 13,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l9m4mv/0612_interesting_stocks_today_ba_airplane_crash/",
        "created_utc": 1749733947.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Musk's regret caused TSLA's sudden surge. What's wrong with this?",
        "text": "**I'd rather bet on market effects from the second round of U.S.-China tariff talks than trust the Musk-Trump political theater. Given Tesla's current situation, a near-term sharp correction remains likely. For long-term plays, focus on AI stocks tied to U.S.-China dynamics.**\n\n* **Software – Infrastructure**: $FTNT, $YEXT, $GTLB, $ADBE, $NTNX, $BOX, $ZS\n* **IT Services**: $NET, $DOCN, $BASE, $MDB, $IT, $ACN, $SNOW\n* **Interactive Media & Services**: $META, $CARG\n* **Commercial Services Providers**: $ACVA\n* **Credit Services**: $MA\n* **Software – Applications**: $QTWO, $ADSK, $DDOG, $DT, $CVLT, $CRM, $UBER, $WK, $BGM, $NOW, $HUBS, $INTU\n* **Hardware**: $AAPL\n\n",
        "score": 1116,
        "url": "https://www.reddit.com/gallery/1l8poru",
        "created_utc": 1749639603.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Wall Street dips as investors focus on Middle East tension | Stock Market News",
        "text": " June 11 (Reuters) - Wall Street dipped on Wednesday, with investors spooked by Middle East tensions, while a tame inflation report calmed concerns around tariff-driven price pressures and traders awaited more details on China-U.S. trade talks.\n\nThe S&P 500 erased modest gains after a U.S. source said the U.S. embassy in Iraq was preparing for evacuation due to heightened security risks in the region. A senior Iranian official said earlier that Tehran will strike U.S. bases in the region if nuclear negotiations fail and conflict arises with the United States. ",
        "score": 100,
        "url": "https://www.livemint.com/market/stock-market-news/wall-street-dips-as-investors-focus-on-middle-east-tension-11749667866262.html",
        "created_utc": 1749672848.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 12, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 5,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l9ho5v/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749718868.0
    },
    {
        "subreddit": "StockMarket",
        "title": "US Stocks drift near their record following an encouraging inflation update",
        "text": "",
        "score": 101,
        "url": "https://apnews.com/article/stock-markets-china-trump-tariffs-74076b65c39f8f7ddc145a7b63d314f9",
        "created_utc": 1749665959.0
    },
    {
        "subreddit": "StockMarket",
        "title": "U.S. inflation rises 0.1% in May from prior month, less than expected. Excluding food and energy, core CPI came in respectively at 0.1% and 2.8%, compared with forecasts for 0.3% and 2.9%..",
        "text": "* The consumer price index increased 0.1% for the month, putting the annual inflation rate at 2.4%.\n* Excluding food and energy, core CPI came in respectively at 0.1% and 2.8%, compared with forecasts for 0.3% and 2.9%.\n* Weakness in energy prices helped offset some of the increases, and a handful of other key items expected to show tariff-related jumps, vehicle and apparel prices in particular, actually posted declines.\n\n  \nAll around beats for the CPI print today. However, market still falters after dissapointment from the China trade deal outcome... \n\nSource is from CNBC. ",
        "score": 22,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8y9hi/us_inflation_rises_01_in_may_from_prior_month/",
        "created_utc": 1749661932.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Trump tariffs may remain in effect while appeals proceed, U.S. Appeals court decides",
        "text": "No paywall: [https://www.yahoo.com/news/trump-tariffs-may-remain-effect-002514352.html](https://www.yahoo.com/news/trump-tariffs-may-remain-effect-002514352.html)\n\n(Reuters) -A federal appeals court allowed President Donald Trump's most sweeping tariffs to remain in effect on Tuesday while it reviews a lower court decision blocking them on grounds that Trump had exceeded his authority by imposing them.\n\nThe decision by the U.S. Court of Appeals for the Federal Circuit in Washington, D.C. means Trump may continue to enforce, for now, his \"Liberation Day\" tariffs on imports from most U.S. trading partners, as well as a separate set of tariffs levied on Canada, China and Mexico.\n\nThe appeals court has yet to rule on whether the tariffs are permissible under an emergency economic powers act that Trump cited to justify them, but it allowed the tariffs to remain in place while the appeals play out.\n\nThe tariffs, used by Trump as negotiating leverage with U.S. trading partners, and their on-again, off-again nature have shocked markets and whipsawed companies of all sizes as they seek to manage supply chains, production, staffing and prices.\n\nThe ruling has no impact on other tariffs levied under more traditional legal authority, such as tariffs on steel and aluminum imports.\n\nA three-judge panel of the U.S. Court of International Trade ruled on May 28 that the U.S. Constitution gave Congress, not the president, the power to levy taxes and tariffs, and that the president had exceeded his authority by invoking the International Emergency Economic Powers Act, a law intended to address \"unusual and extraordinary\" threats during national emergencies.\n\nThe Trump administration quickly appealed the ruling, and the Federal Circuit in Washington put the lower court decision on hold the next day while it considered whether to impose a longer-term pause.\n\nThe ruling came in a pair of lawsuits, one filed by the nonpartisan Liberty Justice Center on behalf of five small U.S. businesses that import goods from countries targeted by the duties and the other by 12 U.S. states.\n\nTrump has claimed broad authority to set tariffs under IEEPA. The 1977 law has historically been used to impose sanctions on enemies of the U.S. or freeze their assets. Trump is the first U.S. president to use it to impose tariffs.\n\nTrump has said that the tariffs imposed in February on Canada, China and Mexico were to fight illegal fentanyl trafficking at U.S. borders, denied by the three countries, and that the across-the-board tariffs on all U.S. trading partners imposed in April were a response to the U.S. trade deficit.\n\nThe states and small businesses had argued the tariffs were not a legal or appropriate way to address those matters, and the small businesses argued that the decades-long U.S. practice of buying more goods than it exports does not qualify as an emergency that would trigger IEEPA.\n\nAt least five other court cases have challenged the tariffs justified under the emergency economic powers act, including other small businesses and the state of California. One of those cases, in federal court in Washington, D.C., also resulted in an initial ruling against the tariffs, and no court has yet backed the unlimited emergency tariff authority Trump has claimed.",
        "score": 171,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8f54p/trump_tariffs_may_remain_in_effect_while_appeals/",
        "created_utc": 1749602002.0
    },
    {
        "subreddit": "StockMarket",
        "title": "(06/11) LIDARs and Teslas and Space- and Interesting Stocks Today",
        "text": "Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Us China Officials Say Consensus Reached On Geneva Framework](https://www.bloomberg.com/news/articles/2025-06-10/us-china-officials-say-consensus-reached-on-geneva-framework?srnd=homepage-americas)\n\n[**TSLA (Tesla)**](https://finviz.com/quote.ashx?t=TSLA&p=d)\\-More easing in Trump/Musk tensions, both have tweeted reconciliatory tweets earlier this morning and it seems their feud is at an end. Trump announced a 'done deal' in the rare earths deal, causing a small spike to the market premarket. The buying opportunity was the day of the tweets but obviously, still interesting to see if the Trump/Musk relationship can be completely repaired. It seems both sides are playing damage control and trying to repair the rift. There's been huge discontent from Musk due to Trump's \"Big Beautiful Bill,\" but we've moved from 325->275 ->335. MASSIVE move and trade of the month.\n\nhttps://preview.redd.it/4a28ccu4sa6f1.png?width=1032&format=png&auto=webp&s=74b60b7cfbe3d3d3b5f6bace41a615485339bbd7\n\n[**OUST (Ouster)**](https://finviz.com/quote.ashx?t=OUST&p=d)\\-Premarket announcement that the US Department of Defense approved its OS1 digital lidar sensor for use in unmanned aerial systems. Most of the move occurred premarket, but will be watching to see if we make another leg higher- the daily chart looks near parabolic if we move up again today/tomorrow with a move from 7.50 to 20 in the past month.\n\nhttps://preview.redd.it/8h5pc7dvra6f1.png?width=1014&format=png&auto=webp&s=f93c9fffde49c714bfd07981d2ada0bd6fbc02d3\n\n[**CRWV (Coreweave)**](https://finviz.com/quote.ashx?t=CRWV&p=d)\\- Staying surprisingly resilient at \\~$160, we've also seen upward momentum an hour before the open (154->160). Overall nothing too compelling for a short unless we rocket past 160 to something ludicrous, this has stayed up longer/stronger than CRCL so far more interested in this.\n\nhttps://preview.redd.it/68c1yyvnra6f1.png?width=1012&format=png&auto=webp&s=cfd15c8fc7e8e150182457c8a7bdc700105a9418\n\n[**ASTS (AST SpaceMobile)**](https://finviz.com/quote.ashx?t=ASTS&p=d)\\-Somewhat still hovering fairly high from Jeff Bezos posting a picture that implied a partnership. This has diverged from RKLB's move up, and is still hovering around $36. Nothing too compelling unless we make a leg higher. Again, nothing confirmed from Bezos or Amazon, so the move may fade if no formal announcement follows.\n\nhttps://preview.redd.it/yn2sk5xrra6f1.png?width=1024&format=png&auto=webp&s=0b41513b9c4ffcddd1cecb38a4fc92ee08ad05ae\n\n**Earnings today:** [**ORCL**](https://finviz.com/quote.ashx?t=ORCL&p=d)",
        "score": 11,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8sb1a/0611_lidars_and_teslas_and_space_and_interesting/",
        "created_utc": 1749647479.0
    },
    {
        "subreddit": "StockMarket",
        "title": "What impact will the second round of U.S.-China trade talks bring? Probably AI sector would be impacted.",
        "text": "US-China trade talk continue to make progress, there's high likelihood that relations will move in a more positive direction. This could trigger a significant rebound in AI-related stocks that were previously hit hard by the tariff war. In particular, Chinese AI stocks may see even stronger performance. The following tickers may see significant volatility in the near term.\n\n* **Software – Infrastructure**: $FTNT, $YEXT, $GTLB, $ADBE, $NTNX, $BOX, $ZS\n* **IT Services**: $NET, $DOCN, $BASE, $MDB, $IT, $ACN, $SNOW\n* **Interactive Media & Services**: $META, $CARG\n* **Commercial Services Providers**: $ACVA\n* **Credit Services**: $MA\n* **Software – Applications**: $QTWO, $ADSK, $DDOG, $DT, $CVLT, $CRM, $UBER, $WK, $BGM, $NOW, $HUBS, $INTU\n* **Hardware**: $AAPL\n\n",
        "score": 184,
        "url": "https://i.redd.it/8we9rd5cg46f1.jpeg",
        "created_utc": 1749572121.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Navitas Semiconductor : From 2 dollars to 8 dollars ...",
        "text": "**Hi everyone,**\n\nI know this company that was recommended on subreddits focused on smXXl cxps. And it's true, the technology is really interesting, but often, it takes years, and sometimes, these companies go under along the way... But this time, they just signed a partnership with Nvidia for data centers. Apparently, they have a technology that’s going to revolutionize the infrastructure. Just a few days ago, the stock was trading at $2, today, it's at $8. While all my other stocks were tanking today, Navitas was still up another 20%...\n\nI follow the news quite closely, and yet I'm constantly bombarded with talk about big caps and the MAG7 instead of putting the spotlight on companies like this one, which just closed a deal that could push it to an entirely new level. I'm frustrated to miss out on this kind of opportunity, because it really could have been a meaningful investment,even just 3–4 days after the announcement.\n\nBut instead of hearing about this kind of news, we have to put up with nonsense about Tesla, Apple and their stupid Vision Pro, Microsoft doing nothing new with Windows anymore... and I’m forgetting others.\n\nIsn't there a site to stay informed about the real game-changers, please?",
        "score": 23,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8e9c2/navitas_semiconductor_from_2_dollars_to_8_dollars/",
        "created_utc": 1749599466.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 11, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 2,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8nu5k/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749632461.0
    },
    {
        "subreddit": "StockMarket",
        "title": "BYD 'stock dividend shares to be distributed', what to expect?",
        "text": "My holding was c.£70 and it's dropped 65% in the few minutes since this notice appeared saying 'stock dividend shares to be distributed after 29.7.25'. \n\nIs my holding now going to stay massively down, or should I expect large income from dividends, or is the stock splitting or something? First time I've seen something like this. ",
        "score": 76,
        "url": "https://i.redd.it/0k51vr4ho26f1.png",
        "created_utc": 1749549354.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Innodata stock is crashing, what’s happening?",
        "text": "Hi everyone,\n\nI’ve been investing in Innodata for some time now and was really excited to see the stock rallying recently. It was trading around $60 per share before April 2, and the company’s guidance pointed toward strong, even hypergrowth. But suddenly, over the past two days, the stock has dropped significantly, and I can’t find any relevant news or events to justify such a steep decline. The drop was so sharp that my stop-loss got triggered, which had never happened to me before. My position was sold with only a modest gain. \n\nThis drop feels both unexpected and extreme. Does anyone have any insights?\n\nthank you :)",
        "score": 18,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l85763/innodata_stock_is_crashing_whats_happening/",
        "created_utc": 1749577493.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Is the AI Frenzy Far from Over? Which Concept Stocks Are Reaching New Highs?",
        "text": "There has been a chart circulating online comparing the stock trends of Cisco vs. Nvidia. The sharp decline in $NVIDIA (NVDA.US)$'s stock price at the beginning of the year brings back memories of Cisco in the 1990s. After the burst of the dot-com bubble, companies like $Cisco (CSCO.US)$ and $Intel (INTC.US)$ saw their stock prices plummet. Investors want to know if Nvidia will face the same fate.\n\nHowever, there has been a new twist in this chart. On April 30th, a pivot occurred with Microsoft's earnings; Nvidia also continued its upward trend when it announced a series of contracts from the Middle East.\n\nThe quarterly earnings released by Microsoft sends a clear message: the AI juggernaut rolls on, at least for now. Since the earnings release, Microsoft's stock price has soared over 17%. This news has been comforting to the entire AI sector, proving that companies are not disappointed in this highly hyped technology. Microsoft's strong performance has also led the market to infer an increased demand for Nvidia chips.\n\nAdditionally, with Trump and bin Salman endorsing the US-Saudi AI deal, Nvidia said it will sell hundreds of thousands of AI chips in Saudi Arabia, with a first tranche of 18,000 of its newest \"Blackwell\" chips going to Humain, an AI startup just launched by Saudi Arabia's sovereign wealth fund. Nvidia's stock price has recovered from its sharp decline at the beginning of the year.\n\n**Is the AI frenzy far from over?**\n\nRecent trends in AI concept stocks indicate that the AI \"stock market fuel\" is far from running out. On Monday, $Applied Digital (APLD.US)$ announced a transformative $7 billion, 15-year AI data center lease agreement with $CoreWeave (CRWV.US)$, a leading AI hyperscaler. Applied Digital saw its stock price skyrocket by 48.46%, closing at $10.14. Meanwhile, CoreWeave's stock has more than doubled since the start of the year.\n\n$Tempus AI (TEM.US)$, a \"precision medicine\" company that leverages artificial intelligence to better treat patients, Shares soared 15% on Monday. Late Friday, the company announced an initiative it calls Fuses, a program designed to transform therapeutic research and build the largest diagnostic platform using its novel foundation model. Since the beginning of the year, Tempus AI's stock has surged by 88%, while the telehealth firms $Hims & Hers Health (HIMS.US)$ has skyrocketed nearly 135%.\n\n**$Palantir (PLTR.US)$'s stock price has also continued to reach new highs, rising 74% since the beginning of the year. The up-and-coming AI firm $BGM is up over 88% so far this year.**\n\nFurthermore, $Broadcom (AVGO.US)$ will release its second-quarter financial report after the market closes on June 5th. Wall Street expects the chipmaker to report growing revenue and profits fueled by demand for AI chips. Broadcom may soon become the first big tech stock to break historical highs. Its current stock price is $248.71, just under 1% lower than the peak of $250.45 in December last year.",
        "score": 0,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l8tc5g/is_the_ai_frenzy_far_from_over_which_concept/",
        "created_utc": 1749650193.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Wall Street forecasts haven't fully recovered from tariff turmoil",
        "text": "[Wall Street strategists aren't scared](https://finance.yahoo.com/news/the-bull-case-for-stocks-is-growing-among-wall-street-strategists-172542612.html) of a summer slowdown for stocks despite some indications of a cooling labor market and [slowing economic activity.](https://finance.yahoo.com/news/us-economy-shows-signs-of-paralysis-as-new-data-reveals-hiring-slowdown-activity-contraction-in-may-133658422.html)\n\nIn the past month, several strategists have defended their S&P 500 year-end targets in the range of 6,300 to 6,500, noting that [the most dire outcomes from tariffs may no longer be on the table](https://finance.yahoo.com/news/the-china-tariff-pause-has-wall-street-scaling-back-recession-calls-100054918.html). On Monday, the benchmark index was trading around 6,010, about 2% from the record closing high.\n\nIn a note titled \"Don't fight it,\" Morgan Stanley chief investment officer Mike Wilson pointed out that a \"moderate slowdown in growth\" was likely already priced in earlier this year when the average S&P 500 stock fell nearly 30%.\n\n\"In our experience, stocks and equity market internals move well ahead of lagging economic data and earnings results,\" Wilson said.",
        "score": 186,
        "url": "https://i.redd.it/7czbivyoay5f1.png",
        "created_utc": 1749496333.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Is this Actually a bull market?",
        "text": "https://preview.redd.it/n8wd5q0ydw5f1.png?width=2560&format=png&auto=webp&s=621ff26557ff38287c417e2a05d08032604603f6\n\nTake a look at this chart.\n\nOrange line = SPX  \nBlue line = SPX without AAPL, MSFT, META, NFLX, NVDA, AMZN, GOOGL, COST\n\nNow tell me honestly… is this really a bull market?\n\nOr is it mostly tech bull market where tech names like Nvidia, Apple, Microsoft, Meta, Netflix and Google and Amazon too... \n\nBecause if you remove these 7 tech names plus Costco too, the rest of the market looks like it’s been going sideways or even rolling over hard. This ain't a healthy, broad-based rally. It’s basically just a handful of mega caps doing all the heavy lifting while the rest of the market is lagging behind big time. \n\nThere are other few more stocks that have done well such PLTR and WMT and HOOD and UBER that are much at their ATH... Feels like everyone’s celebrating all-time highs, but under the surface it's a different story. \n\nhttps://preview.redd.it/d4yxscbwew5f1.png?width=2560&format=png&auto=webp&s=21b2b8b618e8a5bbe5537f2d1763fb6bf213270f\n\nhttps://preview.redd.it/jzuwh57uew5f1.png?width=2560&format=png&auto=webp&s=bf3627676eaf0c62dacbe9bb239d39ea42585b32\n\nMost stocks aren’t even close to their highs. **Such as AMD, Paypal, Target, NKE, ADBE, ABNB a**nd many many more. Those big names are down big times from **50% or even 70%** more down from their **ATH**  \nEven chinese stocks such as BABA and Bidu are down and trading at very low valuations... \n\nhttps://preview.redd.it/5obxiztzew5f1.png?width=2560&format=png&auto=webp&s=cb76675d19ec250fbd6026b2d6b06e627639fc27\n\nhttps://preview.redd.it/1fxaz2uzew5f1.png?width=2560&format=png&auto=webp&s=817e0673d32b99ecbdc0d16645aeaa0ba12b4f2b\n\nhttps://preview.redd.it/issgebt5fw5f1.png?width=2560&format=png&auto=webp&s=c1d77aef58fc743f8ad65eb998e7e58aba7756ed\n\nPersonally i would like to ask how can any average person who is coming hot in this market which might seem easy on surface but very to invest in because on one hand you are either investing in tech stocks that are highest gainers but at absurd valuations or betting on losers that haven't gained any momentum in this market even though stock market is at pretty pretty close to ATH. \n\nSo again… is this really a bull market?",
        "score": 398,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l742x9/is_this_actually_a_bull_market/",
        "created_utc": 1749473781.0
    },
    {
        "subreddit": "StockMarket",
        "title": "(06/10) IPO Movers and Rockets! Interesting Stocks Today",
        "text": "Hi! I am an ex-prop shop equity trader. This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed! I am targeting potentially good candidates for short-term trading; I have no opinion on them as investments. The potential of the stock moving today is what makes it interesting, everything else is secondary.\n\nNews: [Zuckerberg Recruits New Superintelligence AI Group At Meta](https://www.bloomberg.com/news/articles/2025-06-10/zuckerberg-recruits-new-superintelligence-ai-group-at-meta?srnd=homepage-americas)\n\n[**CRWV**](https://finviz.com/quote.ashx?t=CRWV&p=d)\\-DA Davidson released commentary suggesting their pro forma had underestimated its debt situation while not properly accounting for borrowing costs. This stock is ridiculously run up since IPO (\\~4x it's opening price). Daily setup doesn’t look like a clean short, but watching to see if it mimics CRCL’s recent surge at the open yesterday. Interested in seeing if it breaks the highs ($166). Obviously CRWV has a huge debt load due to their GPUs/training chips, but whether this will actually affect the stock price remains to be seen. \n\nhttps://preview.redd.it/n11crf4ro36f1.png?width=1026&format=png&auto=webp&s=fb5dec9f2c763ddaa401ef38814be17ea273547e\n\n[**TSLA**](https://finviz.com/quote.ashx?t=TSLA&p=d)\\-Musk/Trump tensions have cooled down and Trump publicly stated that they will keep their White House Starlink. This happened about 30 mins before the close and caused TSLA to shoot up a little, and ASTS/RKLB to sell off. TSLA was extremely interesting the day of the feud, but currently I'm minorly long.\n\nhttps://preview.redd.it/gqtk8drvo36f1.png?width=1022&format=png&auto=webp&s=75c92556999b9f672b24cabd6f278d3eb93e118f\n\n[**ASTS**](https://finviz.com/quote.ashx?t=ASTS&p=d)**/**[**RKLB**](https://finviz.com/quote.ashx?t=RKLB&p=d)\\-Part of the broader spaceflight stock rally that began earlier this week, mainly due to Jeff Bezos implying a partnership through a picture with ASTS. Has been on a tear for the past 3 days, might have topped out yesterday. Wasn't this watching this too closely because I was trading CRCL but still interested to see if this makes a higher leg up. Yesterday was the most interesting day for this and RKLB, but if this breaks highs again today then I'll be interested.\n\nhttps://preview.redd.it/km40nitwo36f1.png?width=1020&format=png&auto=webp&s=b9941ebfb93e3c8b1007372551443f1965b9257b\n\n[**CRCL**](https://finviz.com/quote.ashx?t=CRCL&p=d)\\-Strong run post-IPO has made this the most interesting stock this week outside of TSLA. Very likely we topped out yesterday but watching for additional momentum. Keep in mind that this is mainly \"C\" money + the hype of a recent C stock and IPO success of CRWV that has propelled this higher (it is a solid business model as well)\\_. I think the momentum in this has deflated (we surged briefly off the open and then sold off for most of the day).\n\nhttps://preview.redd.it/1l4jqs4yo36f1.png?width=1538&format=png&auto=webp&s=fbbae0e17720148482824c2f2c05dbf0d4344343\n\n[**AAPL**](https://finviz.com/quote.ashx?t=AAPL&p=d)\\-Intraday selloff yesterday came as excitement over the “Liquid Glass Design” underwhelmed, revealing more of a UI update than hardware innovation. WWDC tends to be a \"sell-the-news\" event. \n\nhttps://preview.redd.it/2lcc7p20p36f1.png?width=1540&format=png&auto=webp&s=64bebefa8303d5d1185eae99a6b7e94b995e98ba\n\n**Earnings:** [**GME**](https://finviz.com/quote.ashx?t=GME&p=d), [**GTLB**](https://finviz.com/quote.ashx?t=GTLB&p=d)",
        "score": 3,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l7ylkp/0610_ipo_movers_and_rockets_interesting_stocks/",
        "created_utc": 1749561724.0
    },
    {
        "subreddit": "StockMarket",
        "title": "Daily General Discussion and Advice Thread - June 10, 2025",
        "text": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "score": 3,
        "url": "https://www.reddit.com/r/StockMarket/comments/1l7txot/daily_general_discussion_and_advice_thread_june/",
        "created_utc": 1749546074.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Daily Discussion Thread - June 19, 2025",
        "text": "[Read The Wiki!!](https://www.reddit.com/r/IndianStreetBets/wiki/index). There is an invaluable amount of information in the Wiki that is consistently being worked on and added to. The answer to a lot of your questions may be in there.\n\nPlease use this thread to discuss whatever you have been thinking of buying or trading.\n\nAlso, use this thread to discuss any query related to Stock Market & Trading.\n\n[Join the Discord](https://discord.gg/8MrqS6CASz) if you haven't already! Here you can talk to mods and fellow autists about the market. Also, don't forget to follow us on [Twitter](https://twitter.com/ISB_Reddit) & [Instagram](https://www.instagram.com/indianstreetbets/)\n\nLink to ISB's [Discord VC recordings](https://www.youtube.com/watch?v=ViRwd90ASOM&list=UUTOPdSUjqfKTaUXRj3MYnsQ&index=2)",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lewl4h/daily_discussion_thread_june_19_2025/",
        "created_utc": 1750291237.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "SEBI Goes Beast Mode — Biggest Market Scam Raid in History!",
        "text": "SEBI just went full detective mode and raided offices in Mumbai, Ahmedabad, and Gurugram to bust a massive ₹300 crore stock manipulation racket.\n\n  \nSo apparently some chindi promoters thought they were Jordan Belfort and ran a ₹300 crore pump & dump scheme using shell companies. They pumped junk stocks from ₹1 to ₹40 with **zero business**. Retail folks got FOMO, bought in, and boom... it crashed to ₹2. \n\nClassic rug pull.\n\nSEBI’s looking at some Telegram “experts” who hyped these stocks like crypto influencers.\n\nRubber stamps, fake docs, prop accounts... A big Scam !!\n\nSEBI came in like Singham and now the house of cards is falling apart. Feel bad for the retail folks who got caught in the hype. Let's just hope some real accountability follows.\n\n",
        "score": 499,
        "url": "https://i.redd.it/2gczpbrca08f1.png",
        "created_utc": 1750392408.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "$6.5 Trillion Worth of Options Expiring This Friday",
        "text": "\nTonight in US, $6.5 trillion worth of stock and options are expiring.\n\nIt’s called triple witching happens 4 times a year.\nLast hour of US market gets super volatile.\n\nNifty already up 300 points.\n\nIf US moves big tonight, India can also go crazy on Monday. \n\nBe ready for some wild moves. 📈📉\n",
        "score": 196,
        "url": "https://i.redd.it/idicgaloo18f1.jpeg",
        "created_utc": 1750409014.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "INDIANS LOVE GOLD, NOT STOCKS?",
        "text": "Just saw this insane chart — 55% of Americans are in the stock market.\n\nIndians? Only 6 % a single digit. \n\nIts still says \"I’d rather lock my money in an FD, throw it at a cricket bet, or buy a lottery ticket from the kirana store… but stock market? Arey bhai, that’s risky!\"\n\n  \nMeanwhile in the \n\n* US Baby's first investment = “S&P 500” \n* India =\" Bet 365 1:2 bhaav chal raha hein\"\n\nWe have 84 million investors, yet we still only account for 6% of our population.  \nOne Big Bull said it best: *“Paisa banega, par sabko patience nahi hai.”*\n\n Investing in good stocks is like cinema — high risk, wild emotions, and an ending worth the wait.",
        "score": 80,
        "url": "https://i.redd.it/51lq8oa5t08f1.png",
        "created_utc": 1750399213.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Markets had no reason to rise today ? War is augmenting even more, apparently North Korea is joining all my shorts flopped",
        "text": "",
        "score": 16,
        "url": "https://i.redd.it/u3e9gfwq228f1.jpeg",
        "created_utc": 1750413743.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Pump and Dump pro Max",
        "text": "The people pumping the dumping NIFTY need to be more subtle LMAO, pumped it half an hour before close and dumped it 2 minutes before closing. Literally 2 minutes before close it drops 50-60 points for god sake.",
        "score": 16,
        "url": "https://i.redd.it/gnlk21ua328f1.png",
        "created_utc": 1750413929.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Mutual funds investments are 1/3rd of Bank Deposits now !!!",
        "text": "https://preview.redd.it/7cxgawmfc08f1.jpg?width=712&format=pjpg&auto=webp&s=f7ac37960674610e5908bdeaaf0c00497b597e12\n\nFrom 16% in 2020 to 31% in 2025, This represents a radical change in the approach Indians are saving their money. 1/3rd of the funds are in Mutual funds and not to forget we have massive investments going on in Equity as well. \n\n  \nWhat if there's a major crash? Things can get pretty ugly. Is there a bubble forming in markets? Maybe time will tell. But one thing is clear, Banks wont get cheap deposits that easily from now and that will mostly change the way banks function going forward. Interesting times!",
        "score": 19,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lfutz6/mutual_funds_investments_are_13rd_of_bank/",
        "created_utc": 1750392977.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Added this trade today. Nifty 03 Jul, 25000 straddle. Thoughts?",
        "text": "Seeing the price action at around 2PM, I felt this was a good idea. But looking at it at 3:30PM, I am kinda nervous.\n\nGood thing is if Nifty hits 25400 on monday, I will be able to exit with a minimal loss of around 2000 rs.\n\nWhat do you people think? Will market continue the up trend or consolidate around 25000 next week?",
        "score": 3,
        "url": "https://i.redd.it/qtxnddq7v28f1.jpeg",
        "created_utc": 1750423319.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "U.S. Options Market is just on a whole new level",
        "text": "That is $6.5 trillion ≈ ₹53,95,000 crore (INR Fifty three lakh ninety five thousand crore).        \n\nU.S. Options Market is just on a whole new level\n",
        "score": 8,
        "url": "https://i.redd.it/i5rdyyq1518f1.jpeg",
        "created_utc": 1750402411.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Futures and Options is money donation to big sharks from retailers - stay away",
        "text": "\nZeroadha started it others simply exploited it. While they made equity investing and MF investment easier and democratised the wealth creation.\n\nWinners:\n1. NSE :became the biggest exchange in F&O volume in world \nBSE also launched derivatives to “Behari Ganga mein haath dhona”\n\nhttps://www.business-standard.com/amp/markets/capital-market-news/nse-declared-world-s-largest-derivatives-exchange-for-5th-straight-year-124011800714_1.html\n\n2. Brokers - Nitin Kamath, Groww Founders and other discount brokers became unicorns 🦄 and billionaires \n\nhttps://www.businesstoday.in/markets/top-story/story/zerodha-annual-results-nithin-kamath-says-40-yearly-jump-in-revenues-in-fy23-shares-13-year-growth-chart-399774-2023-09-26\n\n3. Operators like Jane Street who have made approx $2 billion in 3 years \n\nhttps://www.ft.com/content/d1daf777-d10c-44d8-b570-462f6c4122eb\n\n\nLosers \n\nRs. 2 lakh crore transferred from retail to professional participants in last five years. \n\nhttps://www.thehindubusinessline.com/portfolio/big-story/fo-trading-and-the-great-indian-slaughterhouse/article68690731.ece\n\nWhat has started as boredom busting activity in Covid lockdown has became national gambling 🎰 addiction.\n\n\n\n\n",
        "score": 139,
        "url": "https://i.redd.it/vxdo9vastv7f1.jpeg",
        "created_utc": 1750338089.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Boring portfolios worked this year despite trade wars and real wars",
        "text": "To say that this year has been \"crazy\" is like saying yes, farts stink. Duh! But despite the insane drama and the stupidity of one powerful individual, markets have more or less brushed everything off. They've resumed their steady upward journey.\n\nI just wanted to quickly see how some of the most boring and simple portfolio performed despite all the pronouncements about doom, gloom, impending WW3,4,5 and remakes of all of them. What I did is I tool Nifty 100, Nifty Midcap 150, Gold (GOLDCASE ETF as a proxy), and Nifty 4-8 year G-Sec Index and ran a bunch of combinations. I used an admittedly dumb benchmark of 50% Nifty 100 and 50% Nifty Midcap 150. \n\nThe summary:\n\n* **Gold dominance**: The precious metal's +27.66% surge was the primary driver of portfolio outperformance\n* **Diversification premium**: All mixed-asset portfolios beat the pure equity benchmark\n* **Bond stability**: G-Sec provided steady +5.91% returns, reducing overall portfolio volatility\n* **Mid-cap weakness**: Slight negative return in mid-caps was offset by other asset classes in diversified portfolios\n* Even if you had a dumb equal-weight portfolio where you allocated equally to equity, gold and debt, you would've come out looking like a hero.\n* There was no need to do any fancy nonsense\n\n# Index Returns (2025 YTD)\n\n*Period: January 1, 2025 to June 20, 2025*\n\n|Index|Description|Asset Class|Return (%)|\n|:-|:-|:-|:-|\n|Gold (GOLDCASE)|Gold price index tracking precious metal|Commodity|\\+27.66%|\n|Nifty G-Sec 4-8Y|Government bonds with 4-8 year maturity|Fixed Income|\\+5.91%|\n|Nifty 100|Top 100 companies by market capitalization|Large Cap Equity|\\+3.92%|\n|Nifty Midcap 150|Mid-cap companies|Mid Cap Equity|\\-0.06%|\n\n# Portfolio Returns (2025 YTD)\n\n|Portfolio Strategy|Allocation Breakdown|Return (%)|\n|:-|:-|:-|\n|**Equal Weight**|25% Nifty 100 + 25% Midcap + 25% Gold + 25% G-Sec|\\+9.36%|\n|**Diversified**|30% Nifty 100 + 30% Midcap + 20% Gold + 20% G-Sec|\\+7.87%|\n|**Conservative**|25% Nifty 100 + 25% Midcap + 0% Gold + 50% G-Sec|\\+3.92%|\n|**Benchmark**|50% Nifty 100 + 50% Midcap + 0% Gold + 0% G-Sec|\\+1.93%|\n\n# \n\nCharts\n\nhttps://preview.redd.it/fv0vvj7m918f1.png?width=1203&format=png&auto=webp&s=815622f748b0ee5db3a11e52b593d1942ef459e1\n\nhttps://preview.redd.it/t6kestrn918f1.png?width=1206&format=png&auto=webp&s=11ab4a6bbd65d59b9ee0aa014f648ccd31b9c9cb\n\nhttps://preview.redd.it/42kjb3ap918f1.png?width=1213&format=png&auto=webp&s=797d5c831e8c60db6a863df93a255e87d30fad25\n\n[https://open.substack.com/pub/vishalstakes/p/boring-portfolios-worked](https://open.substack.com/pub/vishalstakes/p/boring-portfolios-worked)",
        "score": 4,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lfxxcv/boring_portfolios_worked_this_year_despite_trade/",
        "created_utc": 1750404625.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "X is entering broking? Lol okay.",
        "text": "\nSo now X (Twitter) wants to become a trading app too. Like you’ll scroll memes and then buy stocks in the same app 😂\n\nThey’re trying to become an “everything app” but remember what happened to Paytm, Tata Neu, Jio apps? All wanted to be super apps. All became super slow, super confusing, and nobody uses them properly now.\n\nBroking is serious stuff. People won’t trust their money to a tweet app. Just because you can add a button doesn’t mean you understand risk, execution, or regulations.\n\nSuper apps sound cool in theory. In reality, they just turn into a mess.",
        "score": 73,
        "url": "https://i.redd.it/mzb3e7vesv7f1.jpeg",
        "created_utc": 1750337628.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "It’s Raining Deals, But no Signs of Market Euphoria in India",
        "text": "",
        "score": 5,
        "url": "https://www.bloomberg.com/news/articles/2025-06-20/india-market-buzz-deals-frenzy-fails-to-spark-investor-euphoria",
        "created_utc": 1750388712.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Shell Companies literally Pumped Debt Ridden RIL stocks 5 years back, and Ambabi had increased Stake just before FB/Goog investments.  SEBI has remained silent when it comes to big fishes",
        "text": "Please just search for yourself \n\n\nRIL stocks hits UC due to meta investments \n\nAnd Then track the increase of shell companies which held RIL in the last quarter.\n\n\nAnd Then Check Check the pledged holdings of Ambani.\n\n\n\n\n\nYour NIFTY50 Index Fund is literally being used to pay off debt of Ambani by keeping the stock afloat the escalated level.\n\n\n",
        "score": 3,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lfy2dt/shell_companies_literally_pumped_debt_ridden_ril/",
        "created_utc": 1750405139.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Operation Sindoor: Is Pakistan the New Wild Card in the US-China Power Game?",
        "text": "This development could shake up investor sentiment across global and Indian stock markets. If there's more uncertainty in South Asia, especially involving nuclear powers like India, China, and Pakistan, it may lead to:\n\n* A rise in [defence stocks](https://web.stockedge.com/industry/defence/129), as countries may boost military spending\n* Pressure on FII flows, as global investors may turn cautious\n* Volatility in oil and commodity prices, impacting sectors like airlines, paints, and logistics\n* A short-term hit to emerging market indices, including India\n\nGeopolitical tensions often trigger a \"risk-off\" mood, where investors move to safer assets. So, this Pakistan twist could bring both opportunity and risk depending on how the situation unfolds.",
        "score": 0,
        "url": "https://i.redd.it/ywrsvbk7428f1.jpeg",
        "created_utc": 1750414421.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Added HSCL & VBL to my mom’s portfolio, both look super solid right now",
        "text": "Been managing my mom’s stock portfolio for a while now, and recently added these two and I feel pretty good about: Himadri Speciality Chemical (HSCL) and Varun Beverages (VBL). She's okay holding them for 3-5 years.",
        "score": 2,
        "url": "https://i.redd.it/v2nysc8mp08f1.png",
        "created_utc": 1750397221.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Started paper trading to test my strategy I'm currently working on",
        "text": "Thinking of replicating it with real money. Tested it with the Nifty 50 options, stock options and also for intraday setup. It's working like a charm till now, hoping  it goes well with real trade as well.",
        "score": 36,
        "url": "https://www.reddit.com/gallery/1lf8p5h",
        "created_utc": 1750333426.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "What just happened?",
        "text": "Hi, can anyone help with this. Why the sudden price drop in Indian markets? I checked Brent, WTI, and even USDINR, everything's up. Can anyone please explain.",
        "score": 7,
        "url": "https://i.redd.it/tz8q0d1crx7f1.png",
        "created_utc": 1750361478.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Groww charges confusion",
        "text": "  \nI just realized something shocking today after speaking to Groww customer care.\n\nThe app does not include brokerage, interest, and other charges in the shown profit/loss (P&L). I was tracking my returns thinking I had smaller losses—only to find out today that I was completely wrong.\n\nYou have to manually subtract these charges to get the real picture. This applies across all trades—delivery, intraday, F&O, and MTF.\nI was thinking my total loss was around ₹81,000. But add ₹27,000 in charges, and my real loss is nearly ₹1 lakh something \n\nHonestly, this lack of transparency is disappointing. For a retail investor already trying to survive in the market, showing misleading P&L only adds to the damage. We deserve better clarity.",
        "score": 22,
        "url": "https://i.redd.it/phsbhd7iyu7f1.jpeg",
        "created_utc": 1750327570.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Thanks groww for no SL option in MTF",
        "text": "Held an MTF position at REC that had consolidated for months. I was once in ₹13,000 profit but didn’t book, hoping to recover earlier losses. The stock just  looked stable, then suddenly crashed.\n\nGroww gave no option to place a stop-loss in MTF trades—basic risk protection was missing.\nToday I had to exit due to a shortfall warning, and now the stock will probably bounce back (as always, after I exit).\n\n\nSame pattern in delivery, F&O, intraday — I exit, it moves in my direction.\n\n\n\nAt this point, just asking:\n👉 Is there any platform that offers stop-loss in MTF?\n👉 Or should I just stop trading MTF completely?\n",
        "score": 19,
        "url": "https://i.redd.it/hcegnp880v7f1.jpeg",
        "created_utc": 1750328149.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "44 lakhs profit in 2 Options trades!",
        "text": "\nMet a part time trader today (works in Tech, trades on the side). He showed me a 44 lakhs profit he made from two options that he bought the day before US Tariffs were announced ! \n\nThis was a complete bet on IV spike and a large downside move on the NIFTY, in reaction to the US Tariff (Liberation Day) announcement. He was clear that this was a Hero / Zero trade, so nothing much to learn from this. Wouldnt recommend anyone take such blind bets, but was happy that it worked out for him. \n\nCost of Options Premium - 4 lakhs\nNet Return - 44 lakhs!!!\n\nI took a photo cause I knew nobody would believe that Options buyers make money 😀",
        "score": 961,
        "url": "https://i.redd.it/yc329zhz8o7f1.jpeg",
        "created_utc": 1750246346.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Is there still room to buy Siemens Energy India stock after 5% pop?",
        "text": "After a strong debut, Siemens Energy India Stock surged to its upper circuit. While Jefferies sees 30% more upside, others like HDFC and Motilal Oswal expect more moderate gains. Opinions are split- could be a breakout or short-term hype.\n\nSource: https://m.economictimes.com/markets/stocks/news/siemens-energy-shares-zoom-5-hit-upper-circuit-post-listing-brokerages-project-30-upside/articleshow/121947014.cms",
        "score": 7,
        "url": "https://i.redd.it/sefat8ji1v7f1.jpeg",
        "created_utc": 1750328580.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "From Lakhs to Crores: How SIPs Quietly Created a ₹2.89 Lakh Cr Revolution!!",
        "text": "[Systematic Investment Plan](https://www.elearnmarkets.com/school/units/guide-to-mutual-funds#facilities-and-services-investors) have quietly become the backbone of long-term investing in India. With more people choosing discipline over timing, the steady rise in contributions shows a clear shift, investors are thinking long term, and it is paying off.",
        "score": 11,
        "url": "https://i.redd.it/515m0b3yhu7f1.jpeg",
        "created_utc": 1750322132.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "India contributes well lighting up the markets 💀☠️",
        "text": "Just came across this chart showing tobacco consumption by population — and while Indonesia leads the pack at 39%, India isn’t far behind at **21.8%**. That’s *one in five* people, and with our population, that’s a huge consumer base. 💭\n\nIf you're betting on habits dying hard, **ITC and Godfrey are the ones holding the lighter** — and maybe the whole bonfire. Will these stocks continue to burn bright?",
        "score": 519,
        "url": "https://i.redd.it/gpzbkz5djm7f1.png",
        "created_utc": 1750226139.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Indian IT Stocks Become Investors’ Top Pick As US Growth Concerns Ease",
        "text": "",
        "score": 10,
        "url": "https://www.bloomberg.com/news/articles/2025-06-19/india-market-buzz-robust-luxury-housing-demand-fires-up-realty",
        "created_utc": 1750301502.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Is it possible to get 30 good ideas in a Year?",
        "text": "I was listening to Pranjal Kamra's Youtube videos , where I came to know about his membership program where he says he would give you 30 ideas per year, like 1 idea per 12 days. If you listen to some of the best investors in the world you would find, most of them would tell you it's good to get 1 or 2 ideas in a single year, how come Pranjal gets idea every 12 days. It seems more of a trick to sell the membership where you want your subscribers to keep renewing your subscription.\n\nPS: Mohnish Pobrai never invested in 30 or 40 stocks at a time, he runs a concentrated portfolio of 10 stocks.\n\nPPS: If you read Warren Buffet's initial letters, you would find he was one of the most concentrated investors. It's just with the amount of money he manages he can't do it now.\n\nBy owning 30 stocks you can beat the market, possible that you won't see a big drawdown but if you want to hit the ball out of the ground the numbers of stocks for a middle class individual investor shouldn't be more than 10 or 12.\n\n",
        "score": 24,
        "url": "https://i.redd.it/egxoo6fuop7f1.png",
        "created_utc": 1750264336.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Why don't most of the brokers offer SLB and why isn't it discussed as often?",
        "text": "Why don't most brokers offer SLB (Securities Lending & Borrowing) and why isn't it discussed much in Indian markets?\n\nI've been wondering about this for a while now. SLB seems like a legitimate way to earn some extra returns on your holdings(especially for long term investors), but it's barely talked about in Indian investing communities and most brokers don't even offer it.\n\nWhat is SLB for those who don't know:\n- You lend your shares to other investors (usually short sellers)\n- You earn a lending fee (interest) on your holdings\n- Your shares are collateralized, so there's relatively low risk\n- You can recall your shares anytime (though there might be a notice period)\n\nWhy it makes sense:\n- Extra income on stocks you're holding long-term anyway\n- Especially useful for large-cap stocks that don't move much\n- Can help offset opportunity cost of holding cash-heavy stocks\n\nBut here's what I've noticed:\n1. Limited broker support - Only a few brokers like Zerodha, IIFL, etc. offer SLB. Most popular discount brokers don't even have it as an option.\n\n2. Poor awareness - It's rarely discussed on investing forums, YouTube channels, or even in financial media compared to F&O, mutual funds, etc.\n\n3. Complex regulations - SEBI has specific rules, but the framework seems less streamlined compared to developed markets.\n\n4. Low participation - The SLB market seems quite thin with limited demand for most stocks.\n\nMy questions for the community:\n- Have any of you used SLB? What's been your experience?\n- Why do you think adoption is so low in India?\n- Is it because of regulatory hurdles, lack of demand, or just poor marketing by brokers?\n- For those who've tried it - what kind of returns did you get and was it worth the hassle?\n\nPotential reasons I can think of:\n- Most Indian retail investors are still getting comfortable with basic equity investing\n- Brokers might not find it profitable enough to implement\n- Tax implications might be complex (anyone know how SLB income is taxed?)\n\nWould love to hear thoughts from people who've actually used SLB or have insights into why it's not more popular in Indian markets. Is this something that might grow in the future as markets mature?",
        "score": 11,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lem31q/why_dont_most_of_the_brokers_offer_slb_and_why/",
        "created_utc": 1750265320.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "NDR Auto Components – FY26 Strategic Gameplan at a Glance",
        "text": "[NDR](https://web.stockedge.com/share/ndr-auto-components/94648) is focused on achieving a ₹3,000 Cr topline by FY30. With strong OEM partnerships, JV synergies, a healthy order book, and product diversification into ambient lighting, artificial leather, and EV components NDR is positioned for scalable growth.",
        "score": 0,
        "url": "https://i.redd.it/u1gr01f1ft7f1.jpeg",
        "created_utc": 1750309109.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "How come next week's Nifty call and put options both are negative?",
        "text": "New to trading. As per logic, if call options are gaining, put options should lose, and vice versa, right? ",
        "score": 0,
        "url": "https://i.redd.it/hxei6vj8tu7f1.png",
        "created_utc": 1750326024.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "A Safe Investment Strategy That Generates Good Returns Annually According To Me",
        "text": "Hey everyone,\n\nI just wanted to share a strategy I've been using, haven’t seen it discussed much here. It's a relatively low-risk and good returns approach that combines ETF investing with margin-based trading. Some of you might already be familiar with this strategy, but if not, it could be helpful for anyone looking to generate consistent returns without being tied to the screen all day.\n\n**Disclaimer:** This is purely based on my personal experience and what’s worked for me — not financial advice or a recommendation. Please evaluate based on your own risk profile and goals.\n\n# 📌 Step 1: Build a Diversified ETF Portfolio\n\nStart by investing in ETFs/BEES. I’ve diversified into:\n\n* **JUNIORBEES**\n* **GOLDBEES**\n* **CPSEETF**\n* **Kotak PSU ETF**\n* **MIRAE FANG ETF**\n\nThis gives me exposure to Gold/Silver, PSU stocks, Nifty, and even US tech via FANG ETFs. You can choose based on your risk appetite. There are other ETFs as well, which are more safer if you're conservative.\n\n# 📌 Step 2: Pledge ETFs to Get Margin\n\nOnce you've built your ETF portfolio, **pledge them** with your broker. Many brokers now give **100% margin** on pledged ETFs — which can be used for intraday stock trading or options.\n\n💡 *Bonus Ti*p: You can also transfer mutual funds to your broker and pledge them.\n\n# 📌 Step 3: Deploy Algo Strategies\n\nUse platforms like **Tradetron, Algotest, or Quantman** to automate your trades. I strongly recommend sticking to **options selling strategies** only — they tend to have better risk/reward and lower drawdowns.\n\n* Many such algos generate **2–5%** per month with max DD of 5-6%\n* No need to sit in front of the screen. Let it do its work.\n\n💡 *Bonus Ti*p: You can trade on **MCX after 3:30** PM using the same margin. I personally trade **Crude O**il — it’s more predictable and adds 1–2% extra per month.\n\n# 📊 Expected Returns\n\n* **ETF appreciation**: \\~10-15% per year\n* **Options trading**: \\~24–50%\n* **MCX trading**: \\~12–24%\n\nSo overall returns will easily be around 60%. I've been doing this for a few months and my returns have actually beaten these numbers. And the best part — it’s **mostly passive**. You don’t have to sit in front of the screen all day.\n\n# 🧾 Broker Checklist (Very Important)\n\nChoose a broker that offers:\n\n* Zero or fixed monthly brokerage\n* 100% margin on pledged ETFs for NFO + MCX\n* Low option selling margin\n* Fast and stable APIs\n* Option to pledge mutual funds (optional)\n\n❌ Avoid brokers like Zerodha, Upstox, Groww, etc. — they charge high (₹20/order) with limited benefits.\n\n# 🙋‍♂️ What's in it for me?\n\nHonestly, nothing much. Just wanted to share what’s working for me.\n\nBut if you find this useful and want to support, you can open a demat account via my referral — I’ll suggest brokers that meet all the above criteria. Totally optional. I’ll still help(if you need help) with ETF selection or strategy advice whether you use my link or not.\n\nDrop a comment or DM me if you have any queries or need any help regarding this.\n\n**Note**: The strategy, idea, and experience are all mine, but I used **ChatGPT to help structure and phrase the text** clearly for the post.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lf8m03/a_safe_investment_strategy_that_generates_good/",
        "created_utc": 1750333137.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "How is it so that my portfolio rebounded from -40k to almost neutral, but since then it is taking forever to go up even 1% ??",
        "text": "I mean people do buy the dip buy why doesn't market go up after thr dip is bought?? \n          \nIt has been almost 9 months since markat was at the ATH and almost 6 months since nifty touched around 23k I believe, tbh i really believe that recovering from -40k to net zero is impressive, but shouldn't there be more upside as well ?? \n      \nIs there some investor psychology involved that when Market is red they pour a lot of money but when it gets neutral they are no longer interested?? ",
        "score": 4,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1len7y4/how_is_it_so_that_my_portfolio_rebounded_from_40k/",
        "created_utc": 1750267927.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Should I sell or wait for NSE?",
        "text": "It was Up like 50% more but it’s now going down and Ik that its not coming 850 (unless world war 3 happens and market is down by 30-40% 😂😂😭😭 probability is less but i hope it doesn’t happen)\n\n\nI’ll buy more if it goes low because for long term it’s a good stock but what do you think in short term? Should I book the profit",
        "score": 37,
        "url": "https://i.redd.it/hsni34ki0m7f1.jpeg",
        "created_utc": 1750219283.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "I am right but i still lose money in Options",
        "text": "Hi, So i have started doing options trading this week, and 6 out of 10 times I am right about the direction of the market but i still end up losing money, the potential loss on one candle that doesn’t behave as I expect causes me to accept the loss, and in next few candles the market moves in my direction. Very frustrating. ",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lf2iii/i_am_right_but_i_still_lose_money_in_options/",
        "created_utc": 1750309772.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Stock potential from small cap to large cap in long term only",
        "text": "Need to know for long term prospect any stock which has potential from small to mid cap to large cap eventually into Nifty 50. Any stock  recommend \nWould help in my research, as it says this a golden age for Indian capital market (like the usa of 1950s) \nChina in the late 80s & 90s \nPlease share your thoughts \nWould love to brain storm the conversation",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lesaml/stock_potential_from_small_cap_to_large_cap_in/",
        "created_utc": 1750279984.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Need investment advice as a young adult under 30",
        "text": "**Investment Goals:**\n\n* Monthly Investment Capacity: ₹5,000-10,000 since I am already investing around 25k in diff mutual funds SIP, as follows:\n\nSBI Large and Midcap fund  \nTata Business Cycle fund  \nEdelweiss small cap fund  \nTata Hybrid equity fund\n\nHDFC midcap opportunities fund  \nHSBC small cap fund  \nNippon India large cap fund\n\n* Target Return: 12-15% annually\n* Focus: Long-term wealth building, not short-term gains\n* No dependents currently, but planning for future\n\n**Proposed Portfolio Allocation:**\n\n1. Emergency Fund: Around 2lakhs parked in the Tata hybrid equity fund (want to move this to a safer place, FD/ RD or liquid funds or arbitrage funds. where and how to research this?)\n2. Health Insurance: ₹5L coverage, new India mediclaim policy (changing it to 10L, research done)\n3. Term Insurance: none, maybe will get in 2-3 years\n4. Mutual Funds (SIP): ₹11L across large/mid/small cap mentioned above\n5. Direct Stocks: none, want to start\n6. PPF: 14L\n7. EPFO: 2-3L (16-25k) deducted every month by employer and employee contribution)\n8. Gold: none\n\n**Questions:**\n\n1. What changes are needed in allocation to make sense for my age and goals?\n2. Which one of the funds in my current portfolio are good for long term? Which ones to move out of?\n3. Should I adjust allocation percentages?\n4. How to track and rebalance effectively?\n5. Any major gaps in my strategy?\n6. If I am planning to move out of India (either job or masters) should I still get health and life insurance? How does my investment strategy change considering this?\n7. Is PPF good to keep emergency fund?\n\nThanks in advance for your advice! Genuinely need some advice on the same!",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1les7nr/need_investment_advice_as_a_young_adult_under_30/",
        "created_utc": 1750279786.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Bharat Forge & Turgis Gaillard Sign MoU to Supply AAROK UAVs to Indian Defence",
        "text": "Bharat Forge Ltd. and French company Turgis Gaillard have today signed a memorandum of understanding to offer AAROK UAV in alignment to the Indian Ministry of [Defence](https://web.stockedge.com/industry/defence/129).",
        "score": 13,
        "url": "https://i.redd.it/3nrkmnzoem7f1.jpeg",
        "created_utc": 1750224101.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "SEBI bans Sanjiv Bhasin for fake stock tips",
        "text": "\nSanjiv Bhasin, ex-director of IIFL and famous TV stock guy, just got banned by SEBI.\n\nHe was giving stock tips on TV and social media without proper reasons or disclosures. Basically hyping up stocks to fool people.\n\nSEBI said nope. \n\nBig deal because many retail investors follow these TV guys blindly.\n\nShould more of these stock “experts” be checked?\n",
        "score": 236,
        "url": "https://i.redd.it/2sws06x8hh7f1.jpeg",
        "created_utc": 1750164377.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "India’s Small-Cap Stocks Set to Beat Larger Peers on Improved Earnings",
        "text": "",
        "score": 17,
        "url": "https://www.bloomberg.com/news/articles/2025-06-18/india-market-buzz-improved-earnings-to-drive-smallcap-momentum",
        "created_utc": 1750215486.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "NIFTY/Global Post Market Summary and Analysis | Predictions for 19/6/2025",
        "text": "Chart data is indecisive although 24700 will act as an important short term support.\n\nOptions + Futures data is indecisive although Pro has a clear bullish bias.\n\n\n\nOI suggesting bearishness. Expecting a flat/down move in tomorrow expiry purely based on the above data.\n\n\n\nAlthough Oil price going down; US stock and bonds going up suggests that the positive sentiment is back in the global markets despite the ongoing conflict. Hence, I have CONFLICTED opinion regarding tomorrow's market. Can also see a swift upmove taking out the big short positions up to 25k Nifty level.",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1lel0nk",
        "created_utc": 1750262801.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Dear all, help me to kick-start my investing",
        "text": "I've committed a huge blunder, and now I want to recover my losses because my parents are asking about the investment!\n\nThinking of selling my loss making (-50%) OLA stocks.\n\nKindly please suggest me your favourite picks for investment. I can hold the stocks for 2-3 months. \n\nAny suggestion will be appreciated. \nThank You",
        "score": 2,
        "url": "https://i.redd.it/bnofpfy6bp7f1.jpeg",
        "created_utc": 1750259195.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Trump put tariff on Indian pharma. All stocks falling 😵‍💫",
        "text": "Trump added new taxes (tariffs) on medicines from India. Big pharma companies like Sun Pharma, Dr. Reddy’s, Aurobindo, Alembic all make 30–50% of their money from the U.S.\n\nNow their profits will go down. Stocks are falling badly.  \nEven Biocon, Cipla, Lupin, Zydus – all in trouble.\n\nPharma was safe till now. But this U.S. news has messed everything up.\n\nYou buying the dip or running away?\n\nhttps://preview.redd.it/ou5na2mhfg7f1.png?width=1939&format=png&auto=webp&s=5985b83d44b705ba3661931823b76e738657d6ec\n\n",
        "score": 227,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1ldihfc/trump_put_tariff_on_indian_pharma_all_stocks/",
        "created_utc": 1750151656.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "SEBI bans famous analyst Sanjiv Bhasin for front running scam",
        "text": "  \n  \n**Here is the summary of the Modus Operandi:**   \n  \nSanjiv Bhasin, as Director of IIFL, regularly appeared on business news channels giving stock tips.\n\nhttps://preview.redd.it/v5xtwqlijh7f1.png?width=1600&format=png&auto=webp&s=76920f0f26a818edd019dcd60ad955395c133700\n\nBefore appearing on TV, he secretly bought shares (mostly of Venus, Gemini, and HB) using the help of dealers at RRB Master (Jagat Singh and Rajiv Kapoor).\n\nAfter buying, he recommended the same stocks on TV and social media, causing the stock prices and volumes to jump due to his wide influence.\n\nOnce the prices rose, he immediately sold those shares (again using RRB dealers), making quick profits—going against his own public advice.\n\nThe profits from this scheme went into the accounts of Venus, Gemini, and HB—all connected to him.\n\nLalit Bhasin and Ashish Kapur, also connected to Sanjiv, helped in carrying out these trades.\n\nEven though his tips were framed as long-term advice, he exited his positions within minutes after recommending.\n\nAshish Kapur (MD of RRB Master) and dealers Jagat Singh and Rajiv Kapoor also copied Sanjiv’s trades in their own personal accounts to make profits.\n\nAnother person, Praveen Gupta, used insider info to trade similarly in a different account (Leo).\n\nThe trading accounts (Venus, Gemini, HB) were linked to the same dealers, giving them access to non-public info about Sanjiv’s trades.\n\nUsing this inside knowledge, the dealers made similar trades and profited personally.\n\nSEBI  has ordered the recovery of unlawful gains worth Rs 11.37 crore.  \n  \n",
        "score": 85,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1ldmh6h/sebi_bans_famous_analyst_sanjiv_bhasin_for_front/",
        "created_utc": 1750165159.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Astral Ltd. on the Verge: Is this the breakout signal traders have been waiting for? Share your thoughts!",
        "text": "[Astral Ltd.](https://web.stockedge.com/share/astral/4916?section=prices&exchange-name=nse&time-period=1D) is witnessing a rise in momentum as reflected by a strong RSI and increasing volumes. The chart highlights notable activity, indicating a possible shift in price action worth tracking closely.",
        "score": 0,
        "url": "https://i.redd.it/2zo368bzxn7f1.png",
        "created_utc": 1750242752.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Authum Replaces PNB as the Lead Sponsor of ISARC!",
        "text": "PNB has exited its 20.9% stake in India SME Asset Reconstruction Company (ISARC), selling it for ₹34.05 crore. With this move, [Authum Investment & Infrastructure Ltd.](https://web.stockedge.com/share/authum-investment-infrastructure/15654) officially steps in as the new lead sponsor, following RBI’s nod for a change in ISARC’s ownership structure. Do you think Authum can reshape ISARC’s future in the asset reconstruction space?",
        "score": 2,
        "url": "https://i.redd.it/mj4ktbhxdm7f1.png",
        "created_utc": 1750223906.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "STOP NSE/BSE Expiry Change",
        "text": "Every few months, either NSE, BSE, or SEBI decides to shake up the expiry days for options and futures. Whether it’s moving Bank Nifty, FINNIFTY, or now shifting expiries between exchanges, **the lack of consistency is damaging**.\n\nOne week it’s Thursday, next it’s Tuesday. What’s next? Sunday night moon expiries?\n\nWe as traders and investors rely on **stability and predictability**. Frequent changes hurt retail participation, confuse new entrants, and reduce confidence in the overall system. People build strategies, algos, and businesses around certain expiry patterns—changing them every 3 to 6 months throws everything off.\n\nThis isn’t innovation; it’s disruption for the sake of headlines and competition. There should be **strong consultation with the public and the trading community before such decisions are made**, and there must be a **cooling-off period or limit to how frequently such changes can be made (min 2 yrs)**.\n\nLet’s not sit back this time. Reach out to SEBI and help stop this nuance. Will share the email body if I see there are many others like me who express same concerns as mine.",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1le94n5/stop_nsebse_expiry_change/",
        "created_utc": 1750224485.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "IEL LTD(Indiabulls Enterprises LTD)",
        "text": "Bought 3000 shares @13.80. Currently trading at 25.40. What shall I do? Opinions required. Looks like the stock has broken out of its resistance levels but the financials don't look that great.",
        "score": 0,
        "url": "https://i.redd.it/kdzzu36jcm7f1.jpeg",
        "created_utc": 1750223323.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "What to do",
        "text": "Hi I wanted to ask what are your views on markets today, what do you think will nifty and sensex rise or fall in upcoming trading days, do provide your views as I'm going to either buy a call or a put today.",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1le7qbe/what_to_do/",
        "created_utc": 1750219548.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "How dare do these managers use your sip money for R power CEOs . More than 30 million stocks of R power purchased",
        "text": "[https://www.rupeevest.com/Mutual-Fund-Holdings/200039](https://www.rupeevest.com/Mutual-Fund-Holdings/200039)\n\n  \nThe stock is hitting LC after LC and it was purchased using your SIP in last month.  More than 30 million stocks were purchased ",
        "score": 27,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1ldhhng/how_dare_do_these_managers_use_your_sip_money_for/",
        "created_utc": 1750147548.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Can someone explain me why my zerodha benchmark is showing like this?",
        "text": "I was looking at the console for zerodha benchmark index and I noticed this. I am not able to understand why\n\nhttps://preview.redd.it/meqo5ikqbl7f1.png?width=2252&format=png&auto=webp&s=1fed13fac4117b997d7b6d371af3e2dbe4813082\n\nI check my portflio often and yes there are some stocks which have fallen but I have mostly made great profits in many of the etfs and stocks which I had purchased. Also I invest regularly and almost always have 10 percent gain even when I bulk invest",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1le50uo/can_someone_explain_me_why_my_zerodha_benchmark/",
        "created_utc": 1750211062.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Swing trading on Adani Wilmer",
        "text": "Hello Everyone, I am planning to start swing trading to earn some money. My investment amount is 50k. \nFor that identified the AWL which is at reversal point, which has edible oils and grocery items under the brand of fortune.\n\nIt has High price of 750 and current levels is around 262.\nIs it a good pick ? Or is there any issues with this stock?\nI need some suggestions for swing trading.",
        "score": 0,
        "url": "https://i.redd.it/z91p6vfrml7f1.jpeg",
        "created_utc": 1750214658.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "AN FX / FOREIGN TRADER VIEW/ REACTION ON INDIAN MARKETS 😂",
        "text": "LOL BRO WAS TRAUMATISED BY SEEING MARKETS GAPS",
        "score": 0,
        "url": "https://v.redd.it/ygrg0v99gj7f1",
        "created_utc": 1750188553.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Nifty : Main nahi jhukega",
        "text": "",
        "score": 403,
        "url": "https://i.redd.it/7qeag027s97f1.jpeg",
        "created_utc": 1750071204.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Ab dar lag raha hai. Please help",
        "text": "Hi everyone, I’m currently holding a few stocks and wanted to get your suggestions. Can you please take a look at my portfolio and share your thoughts? I’d really appreciate it if you could tell me which ones look good to hold and if there are any I should think about removing. bachlo mere portfolio ko.",
        "score": 20,
        "url": "https://i.redd.it/dsmhgfzhce7f1.png",
        "created_utc": 1750126460.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "World Stock Maket Cap Ratio hits the 2nd Highest Ever !!",
        "text": "The global stock market cap to global GDP has hit **117%**, the second-highest level **ever**, even higher than the Dot-Com bubble peak in 2000.\n\nThat’s basically the Buffett Indicator flashing red. Now I understand why Michel Burry might be short on tech stocks. Are we in another asset bubble? Or is this just how the “new normal” looks with AI & tech everything?",
        "score": 282,
        "url": "https://i.redd.it/b798wpkth97f1.png",
        "created_utc": 1750067755.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "What is going on with this Stock?",
        "text": "https://preview.redd.it/htswvjfdyf7f1.png?width=1249&format=png&auto=webp&s=c4d739359f2a606b30b770044e3c2d53c672e532\n\nI have been following this stock for a while now, it has a good business and has been delivering good results also, what had gone wrong with them recently? Has there been any changes in the management or something else? I cant seem to understand, please help me",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1ldh4lj/what_is_going_on_with_this_stock/",
        "created_utc": 1750146015.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Mon100 INAV is higher than the trading price",
        "text": "Motilal Oswal Nasdaq 100 is trading less than the INAV of last closing day. The question is are we expecting rupee to strengthen and US markets go down, both or either one of it. Mostly it trades at a premium to the INAV. This is a very rare scenario .   Share your thoughts on this.   ",
        "score": 8,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lde779/mon100_inav_is_higher_than_the_trading_price/",
        "created_utc": 1750134825.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "Axiscades & Indra: Is This the Next Big Defense Play?",
        "text": "Axiscades shares jumped 5% after it signed a strategic alliance with European defense major Indra. The deal aligns with the Make in India defence push. The companies may also collaborate on MPA Airborne Solutions, signaling more high-tech defense projects ahead.  \nThough investors are bullish, do you think this move strengthens India’s [defence sector](https://web.stockedge.com/industry/defence/129)?",
        "score": 5,
        "url": "https://i.redd.it/3nz11w6wye7f1.png",
        "created_utc": 1750133999.0
    },
    {
        "subreddit": "IndianStreetBets",
        "title": "SBI cut its savings a/c rate cut to 2.5%, Lowest in history; Will stock market see more inflows?",
        "text": "[Source: Neil Borate](https://preview.redd.it/mgzv4ulrd97f1.jpg?width=943&format=pjpg&auto=webp&s=a2735238fc45c37a64558dd86e89157f2dc3db4e)\n\nBanks are always ready to cut rates but wont cut lending rates that quickly lol\n\nOn a serious note, whats the point of putting money in banks now other than monthly expenses. If returns are 2-4%, not even covering 50% of inllation.\n\nLooks like more and more flows will come into stock markets now. Khelo India Khelo",
        "score": 100,
        "url": "https://www.reddit.com/r/IndianStreetBets/comments/1lcohht/sbi_cut_its_savings_ac_rate_cut_to_25_lowest_in/",
        "created_utc": 1750066548.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Nifty50 positions on 7th december 2021",
        "text": "This is my opinion and not for anyone to trade just watch these positions and take an expert opinion before you trade.\n\nTomorrow if market opens flat or a little gap down next stop will be 16800 and further down to 16722 as option chain shows strong resistance on calls side better to avoid CE.\n\nThis is solely for educational purposes only",
        "score": 10,
        "url": "https://www.reddit.com/r/Nifty50/comments/raay47/nifty50_positions_on_7th_december_2021/",
        "created_utc": 1638807425.0
    },
    {
        "subreddit": "Nifty50",
        "title": "SIX STOCKS FOR trading on 6 August 2021.",
        "text": "",
        "score": 1,
        "url": "https://youtu.be/HO2AX3z_6uY",
        "created_utc": 1628222544.0
    },
    {
        "subreddit": "Nifty50",
        "title": "NIFTY | BANKNIFTY | RELIANCE | HDFCBANK | BAJAJ FINANCE levels for buy a...",
        "text": "",
        "score": 1,
        "url": "https://youtube.com/watch?v=DzxWI6koJJY&feature=share",
        "created_utc": 1628222430.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Stock Market Opening cues Futures Options Currencies Commodities Global Indices Data, Intraday Stock List with support and Resistance",
        "text": "",
        "score": 1,
        "url": "https://youtube.com/watch?v=LCbsBtwiIfU&feature=share",
        "created_utc": 1620782563.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Stock Market Today Futures and Options May Series Intraday Stocks Glob...",
        "text": "",
        "score": 1,
        "url": "https://youtube.com/watch?v=JABVkND5VdM&feature=share",
        "created_utc": 1619751783.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Stock Market Today Futers and Options Global Data Intraday Trading Calls...",
        "text": "",
        "score": 1,
        "url": "https://youtube.com/watch?v=eNMPMXqEHwI&feature=share",
        "created_utc": 1619578657.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Will Nifty cross 14000 for 29th April expiry?",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/mxfish)",
        "score": 1,
        "url": "https://www.reddit.com/r/Nifty50/comments/mxfish/will_nifty_cross_14000_for_29th_april_expiry/",
        "created_utc": 1619251735.0
    },
    {
        "subreddit": "Nifty50",
        "title": "Can i change sip amount for nifty 50 index fund direct growth",
        "text": "Hi i have recently started sip for index fund. I started with 2500. Can i change this amount for my next sip?",
        "score": 1,
        "url": "https://www.reddit.com/r/Nifty50/comments/g0pcsh/can_i_change_sip_amount_for_nifty_50_index_fund/",
        "created_utc": 1586804598.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Most brokers are quietly screwing us all on delivery trades",
        "text": "Did a comparison across brokers for 10 delivery buys and sells a month, over a year, assuming a trade size of ₹50K.\n\nhttps://preview.redd.it/sae2cfi0d28f1.png?width=769&format=png&auto=webp&s=9108c11fe81377f88bd03b468ca9b3e0c3e14cc6\n\nDhan, Zerodha, and Mstock came out the cheapest. \n\nBut with Groww? You could be paying ₹20,000+ a year for doing nothing different. Insane, right?\n\nYou also pay 18% GST on that brokerage so ₹180 gone for every ₹1000.  \nDP charges? They vary too and yes, GST applies there as well.\n\nThe UI might look slick, but behind the scenes, you’re paying a premium just to buy and sell. \n\nGroww feels less like a discount broker and more like a highly marketed brand with high fees.\n\nRun the numbers once, you might be shocked.",
        "score": 35,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lg16wc/most_brokers_are_quietly_screwing_us_all_on/",
        "created_utc": 1750417405.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Rahul Gandhi’s ₹4 Cr Portfolio. That’s It?",
        "text": "Wtf. Thought it would be filled with shell companies and 100 crore penny stocks. But no, it’s clean, boring, and full of legit names like Titan, Nestle, Divi’s Labs, ICICI Bank.\n\nEven has Vertoz for 2,530, maybe just to feel like a retail investor. \n\nI mean really, what? This is almost too honest for Indian politics.\n\n",
        "score": 400,
        "url": "https://i.redd.it/d7mo87kzsx7f1.jpeg",
        "created_utc": 1750362034.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Are FIIs Losing Grip on Indian Markets? DIIs Are Now in Control — And That Changes Everything?",
        "text": "Over the past two decades, the Indian equity market has danced to the tune of **Foreign Institutional Investors (FIIs)**. A sudden outflow from FIIs, and the Nifty could crash 2–3% in a session. But things are changing — and fast.  \n  \n**The Balance Has Tipped:** As of **March 2025**, **Domestic Institutional Investors (DIIs)** now hold more of the Indian equity market than FIIs. DIIs (like mutual funds, LIC, EPFO, and insurance firms) collectively own **17.62%**, compared to FIIs' **17.22%** — a historic shift. In the **Nifty 50**, DIIs now control **23.6%**, the highest ever.\n\n**What This Means:** For years, **FIIs were the market movers**. When they bought, markets soared. When they sold, panic followed.\n\nBut now, thanks to:\n\n* Massive SIP flows (\\~₹20,000 Cr/month),\n* Deepening domestic retail participation, and\n* Consistent DII buying (₹44,000 Cr net in June 2025 so far),\n\n...the market has a shock absorber. And we saw it clearly on June 12, 2025. FIIs dumped over ₹3,800 Cr in cash and sold ₹2,300+ Cr in index futures. Yet Nifty corrected only modestly and bounced back the very next day — because DIIs and retail investors absorbed the selloff.\n\nThis isn’t just a blip. It’s a **structural trend**.\n\n# Changing Market Dynamics:\n\n* Volatility may reduce: Big 2–3% swings on FII mood swings might become rare.\n* Gradual rallies over flash rallies: Expect more steady upward moves as DIIs deploy monthly inflows systematically.\n* Local themes will dominate: Infra, domestic consumption, manufacturing, and PSU stories will get more attention than just tech or global plays.\n* Retail + DII = Power combo: With retail growing and DIIs getting stronger, India is slowly becoming self-driven.\n\nThis could mark the start of a new phase where India becomes **less dependent on foreign capital** to sustain its bull market. FIIs will still matter — but they won't dictate the market anymore.\n\nDo you agree that the era of FII-led volatility is behind us? Or do you think FIIs will come back swinging in the next cycle? Share your thoughts?\n\n  \n***P.S.- This is restructured and re-written by ChatGPT based on my past research and experience.*** ",
        "score": 26,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfz2f6/are_fiis_losing_grip_on_indian_markets_diis_are/",
        "created_utc": 1750409217.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Finally Created Algo",
        "text": "Hello Traders,\nI have been trading for 4yrs but as many not so much success.\nI have my strategies but my emotions never let them play out that’s when I decided to create algo and was working on it for 2yrs.\n\nSo now I have completed one of my bots for stocks and still working on options one that I might also complete by the end of this year.\n\nI backtested it with 5years of data for small cap 150 stocks, where max Drawdown = 22% and WR = 57-62%\n\nFor a while now I have been forward testing it with small capital and I find it working perfectly.\nI do not have to look chart anymore as I have pushed it to cloud and it keeps pushing me messages about bots activity.\n\nMajor function:\nI have set it in such a way that it automatically gets the position sizing for the day for each stock(doesn’t matter how many of them) according to my risk percentage set for the day.\nSo I know my max loss for the day\n\nThis is the only thing that I understood in 4yrs that is very important other than market and its strategies that people enter market with hope of profit only but never cap their losses.\n\nPLEASE CAP YOUR LOSSES\n\nAlgo is your way if emotions are your obstacle. Learn it and Create it. Nothing is too late.\nI hope those who didn’t make it yet did find some value in my post.",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lg0vqs/finally_created_algo/",
        "created_utc": 1750416337.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Is it possible to get 30 good ideas in a Year?",
        "text": "I was listening to Pranjal Kamra's Youtube videos , where I came to know about his membership program where he says he would give you 30 ideas per year, like 1 idea per 12 days. If you listen to some of the best investors in the world you would find, most of them would tell you it's good to get 1 or 2 ideas in a single year, how come Pranjal gets idea every 12 days. It seems more of a trick to sell the membership where you want your subscribers to keep renewing your subscription.\n\nPS: Mohnish Pobrai never invested in 30 or 40 stocks at a time, he runs a concentrated portfolio of 10 stocks.\n\nPPS: If you read Warren Buffet's initial letters, you would find he was one of the most concentrated investors. It's just with the amount of money he manages he can't do it now.\n\nBy owning 30 stocks you can beat the market, possible that you won't see a big drawdown but if you want to hit the ball out of the ground the numbers of stocks for a middle class individual investor shouldn't be more than 10 or 12.",
        "score": 66,
        "url": "https://i.redd.it/2ebvdok45w7f1.png",
        "created_utc": 1750341936.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "WhatsApp Group",
        "text": "WhatsApp Group for Discussion \n\nWe’ve created a WhatsApp group for genuine stock market discussions — covering everything from macroeconomic trends, company fundamentals, personal finance, investing psychology, and more.\n\n👉 Important Notes:\n\t•\t🚫 No spamming, unsolicited DMs, or promotions.\n\t•\t❌ Strictly no buy/sell tips or stock recommendations — we fully respect SEBI guidelines.\n\n• Market related talks will last from 9:15 am to 3:30 pm and non market hours any topics can be discussed freely.\n\n•\t✅ The group is for educational and discussion purposes only.\n•\t💬 Open to beginners and experienced investors alike.\n\nhttps://chat.whatsapp.com/Fl6qzPt1DsY59VeKcbLQrK",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lg2yox/whatsapp_group/",
        "created_utc": 1750423169.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "India’s AI Investing Opportunity: 15 Listed Stocks Powering the Full-Stack AI Ecosystem Across 7 Categories.",
        "text": "The global AI conversation today is dominated by ChatGPT, Gemini, and Claude. But here’s the thing — India isn’t building the next foundational AI model (yet), and that’s okay.\n\nBecause quietly, behind the scenes, we’re enabling the infrastructure, consulting, devices, and automation layers that AI depends on — and that’s where the real opportunity for Indian investors might lie.\n\nOver the last few weeks, I’ve been researching India’s listed companies to see how they map to the global AI value chain. Here’s a summary of the categories and some of the companies operating in each:\n\n**1. Foundational Models (Early-Stage)**  \nIndia doesn’t yet have a scaled LLM player like OpenAI or Anthropic. But there is one early move:\n\n* **Sarvam AI** is backed by the IndiaAI Mission to build an indigenous LLM. This is still pre-listing and very early stage.\n\n**2. Infrastructure Hardware**  \nIndia is making solid progress in the hardware and physical infrastructure needed for AI.\n\n* **Sterlite Technologies**, **Tejas Networks** – Optical fiber and broadband networking\n* **Dixon Technologies**, **Syrma SGS** – EMS, PCBs, and edge AI hardware\n* **ABB India**, **Cummins India** – Power, cooling, and backup infra for data centers\n* **L&T**, **Techno Electric**, **NetWeb**, **E2E** – Data center parks, HPC servers, green power systems\n\nThis layer is crucial as global AI compute needs scale up.\n\n**3. Infrastructure Software**  \nThis is the middleware, tooling, and deployment layer of the AI stack.  \nIndian IT services firms are embedding AI into legacy software systems:\n\n* **TCS**, **Infosys**, **Wipro**, **HCLTech** – ERP, CRM, BFSI use cases\n* **Happiest Minds**, **Zensar Tech**, **Kellton Tech**, **3i Infotech** – Cloud-AI integration, private LLMs, RPA\n\nThink of this layer as the operating layer for real-world AI deployment in enterprises.\n\n**4. Vertical AI Platforms**  \nThese are domain-specific tools with high IP and deep expertise.\n\n* **KPIT Technologies** – Autonomous vehicle stack for global OEMs\n* **Oracle Financial Services Software (OFSS)** – AI for fraud detection and credit risk\n* **Intellect Design Arena** – AI-powered banking infrastructure and wealth tech tools\n\nMost of these serve high-regulation industries like banking and auto, where switching costs are high.\n\n**5. Horizontal AI Tools**  \nThese are general-purpose AI tools used across industries.\n\n* **Freshworks** – CRM automation via its Freddy AI platform\n* **Quick Heal** – AI-driven malware and security for consumers and businesses\n\nThese are early bets, but ride on the SaaS and automation wave.\n\n**6. AI Services and Consulting**  \nThis is India’s strongest layer. These companies help global firms deploy LLMs, automate workflows, and implement AI platforms.\n\n* **TCS**, **Wipro**, **HCL**, **Infosys**\n* **Zensar**, **Kellton**, **Happiest Minds**, **3i Infotech**\n\nMost of them also work closely with AWS Bedrock, Azure AI, GCP, and Hugging Face integrations.\n\n**7. AI-enabled Devices & Robotics**  \nThese firms build the physical layer where AI meets real-world use cases.\n\n* **Tata Elxsi** – ADAS, medical AI devices, embedded systems\n* **Bharat Electronics** – Defense-focused AI and surveillance systems\n* **ABB India**, **Syrma SGS**, **Dixon** – Power automation, IoT integration, smart devices\n\nThis layer will only grow as AI exits labs and enters the physical world.\n\nInstead of trying to find the next flashy AI unicorn, I wanted to identify the long-term compounding opportunities in India — the companies enabling AI, layer by layer. From infrastructure to applications.\n\nWould love to know what others are doing here. Too early? Or a good time to quietly build exposure?\n\n\n\n",
        "score": 25,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfjcw3/indias_ai_investing_opportunity_15_listed_stocks/",
        "created_utc": 1750360439.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Views on Indiamart stock",
        "text": "Currently on almost lowest PE levels. Compared to Industry, again very low. Good operating margins. Good Net profit margins. Almost no debt. Seems like a good buy to me. Any views? ",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lg1k8f/views_on_indiamart_stock/",
        "created_utc": 1750418668.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Help needed with a possible dividend stock strategy",
        "text": "So I am 22, recently graduated from college and will start job soon. For context, I already have quite a good chunk of shares thanks to my father’s financial planning and all. And I have been following market for quite a bit too. But what I wanted you folks’ advice is on the perception of dividend stocks. So I know people say that dividend stocks are for the oldies who want a constant income and for us youngsters we should invest in growth stocks which is certainly something I agree with 100%. But hear me out, what if every year I keep on investing a rather insignificant portion to dividend stocks. Why you ask? Because I was just wondering that 20-30 years down the line all of those little investments in such stocks will gradually keep generating me income in an increasing manner. What I mean to say is down the line I wouldn’t have to worry about having to generate income come retirement. I provably sound stupid and naive but I would appreciate your feedback. I am only learning and I want to keep learning. Strong constructive criticism is always appreciated folks!\n\nThank you if you help me out today!",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lg0jga/help_needed_with_a_possible_dividend_stock/",
        "created_utc": 1750415045.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Didn’t receive the ABFRL demerger stocks",
        "text": "I had some ABFRL in Kite, it went down 66% on the demerger day 22nd May but I have still not received the demerger company’s stock. \nAnyone has some knowledge on this? ",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfz6j6/didnt_receive_the_abfrl_demerger_stocks/",
        "created_utc": 1750409689.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Boring portfolios worked this year despite trade wars and real wars",
        "text": "To say that this year has been \"crazy\" is like saying yes, farts stink. Duh! But despite the insane drama and the stupidity of one powerful individual, markets have more or less brushed everything off. They've resumed their steady upward journey.\n\nI just wanted to quickly see how some of the most boring and simple portfolio performed despite all the pronouncements about doom, gloom, impending WW3,4,5 and remakes of all of them. What I did is I tool Nifty 100, Nifty Midcap 150, Gold (GOLDCASE ETF as a proxy), and Nifty 4-8 year G-Sec Index and ran a bunch of combinations. I used an admittedly dumb benchmark of 50% Nifty 100 and 50% Nifty Midcap 150. \n\nThe summary:\n\n* **Gold dominance**: The precious metal's +27.66% surge was the primary driver of portfolio outperformance\n* **Diversification premium**: All mixed-asset portfolios beat the pure equity benchmark\n* **Bond stability**: G-Sec provided steady +5.91% returns, reducing overall portfolio volatility\n* **Mid-cap weakness**: Slight negative return in mid-caps was offset by other asset classes in diversified portfolios\n* Even if you had a dumb equal-weight portfolio where you allocated equally to equity, gold and debt, you would've come out looking like a hero.\n* There was no need to do any fancy nonsense\n\n# Index Returns (2025 YTD)\n\n*Period: January 1, 2025 to June 20, 2025*\n\n|Index|Description|Asset Class|Return (%)|\n|:-|:-|:-|:-|\n|Gold (GOLDCASE)|Gold price index tracking precious metal|Commodity|\\+27.66%|\n|Nifty G-Sec 4-8Y|Government bonds with 4-8 year maturity|Fixed Income|\\+5.91%|\n|Nifty 100|Top 100 companies by market capitalization|Large Cap Equity|\\+3.92%|\n|Nifty Midcap 150|Mid-cap companies|Mid Cap Equity|\\-0.06%|\n\n# Portfolio Returns (2025 YTD)\n\n|Portfolio Strategy|Allocation Breakdown|Return (%)|\n|:-|:-|:-|\n|**Equal Weight**|25% Nifty 100 + 25% Midcap + 25% Gold + 25% G-Sec|\\+9.36%|\n|**Diversified**|30% Nifty 100 + 30% Midcap + 20% Gold + 20% G-Sec|\\+7.87%|\n|**Conservative**|25% Nifty 100 + 25% Midcap + 0% Gold + 50% G-Sec|\\+3.92%|\n|**Benchmark**|50% Nifty 100 + 50% Midcap + 0% Gold + 0% G-Sec|\\+1.93%|\n\n# \n\nCharts\n\nhttps://preview.redd.it/fv0vvj7m918f1.png?width=1203&format=png&auto=webp&s=815622f748b0ee5db3a11e52b593d1942ef459e1\n\nhttps://preview.redd.it/t6kestrn918f1.png?width=1206&format=png&auto=webp&s=11ab4a6bbd65d59b9ee0aa014f648ccd31b9c9cb\n\nhttps://preview.redd.it/42kjb3ap918f1.png?width=1213&format=png&auto=webp&s=797d5c831e8c60db6a863df93a255e87d30fad25\n\n[https://open.substack.com/pub/vishalstakes/p/boring-portfolios-worked?r=5ul1b2&utm\\_campaign=post&utm\\_medium=web&showWelcomeOnShare=true](https://open.substack.com/pub/vishalstakes/p/boring-portfolios-worked?r=5ul1b2&utm_campaign=post&utm_medium=web&showWelcomeOnShare=true)",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfxx9u/boring_portfolios_worked_this_year_despite_trade/",
        "created_utc": 1750404617.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Is it a good idea to invest in smallcap companies with high debt?",
        "text": "I found southbank to be an undervalued stock fundamentally and ive been investing in it for a few days. \n\nOnly issue i found is that it has really high debt. I adjusted stop loss accordingly. \n\nWhat do you think about this? \n\nI'm aiming for long term with a strict stop loss target price. I have planned my entry and exit points.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfvyjp/is_it_a_good_idea_to_invest_in_smallcap_companies/",
        "created_utc": 1750396965.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "20th June News Highlights from Stock Market",
        "text": "• TD Power Systems bags Rs. 67 crore export order for traction motor components\n\n• Adani Power adds Reliance Power’s former unit to its string of acquisitions\n\n• CONCOR's 1:4 bonus issue: Record date fixed for July 4, 2025\n\n• NATCO Pharma gets 7 observations from FDA for Hyderabad manufacturing unit\n\n• Biocon raises Rs.4,500 crore through its QIP\n\n• Oswal Pumps IPO listing date today.\n\n• HDB Financial Services IPO: Price band set at  ₹700-740 per share\n\n• Nestle India share price gains as it sets date to consider first-ever bonus share issue",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfuxhw/20th_june_news_highlights_from_stock_market/",
        "created_utc": 1750393304.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Thoughts on Tejas Networks and HFCL?",
        "text": "Hey, I made a position in both these stocks when they were trading at their peaks. I’ve realised my mistake now but I’m trying to assess whether to buy more now that their prices have fallen and average my buying price or exit my position? Any thoughts? ",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfsvjl/thoughts_on_tejas_networks_and_hfcl/",
        "created_utc": 1750386554.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Elon Musk wants X (Twitter) to be your next Broker.",
        "text": "FT just reported that X (formerly Twitter) will soon let users trade and invest directly on the app. CEO Linda Yaccarino says the goal is for users to manage their entire financial life on X. Elon Musk’s dream of building an “everything app” is now entering the markets.\n\nhttps://preview.redd.it/w66vpyprrv7f1.jpg?width=1179&format=pjpg&auto=webp&s=0e8fe00b30b4d30768444846936d6577c24978ae\n\nAll inside a social media app where people are still arguing about Nifty expiry and Dogecoin memes.\n\nIt’ll probably roll out in the US first. But if it ever comes to India… would Groww, Upstox, or Zerodha be ready?\n\nWould you trust Elon with your demat?",
        "score": 9,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfa0o0/elon_musk_wants_x_twitter_to_be_your_next_broker/",
        "created_utc": 1750337445.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Traders is it true?",
        "text": "I saw a reel, it says - If you can't definite your setup then it is not a setup at all!\n\nWhat you guys feel about this statement?\n\nI am giving one of my setup that is very successful for me.  It is\n\nI am specially talking about Banknifty and Nifty.\n\nMarket was bullish/trending yesterday and Today it opened gapup and falls sharply in first 15-20 minutes. Look for doji/marubozu/ evening star...i.e. all the bullish candle stick patterns in 3 or 5 minutes candle . Take the trade for the target of 60 to 100 % of the fall, your targets will be achieved in next 10 to 20 minutes.\n\nNow what type of setup you use. Can you explain it to me.\n\nThanks in advance for sharing your trading setups.\n\nHappy trading!!!",
        "score": 3,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lfdw6b/traders_is_it_true/",
        "created_utc": 1750347442.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "What can possibly help Jio Financial Services.",
        "text": "Hello Everyone,\n\nI am just trying to expand my knowledge in the markets so please try help me understand.\n\nSo, recently in a podcast I saw that mutual funds cannot invest after 2022 in The US markets because of some RBI regulations. \n\nSo, Now BlackRock and JFS are coming with a 50-50 venture in the AMC scheme. Does that mean that they have a edge compared to other fund houses and can invest via blackrock or whatever.\n\nI am really having a strong and solid conviction in jio financial services. And I feel that it has massive potential to be a good investment multibagger. \n\nAnd also JFS has strong financial backing plus black rock is no small name either. \n\nI guess maybe there are other ways too to invest in US Markets via mutual funds or international brokers .\n\nMy knowledge is very limited but im trying to connect the dots.\n\nWhats your opinion?",
        "score": 8,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lf5ulf/what_can_possibly_help_jio_financial_services/",
        "created_utc": 1750322669.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Feeling sad/frustrated",
        "text": "I had promise myself to not touch options trading, and broke that promise after almost 2 years, did it and lost all that I made in cash market,.... seeing my portfolio go nowhere in past few months made me frustrated and I wasn't able to control my emotions, and traded options, learned the hard way, feeling sad 😭",
        "score": 6,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lf74mc/feeling_sadfrustrated/",
        "created_utc": 1750327814.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Seeking advice for novice.",
        "text": "32M earning just 30k in-hand monthly just enough to put food on the table nothing extra whatsoever for leisure. Would like to try investing the little I have saved so as to safeguard my son's future. I have no idea or knowledge about trading or investing. Any kind of advice will help. Stocks, trading anything that is the safest and easier to learn for a complete beginner will do.  Step by step advice would be much appreciated. For people selling courses,Please don't bother answering here. I don't have the money for that.",
        "score": 4,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lf0xat/seeking_advice_for_novice/",
        "created_utc": 1750304315.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "NSEIndia  webscraping  has become impossible (Akamai)",
        "text": "Earlier it was easily possible to scrape data of NSEIndia(Optionschain - [link](https://www.nseindia.com/api/option-chain-v3?type=Indices&symbol=NIFTY&expiry=31-Jul-2025)) for personal use using a simple Python-requests call .\n\nHowever recently looks like NSEIndia has switched to Akamai [API Protector](https://www.akamai.com/products/app-and-api-protector) , making the task almost impossible .\n\nIndividual requests with ample delay of 5 seconds between them are also getting flagged as bots .\n\nTried using Selenium and Playwright to disguise a real user's browser clicks ( by following the actual linked path  to the scraped data) , but with even a single request Akamai detects the bot and gives a 403 ERROR.\n\nHas anyone tried any other succesful solution?",
        "score": 153,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1le7web/nseindia_webscraping_has_become_impossible_akamai/",
        "created_utc": 1750220125.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Mazagon dock ship: Hold or sell?",
        "text": "Been invested in the stock for 3 months now. Seen a good alpha. \nThoroughly believed in the fundamentals and then the geopolitical movements lately only further assured it. But recently seeing a slump. \nInterested to hear others thoughts. ",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lf4qgo/mazagon_dock_ship_hold_or_sell/",
        "created_utc": 1750318192.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "How can I get NSE Market feed and data? CMOTs and Accord are pretty expensive any alternative?",
        "text": "\nLooking for reliable and cost-effective options to integrate NSE market data into my application. I’ve found that CMOTS and Accord are quite expensive, so I’m exploring more affordable alternatives that won’t break the budget for a startup.\nRequirements\n\t•\tReal-time or near real-time market data\n\t•\tHistorical data access\n\t•\tReliable API/feed\n\t•\tCost-effective pricing structure\n\t•\tGood documentation and support\nWhat I’ve researched so far\n\t•\tCMOTS: Pricing seems quite high for a startup\n\t•\tAccord: Also on the expensive side\nQuestions\n\t1.\tAre there more affordable vendors besides CMOTS and Accord?\n\t2.\tWhat’s the typical cost structure for NSE data feeds?\n\t3.\tAny recommendations based on your experience with different providers?\n\t4.\tAre there any free or freemium options available for development/testing?\nAny insights from developers who have integrated NSE data would be greatly appreciated!",
        "score": 3,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1leqtcr/how_can_i_get_nse_market_feed_and_data_cmots_and/",
        "created_utc": 1750276392.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Israel Iran War Updates and Possible Stock Market Implications",
        "text": "Will the Israel and Iran Conflict keep pushing oil and gold prices higher? Summary provided below to highlight the extent of the damage inflicted on both sides. Any shut down of the Strait of Hormuz would sky rocket crude oil prices as well as high beta crude stocks. Is this one of the key leverage points Iran has on global markets and inflation as a whole?\n\n*(All times are in Eastern Standard Time - Events to be Added as they unfold)*\n\n* 12:00 AM – NY Times – Israel launches new strikes on Tehran; Trump again demands Iran’s “unconditional surrender.”\n* 12:11 AM – SCMP – Beijing presses both sides as civilian toll rises: “Did the missile ask who was Muslim, who was Jew?”\n* 12:14 AM – MarketFlux – Markets brace: risk assets wobble after Trump’s surrender ultimatum.\n* 12:15 AM – Bloomberg – Xi and Trump stake out opposite positions as G-7 meeting fractures.\n* 12:24 AM – Barron’s – IDF says it hit Iranian centrifuge and weapons plants overnight.\n* 12:35 AM – Yahoo Finance – Asian shares split; crude extends rally on Mideast fears.\n* 12:56 AM – Staunovo – Satellite imagery: US 5th-Fleet pier in Bahrain cleared of war-ships as risk balloons.\n* 1:00 AM – Bloomberg – Bank of Korea: tariffs plus Israel-Iran risk could reignite inflation.\n* 1:16 AM – Bloomberg/Yahoo – War enters Day 6; Trump consults security team on possible US strikes.\n* 1:38 AM – Bloomberg – Iran and Israel still trading fire; “US decision window” dominates talk in capitals.\n* 1:49 AM – WSJ – Israel running low on Arrow long-range interceptors, US official warns.\n* 2:05 AM – Bloomberg (Ger.) – Trump weighs Iran options as Israel intensifies sorties.\n* 2:30 AM – CNBC – Cease-fire hopes fade; energy-driven inflation risk back on traders’ screens.\n* 2:58 AM – Bloomberg – Israel starts emergency air-bridge to repatriate tens of thousands abroad.\n* 3:20 AM – Bloomberg – Riyadh IPO (Flynas) slumps on war jitters; regional equities under pressure.\n* 3:35 AM – Reuters (live) – Missile streaks light up Iranian sky as sixth-night exchanges continue.\n* 4:12 AM – UN Geneva – Iran’s envoy: future responses will be “proportionate, under international law.”\n* 4:30 AM – ECB / Reuters – Panetta: policy to stay flexible; war adds “hard-to-quantify” downside risks.\n* 5:33 AM – IDF – Roughly 30 Iranian ballistic missiles fired overnight; none hit critical Israeli sites.\n* 6:00 AM – NY Times – Fresh Israeli raids on Tehran outskirts; ground troops redeployed from Gaza.\n* 6:05 AM – Yahoo Finance – Energy, defense, shipping ETFs outperform; tech lags on higher-oil angst.\n* 6:07 AM – Bloomberg – Tanker trackers: Iran rushing cargoes out of Gulf before potential blockade.\n* 6:12 AM – Russian MFA / IFX – Moscow warns Washington: direct US military aid to Israel would “radically destabilise” region.\n* 6:20 AM – Bloomberg “Pulse” – Trump’s advisers draft strike options; G-7 cannot agree on joint stance.\n* 6:23 AM – Mehr / LiveSquawk – Khamenei: Israel “made a huge mistake and will be punished.”\n* 6:30 AM – Yahoo Finance – Brent spikes near $79; VLCC insurance premia soar, charterers bid up tonnage.\n* 7:10 AM – Kremlin – Putin phones UAE leader, offers mediation and urges “immediate” cease-fire.\n* 7:22 AM – Bloomberg – Khamenei tells US: Iran “will never surrender,” warns against American intervention.\n* 7:30 AM – YuanTalks – Freight rates post biggest one-day jump of 2024 as ships detour around Hormuz.\n* 7:45 AM – Reuters – Israel launches phased airlift to bring citizens home; first El Al rescue flights depart Rome.\n* 8:02 AM – CNBC – Iran threatens “irreparable damage” if US joins fight; analysts debate $100-plus oil.\n* 9:10 AM – Bloomberg – Persian-Gulf war-risk insurance climbs; underwriters pull back Gulf cover.\n* 10:23 AM – PiQSuite – Trump: tells Netanyahu to “keep going,” gives no pledge of extra US help.\n* 11:34 AM – Bloomberg – Missile tempo from Iran slows; Israel lifts some public-safety curbs.\n* 11:50 AM – Yahoo Finance – Oil now +8 % since first Israeli strike; traders say “US stance is the wild card.”\n* 12:00 PM – Bloomberg – Iran’s leader rejects surrender call; Israel pulls more brigades to northern front.\n* 12:11 PM – MarketsDay – US embassy arranging evacuation flights and cruise-ship corridor for citizens.\n* 12:16 PM – CNN (US officials) – Third US carrier group will enter the east Med next week.\n* 12:24 PM – Bloomberg / WH pool – Administration drafts wider evacuation plan; Trump berates Fed chair Powell mid-briefing.\n* 12:27 PM – PiQSuite – Crude tankers divert south of Oman; VLCC spot earnings jump \\~25 % on Hormuz risk.\n* 12:31 PM – IDF / FirstSquawk Israeli military says *“missiles launched from Iran toward Israel.”*\n* 12:32 PM – iNewsroom Tehran tells Qatari mediators it’s ready to talk with U.S. *if Israel “calms the situation.”*\n* 12:35 PM – Naeem Aslam / MarketFlux Iran fires *new* ballistic-missile wave; U.S. embassy coordinates full evacuation of Americans.\n* 12:36 PM – CNBC Trump claims he issued Iran an “ultimate ultimatum” as evacuation prep begins.\n* 12:38 PM – Unusual Whales / MarketWatch State Dept. announces evacuation lifts; stocks still shrug off Trump’s threat and oil spike.\n* 12:41 PM – DeItaone Red-alert sirens wail across Tel Aviv and central Israel.\n* 12:42 PM – Bloomberg / Hezbollah TV US crude inventories post biggest draw in 11 months; Hezbollah says it will join only if Tehran in danger.\n* 12:43 PM – Investingcom Iran begins throttling internet access nationwide amid incoming-missile reports.\n* 12:44 PM – NY Times / Naeem Aslam NYT warns U.S. troops across Mideast face higher risk if Trump intervenes; IDF issues fresh “Red Alert” as Iranian missile streaks toward Tel Aviv.\n* 12:46 PM – The Hill Steve Bannon says MAGA will back Trump if he joins Israel’s fight.\n* 12:52 PM – IDF Radio Military source counts 8 Iranian missiles in latest volley; interception underway.\n* 12:57 PM – Barron’s Tehran imposes tighter internet curbs, citing Israel’s “abuse” of networks.\n* 1:00 PM – Benzinga / Reuters IDF claims 50 jets struck Iranian centrifuge site & missile factories near Tehran.\n* 1:04 PM – Zero Hedge Report of near-total internet blackout in Iran; Israel “controls the skies.”\n* 1:16 PM – Financial Juice / IBA Israel “expects” U.S. participation in looming strike on Fordow facility.\n* 1:20 PM – Iran Dep-FM / PiQSuite Ravanchi: Tehran “will respond” if U.S. joins Israel’s air war.\n* 1:23 PM – Sky News Arabia Israeli estimate: 400 ballistic missiles & 1,000 drones launched so far; only 20 reached civilian areas.\n* 1:30 PM – Naeem Aslam Bernie Sanders blasts Netanyahu, warns against U.S. escalation.\n* 1:36 PM – Al-Arabiya Netanyahu vows to hit “nuclear weapons, missiles and HQs” inside Iran.\n* 1:45 PM – solidintel\\_x / Reuters U.S. evacuates embassy families; IDF confirms diplomats flown out.\n* 1:49 PM – IRGC statement (PiQSuite) Guards taunt Israel: choose “slow death in bunkers or flee.”\n* 1:55 PM – Reuters Khamenei again rejects Trump’s surrender demand; calls U.S. “complicit.”\n* 1:57 PM – PiQSuite Israel claims strikes on Natanz & other nuclear sites thwart “imminent bomb” plan; IAEA says no proof of weaponisation.\n* 2:16 PM – BreakingDefense Analysts: Hezbollah still signalling it may stay out unless regime collapse looms.\n* 2:31 PM – US Embassy / Zero Hedge Mission personnel begin phased departure; commercial charter options pre-positioned.\n* 3:12 PM – Bloomberg MAGA fissures show as Trump hints at striking Fordow; populist bloggers warn *“no more Middle-East wars.”*\n* 3:15 PM – Fed presser Powell: conflict could pop energy prices but “normally fades from core inflation.”\n* 3:26 PM – LiveSquawk Trump: *“If Israel does a good job we will not need to fight … meeting in an hour.”*\n* 3:53 PM – staunovo Tehran fires first two-stage Sejjil missile at Israel; no impact reported.\n* 4:02 PM – Barron’s / Yahoo S&P drifts higher into Fed as traders watch crude and Tel Aviv radar.\n* 4:17 PM – Yahoo Finance Oil now +10 % since war’s start; “wild card is the United States.”\n* 4:19 PM – Barron’s UN Security Council schedules emergency Friday session on the conflict.\n* 4:25 PM – PiQSuite Classified Iran briefing set for all 100 US senators; Schumer wants intel on Fordow threat.\n* 4:36 PM – Bloomberg Trump’s flirtation with joining Israeli strikes starts to splinter his once-solid MAGA coalition.\n\n|Ticker/Asset|Price (USD)|Intraday Change|\n|:-|:-|:-|\n|**WTI Crude (Futures)**|$75.82/barrel|–$0.98|\n|**SPY**|$599.59|\\+$2.06 (+0.35%)|\n|**XOM**|$113.67|–$0.33 (–0.29%)|\n|**LMT**|$471.00|–$8.34 (–1.74%)|\n\n\\-Articles Sourced From: [Marketflux.io](https://marketflux.io/)",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lemfd1/israel_iran_war_updates_and_possible_stock_market/",
        "created_utc": 1750266099.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "25L in Bank accounts. What to do?",
        "text": "Now 1st - don't comment: ask a paid advisor. \n\n2nd : I have enough Gold. SIP in equities also on going. \n\nWhere should I park this given the markets may move side ways - as it seems for 2-3 yrs. \n\nShould I invest in Yes Bank : keep averageing at every dip....\nOr put it in debt funds for 3 yrs. \n\nMy worry is if I put in equity mutual fund - it may generate -ve or very low returns. \n\nI must park this money somewhere - can't keep it in Bank and can't decide. ",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lf57yo/25l_in_bank_accounts_what_to_do/",
        "created_utc": 1750320131.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "‘Markets witnessing significant shifts in consumer behaviour, business models’ says Tata Consumer Products",
        "text": "",
        "score": 2,
        "url": "https://www.thehindu.com/business/markets-witnessing-significant-shifts-in-consumer-behaviour-business-models-says-tata-consumer-products/article69710458.ece",
        "created_utc": 1750269058.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Founders can now hold employee stock options post listing, says SEBI",
        "text": "",
        "score": 2,
        "url": "https://www.thehindu.com/business/founders-can-now-hold-employee-stock-options-post-listing-says-sebi/article69710570.ece",
        "created_utc": 1750269024.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Will NIFTY break the zone",
        "text": "[Will the zone be broken ?](https://preview.redd.it/bh0b0ijwwq7f1.png?width=2172&format=png&auto=webp&s=9e1f10d0c2dc66cfc91ae5c4be1b41d599f3b84e)\n\nFor past few days nifty has been heavily consolidating the moves are wild and has been retested multiple times . Even I am not sure what is happening . But seems like if it breaks 24400 zone then we can see a downfall. What are your thoughts on this ?",
        "score": 2,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lery4h/will_nifty_break_the_zone/",
        "created_utc": 1750279156.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "STOP NSE/BSE Expiry Change",
        "text": "Every few months, either NSE, BSE, or SEBI decides to shake up the expiry days for options and futures. Whether it’s moving Bank Nifty, FINNIFTY, or now shifting expiries between exchanges, **the lack of consistency is damaging**.\n\nOne week it’s Thursday, next it’s Tuesday. What’s next? Sunday night moon expiries?\n\nWe as traders and investors rely on **stability and predictability**. Frequent changes hurt retail participation, confuse new entrants, and reduce confidence in the overall system. People build strategies, algos, and businesses around certain expiry patterns—changing them every 3 to 6 months throws everything off.\n\nThis isn’t innovation; it’s disruption for the sake of headlines and competition. There should be **strong consultation with the public and the trading community before such decisions are made**, and there must be a **cooling-off period or limit to how frequently such changes can be made (min 2 yrs)**.\n\nLet’s not sit back this time. Reach out to SEBI and help stop this nuance. Will share the email body if I see there are many others like me who express same concerns as mine.\n\nRemember **APES STRONG TOGETHER !!!**",
        "score": 13,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1le99cw/stop_nsebse_expiry_change/",
        "created_utc": 1750224972.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Indian stock market",
        "text": "I seem there wont be a multi bagger stocks like Titan in future or near future. New startup such as swiggy, paytm or any education startup all these can be done by any other company (if they have good VC sponsering). Most companies in india is service oriented most dont have any edge in their innovation or product speciality (apart from lobbying). So will it become very hard even for fund manager to find a multi bagger stock( i know they will some how know insider information) (wouldn't company which is backbone of a political party will be the new multi bagger because all these are services can be done by any one with money could provide these services so companies backing by political parties will have money and they can lobby and get the contract to provide the required service)\n\nNote: i am not creating any negative opinion as there is no growth in india. Kindly consider all these points as a good factor \n\nAlso now a days before company listed in stock exchange the wealth is already being shared by the promoters once the company becomes 1000cr or 100000cr or 10000cr they are being listed publicy as company from here to go above is not likely to happen soon as far as if the total market cap of our india increases or inflation increases so retail traders cannot make wealth as previous decade or earlier \n\nWhat do you guys think about these..? \n\nWhats your thoughts about indian market from here....? ",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lefzrs/indian_stock_market/",
        "created_utc": 1750250238.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "How to start trading",
        "text": "With no experience in trading nor in handling money, I, 18M ask for your help with me to learn trading, All I know about stock market is its spelling.\n\nI previously asked chatgpt, and it told me I can try virtual trading, for which I need no Money, and can practice before the real game, chatgpt also told me about two apps, 1.StockGro 2.MoneyBhai, with no knowledge, i obviously couldn't understand anything there.\n\nPlease help me with a step-by-step guide, or any material I can follow. \n\nThank you.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lehul8/how_to_start_trading/",
        "created_utc": 1750255214.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Can anyone pls tell me why the dividend amount credited to my account is less than the amount supposed to be paid out?",
        "text": "Hey guys, so I owned 71 stocks of Powergrid Infra on the ex date and the dividend was 3₹ per stock. When I checked my account, there was a credit of only ₹197 instead of the 213₹ to have been paid out. Even Groww's dividend report shows that 213₹ as the dividend to be paid out.\n\nSo why is there a discrepancy and where could I find the reason for the deduction if there are any?",
        "score": 11,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldv72h/can_anyone_pls_tell_me_why_the_dividend_amount/",
        "created_utc": 1750185687.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Zerodha - stock breakup bug",
        "text": "Thanks zerodha for giving me a mini heart attack this morning lol\n\nThe amount I have invested here is just 13 stocks at avg buying price of 3177.\nOriginal Amt invested 13*3177 ~ 41300\n\nEach stock was divided into 10.\nSo that gives me 130 stocks.\nNow 130*3177~4lakh\nBut the new price of the divided stock is not updated. Thus the wrong calculation\n\nHope they fix it.\n\n\n#",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1leahii/zerodha_stock_breakup_bug/",
        "created_utc": 1750229750.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Parag Parikh flexi",
        "text": "Guys, I’m very new to stocks and mutual funds. Just started by 2024 last and I have a genuine doubt, is Parag Parikh flexi cap fund overrated? This question may not be valid but as far as I could see the fund is not meeting benchmark during bull run and underperforming.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1leede9/parag_parikh_flexi/",
        "created_utc": 1750245129.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Fellow traders or investors. Suggestions invited",
        "text": "If some one is buying penny stocks. Thinking that one day they will become millionaire by buy this shit. How to tell them that you should stay away from this. Instead they should learn about personal finance, investing, wealth creation etc. I always face this problem people come to me saying we will invest for long term, follow the rules, stay in the game and after 2 to 3 months they start buying this penny stocks on their own and say we just invested for long term. Let's see how it will after 5 years. I show them that this company is not at all doing business anymore, there sale are zero, they do nothing but still they hold it like it's there own. What is this. Why people do this. Are they dumb are acting like one. What you all have to say about this.",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lduk83/fellow_traders_or_investors_suggestions_invited/",
        "created_utc": 1750184204.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "The stock i invested, the company is showing Suspended",
        "text": "Hi, \n\nI invested some shares around 1 lakh in a company: Sai Baba Investment & Commercial Enterps some years ago. If i click on that, my equity portal (hdfc sec) shows 'Scrip is suspended'. The value of those shares are now at 1.40 INR. \n\nWhen I bought, at that point, it used to make upper circuit but after sometime it started to decline, touching lower circuit daily. I knew that I have invested in a fraud company.\n\nHOW CAN I GET MY MONEY BACK?. Do i need to report this to bse to get my money back. Need help, please. Thankyou!",
        "score": 21,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldhhm2/the_stock_i_invested_the_company_is_showing/",
        "created_utc": 1750147543.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "What's the best data source for back-testing Algorithmic Swing Stock Trades?",
        "text": "I'm an engineer who hates giving other people control over my money, and I'm too lazy to control it myself. I wanna write (my first) a Swing trading (pardon me if I got the wrong terms but I mean buying and selling within less than a week or sometimes intraday) algorithm and see how well it performs.\n\nMostly doing this because I've been swing trading a lot anyway but I tend to forget or miscalculate my targets and stoplosses simply cause I'm too lazy to care.  \nI'm not sure where I can find the best historical data (highest data-point volume with highest accuracy) and ideally for free, or a low cost.  \nThanks in advance.\n\ncompletely unrelated PS: I've never been more sad about not having enough money to put in USA markets right now. I could make a million by the time orang man resigns XD\n\nEDIT: Ideally, I would want data that accurately captures daily stock liquidity, volatility, along with timestamps of news (example a news saying Tata motors announces dividend on XYZ date, and the corresponding data of the following day/week)",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldnxy7/whats_the_best_data_source_for_backtesting/",
        "created_utc": 1750168952.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Just trying to understand everyones's pov!",
        "text": "Hey everyone!  \nThis is just a hypothetical scenario. I had a random thought and wanted to see how different people would approach the same situation. If you have the time, please give it some thought and share your perspective!\n\nScenario:  \nYou're building a long-term stock portfolio from scratch, with the intention of holding it for the next 20 years. You can take risk and have ₹5 lakhs of capital, and want to invest primarily in small cap stocks, with a maximum of 20 companies in the portfolio. I’m curious:\n\n1. How would you decide which sectors to invest in?\n2. What steps would you take to do a full analysis of companies that look promising financially?\n3. What key factors would you consider before finally choosing a company to invest in?\n\nLooking forward to your insights!",
        "score": 14,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldfwfg/just_trying_to_understand_everyoness_pov/",
        "created_utc": 1750141121.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Can someone please explain how \"expiry dates\" affects the volume and prices in the market?",
        "text": "There are so many news regarding the contract expiry dates. Earlier there used to be multiple, then reduced to only one. Now day is changed and it seems like a big news but how?\n\n\nHow does a contract expiry affects trading and stock prices?\n\n\nI'm in the finance field myself but (but not into f&o) so never understood the funda behind the expiry days ?",
        "score": 2,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldrwqo/can_someone_please_explain_how_expiry_dates/",
        "created_utc": 1750178202.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "SANJIV BHASIN [IIFL]front running - order out by SEBI",
        "text": "so called \"expert\" sanjiv bhasin finally caught by SEBI in front running case, one more fraud !!\n\nFront-running case: #Sebi bans Sanjiv Bhasin from markets, orders impounding of Rs 11.37 crore",
        "score": 3,
        "url": "https://i.redd.it/gbnvhfg0th7f1.jpeg",
        "created_utc": 1750168332.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "How to start Investing as 20 yr old",
        "text": "Hey, i want a crucial guidance from you and the thing is I don't expect much from my father in terms of money so they give me 500 rs every month for using for my studies and upto 200 rs remain with me as I don't like to waste money.so i want to invest it in Market and stocks. As this might not be consistent money i.e some month i would left with no money due to clg projects etc. so please tell me how can I invest in stocks with 100 - 200 rs .",
        "score": 11,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldcghs/how_to_start_investing_as_20_yr_old/",
        "created_utc": 1750129241.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Should I Withdraw from Mutual Funds or Stocks for Personal Expenses ?",
        "text": "🙏🙏\n\nI’m planning to make a few essential purchases soon. Most of my savings are in mutual funds and stocks.\n\nRather than taking a loan, I'm considering redeeming some investments. A few questions:\n\n1. **Given current market condition, is this a bad time to exit equity or mutual fund positions for personal spending?**\n2. **If I do withdraw, which should I prioritize — stocks,  MFs ?**\n\nLooking for practical advice or frameworks you’ve used in similar situations.\n\nfyi :   \nI invest ₹50,000/month via SIP:\n\n* ₹40,000 in **UTI Nifty 50 Index Fund Direct Growth**\n* ₹10,000 in **Nippon India Small Cap Fund Direct Growth**\n\nThanks.",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1ldqmcn",
        "created_utc": 1750175258.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Stock screener",
        "text": "How do i search for stocks that give good momentum? I trade (intraday) small and mid cap stocks but mos of the time these stocks gave only 1 point  move.. ho do i search for better stocks?",
        "score": 2,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldl1zr/stock_screener/",
        "created_utc": 1750161004.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Backrest help needed",
        "text": "I want to backrest nifty monthly short strangle which is 3 percent away and shifted every time nifty moves 0.75. We will exit if any one leg goes in the money. I want the backtest result of this strategy. Can some one help me with it",
        "score": 3,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldi8rh/backrest_help_needed/",
        "created_utc": 1750150712.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Need Advice on Investment and Budgeting",
        "text": "Hi everyone, I'm a salaried employee from India. I'm looking for advice on structuring my investments considering a few upcoming major financial commitments. I'd love your suggestions on budgeting, investing, and saving smarter.\n\n# 🔢 Current Financial Snapshot:\n\n* **Age**: 26\n* **Monthly Take-home Salary**: 1.5 Lakh (from June month, before that 1 lakh (16 Months) )\n* **Monthly Rent**: No rent (Permanent WFH from next month)\n* **Occupation**: Software\n* **Current Emergency Fund**: 3 Lakh\n* **Monthly SIP Investment:** 32 Thousand\n* **Monthly Insurance policy deduction:** 10k (for 10 Years)\n* **Debt :** 40K (2 EMI)\n\n# 🛠️ Upcoming Plans:\n\n* 💍 **Wedding in 16 Months** Budget: ₹15,00,000\n* 🏠 **Confused to buy FLAT, FARM or PLOT** \n\n📈 Mutual Fund Investments (SIP):(All 10% step-up) (All analysed by myslef)\n\n|Fund Name|Monthly SIP|\n|:-|:-|\n|Parag Parikh Flexi Cap Fund|₹4,000|\n|SBI Small Cap Fund|₹3,000|\n|HDFC Nifty 50 Index Fund|₹3,000|\n|Bandhan Small Cap Fund|₹2,000|\n|UTI Nifty Next 50 Index Fund|₹2,000|\n|Motilal Ostwal Midcap Fund|₹2,000|\n|Quant Small Cap Fund|₹3,000|\n|Tata Small Cap Fund|₹1,500|\n|Axis Large and Mid cap fund|₹1,000 (From 3 Years )|\n|ET Money Genius MF |₹10,000|\n|**Total Investment till now**|**4 Lakh**|\n\n# 📄 Insurance Policies:\n\n|Type|Provider|Premium (Monthly)|Sum Assured|Term|\n|:-|:-|:-|:-|:-|\n|Term Insurance|HDFC Life Click2Protect |₹7000|₹2 Crore|10 yrs|\n|Health Insurance(For family)|Employer|₹1000|₹10 Lakhs|Family Floater|\n|ULIP|LIC|₹2,500|₹20 Lakh|16 years|\n|Traditional Plan|LIC Jeevan Anand|₹2,500|₹40 Lakh|16 years|\n\n🤔 My Questions:\n\n1. How should I structure my investments to accommodate the wedding and upcoming EMI?\n2. How can I rebalance my MFs for better long-term + short-term performance?\n3. What are the best short-term instruments to save for the wedding?\n4. How can I continue investing in gold smartly while handling EMI for home and rent together?\n5. Should I reduce insurance premiums or restructure them?\n6. Any suggestions on creating a better emergency fund?\n\nWould really appreciate actionable suggestions or ideas on how you'd approach this situation. 🙏\n\nThanks in advance!",
        "score": 3,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldhzk7/need_advice_on_investment_and_budgeting/",
        "created_utc": 1750149634.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "\"If you follow everyone's advice, you'll end up exactly where everyone else is - stuck, broke, and confused. Especially in the stock market",
        "text": "If you follow everyone's advice, you'll end up exactly where everyone else is - stuck, broke, and confused. Especially in the stock market\n\n\"If you follow everyone's advice, you'll end up exactly where everyone else is - stuck, broke, and confused. Especially in the stock market, it's full of people giving 'expert advice' who've never made a single rupee.\n\nAsk them what they've achieved and they'll say: \"Bro, I have money... I just don't show it.\" Oh really? Then why are you still riding a broken bicycle? Nobody's asking you to buy a Rolls-Royce - just get a normal bike, bhai.\n\nLet's get real. You go to a lawyer for legal matters. You go to a doctor for health issues. Then why rely on random people when it comes to your investments and life savings?\n\nThis isn't the place for WhatsApp forwards and chai pe discussions. If you want to build real wealth, consult the professionals - Certified Investment Research Advisors (IRA) who are legally qualified, trained, and experienced in giving proper market advice.\n\nFree advice is everywhere, but wrong advice can cost you everything. Follow winners, not whiners. Because who you take advice from decides where you'll end up - rich, or regretting.",
        "score": 19,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ld6ijr/if_you_follow_everyones_advice_youll_end_up/",
        "created_utc": 1750112302.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Do regular growth stock grow the same as direct growth if you’ve already invested?",
        "text": "I have a couple of mutual funds, Mirae Asset large and mid cap, and SBI large and mid cap.\n\nBoth were regular growth taken a long time ago via agents.\n\nThe SIP has been stopped for a year since I came to know the difference between regular and direct, but I was wondering if both will grow the same % post investing?\n\nOr should I withdraw from those 2 and put it into my direct ones?",
        "score": 5,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lde5f3/do_regular_growth_stock_grow_the_same_as_direct/",
        "created_utc": 1750134649.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Need some advice",
        "text": "Hello everyone,\nI have recently started studying the stock market and shares, and I'm planning to invest a small amount in the energy sector. I find three stocks quite promising: Reliance Power, Suzlon Energy, and RattanIndia Power.\nCould someone please suggest which stock I should go with?\n",
        "score": 4,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldeb23/need_some_advice/",
        "created_utc": 1750135212.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Starting Traders Community",
        "text": "Hey Everyone!\nI am so done with my 9-5 job and was planning to start trading. My vision was to find a few expert traders and start a community so that they could help other people to share their knowledge on which stocks to invest and all. Let me know if anyone is interested :)",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldl8jt/starting_traders_community/",
        "created_utc": 1750161574.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Good Market live commentary?",
        "text": "Know anybody who is good at live commentary on Tele or X? I am looking for someone of the calibre of 3M Minish Patel who for some reason abruptly closed his T just bcos someone said something bad to him even though he was doing everything in good faith.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldial6/good_market_live_commentary/",
        "created_utc": 1750150907.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Any idea why my Zerodha Kite balance is in negative?",
        "text": "https://preview.redd.it/piu5y6abvi7f1.jpg?width=1170&format=pjpg&auto=webp&s=b2ba285ece20a89546aae84e93b754161e0a629c\n\n  \nI use Kite to invest in stocks about once a month. I usually add funds and then immediately buy stocks, so the funds rarely sit in my account. However, I've noticed my balance is becoming more and more negative each month. Do you have any idea why this might be happening?",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldtc8x/any_idea_why_my_zerodha_kite_balance_is_in/",
        "created_utc": 1750181433.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Have a look at TAPARIA TOOLS BSE",
        "text": "Hey guys, I'm new to stocks (19M) and I just learnt to use screeners. I came across this one stock which has such great ratios and other things that it just looks like too good to be true as far as I know about ROCE, P/B ratio and some other terms. It's net profit has been gradually increasing. It's market value keeps going up and up daily (it fell once but ever since it has just seen profit). Now I am not really great with these analysis and I feel like others should have a look at it as well, maybe it might blow up in future. But before investing anything I wanna know what others think about it. I would really appreciate if you go through it and help me answer these questions.\n\n1. What do you think it's position will be after 6 months. Will it fall or might rise?\n\n2. If you would invest any amount into it, how many share would you suggest to get? (It's current price is 20.95)\n\n3. What kind of analysis did you put before coming into any conclusion?\n\n  \nThank you for your response in advance.",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldxnxx/have_a_look_at_taparia_tools_bse/",
        "created_utc": 1750191416.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Are Kotak Neo app’s investment ideas actually useful? Need advice 🙏",
        "text": "Hey folks,\n\nI’ve been using the Kotak Neo app and came across their investment ideas section. For example, here’s a stock idea they gave recently for PPLPHARMA (Piramal Pharma Ltd). They recommended a **BUY** at ₹209 with a target of ₹305, projecting **53.07% potential returns in 11 months** (screenshot attached – current price is ₹199.25 as of now).\n\n\n\nI’m trying to figure out how reliable these research-based calls are. Has anyone here actually followed their recommendations and tracked the outcomes? Do they usually hit the target, or is it more of a hit-or-miss?\n\n\n\nAlso, what’s your overall experience using Kotak Neo for investing — especially in comparison to apps like Zerodha, Groww, or Upstox?\n\n\n\nWould really appreciate any advice or personal stories — whether you’ve gained or lost following their tips. 🙏\n\nThanks in advance!\n\nlikha Hindi mein Thoda chatgpt se modify kiya hai mitro",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldgtox/are_kotak_neo_apps_investment_ideas_actually/",
        "created_utc": 1750144735.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "Switching from Groww to Zerodha - Want Honest Feedback from Long-Term Users",
        "text": "I’ve been in the market for about 2 years now and started my investing journey with Groww. It was honestly a great platform to begin with, clean UI, simple to use, and great for a beginner like me.\n\nHowever, with recent increases in charges, I’m considering shifting my future investments to Zerodha. I’ve already explored some of the key differences and features.\n\nBut I really want to hear from long-time Zerodha users:\n1. How’s your experience overall?\n2. Any major pros and cons you’ve noticed?\n3. How’s customer support in real scenarios (not just general queries)?\n4. Do you face any delays, glitches, or app crashes during market hours?\n5. Would you still recommend Zerodha in 2025 or suggest another alternative like Angel One, Dhan, or Upstox?\n\nAlso, I plan to keep my Groww demat active for existing holdings, but do fresh investments via Zerodha. If you've done something similar, would love your advice too.\n\nThanks in advance to anyone sharing their experiences :)\n\nPS: Thanks for the overwhelming response, it helps a lot!!\nCan you please also help me with the information on how to transfer the shares from groww to Zerodha (if possible without charges) ?\nI might close my Groww demat account after this!",
        "score": 118,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1lckgtc/switching_from_groww_to_zerodha_want_honest/",
        "created_utc": 1750050375.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "New to market. Had a doubt",
        "text": "Hi there , i wanted to know a thing when I am using charts and drawing in it in the laptop web version(angel one) it is not showing in the mobile app. Are there any settings or chances I need to make ?",
        "score": 1,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldgbwi/new_to_market_had_a_doubt/",
        "created_utc": 1750142773.0
    },
    {
        "subreddit": "IndianStockMarket",
        "title": "HOW!? Options pricing",
        "text": "Nifty 24700 PE, 19 June,  closed yesterday at the price of approx 60.30, cut to today, Nifty down by almost 100 and the price is 55!! as of now, how is this possible, anything related to greeks or something else? Can anyone explain in detail",
        "score": 0,
        "url": "https://www.reddit.com/r/IndianStockMarket/comments/1ldihn3/how_options_pricing/",
        "created_utc": 1750151680.0
    }
]