[
    {
        "title": "These 7 smallcap stocks slip to a new 52-week low; do you own any?",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-smallcap-stocks-slip-to-a-new-52-week-low-do-you-own-any/slideshow/121955368.cms",
        "published": "Thu, 19 Jun 2025 18:29:57 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Smallcap Slump\n\nThe benchmark Sensex dropped by 83 points on Thursday, settling near the 81,362 level. Amid this decline, six stocks from the BSE Smallcap index reached their lowest prices in the past 52 weeks. A 52-week low is a technical indicator that marks the lowest price at which a stock has traded over the last year. Many investors and traders view this as a key factor when evaluating a stock’s current worth and forecasting its future price trends.",
        "scraped_at": "2025-06-19T19:00:23.546422"
    },
    {
        "title": "Breakout Stocks: How to trade AU Small Finance Bank, Muthoot Finance & Authum Investment that hit fresh 52-week high? - Market Summary",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-au-small-finance-bank-muthoot-finance-amp-authum-investment-that-hit-fresh-52-week-high/slideshow/121955282.cms",
        "published": "Thu, 19 Jun 2025 18:20:30 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Authum Investment has given a strong breakout above its previous all-time high of 2,550, with the formation of a bullish marubozu candle and a notable rise in trading volumes—signaling a continuation of the uptrend.\n\nThe breakout zone lies between 2,525–2,550, and the CMP is Rs 2,549.80. The stock is trading well above key moving averages and even above the upper Bollinger Band, suggesting heightened bullish momentum.\n\nRSI is in a strong bullish zone, confirming the positive sentiment. Short-term price targets are seen at 2,750 and 2,900, while support lies at 2,480 and further lower at 2,400. Any dip toward the 2,500–2,525 range may present a good entry opportunity.\n\n\n\n\n\n\n\n\n\n\n\n(Note: Always consult your financial advisor before making any investment decision.)\n\n(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)\n\n",
        "scraped_at": "2025-06-19T19:00:24.026625"
    },
    {
        "title": "What is Sebi's new NSEL settlement scheme, and how will it benefit stock brokers?",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/what-is-sebis-new-nsel-settlement-scheme-and-how-will-it-benefit-stock-brokers/articleshow/121955172.cms",
        "published": "Thu, 19 Jun 2025 18:18:42 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Settlement process\n\nBased on Quantity\n\nLive Events\n\nNon-monetary settlement\n\nExclusions\n\nLimited scope\n\nAbout NSEL scam\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMarket regulator Securities and Exchange Board of India (Sebi) on Wednesday introduced a one-time settlement scheme for stock brokers who traded on the now-defunct National Spot Exchange Ltd (NSEL) platform. The scheme, aimed at expediting enforcement proceedings under SEBI's jurisdiction, offers eligible brokers a chance to settle violations related to securities laws without prolonged litigation.Sebi has approved a structured scheme for brokers who were registered or applied as trading/clearing members under SEBI's 1992 Stock Broker Regulations and operated on the NSEL platform.It has suggested dual criteria for monetary settlement in which the settlement amount will be calculated based on -- one is the quantity of units traded in paired contracts and the second is based on traded value available in paired contracts: 1 basis point (0.01%) of traded value in paired contracts, subject to a minimum of Rs 5 lakh.-- If the quantity involved in paired contracts is then or equal to 25,000 units, the settlement amount will be Rs 1,00,000.-- Higher than 25,000 but less than 1,00,000, the settlement amount is Rs 1 lakh + Re 1 for each unit in a paired contract above 25,000 units.-- Higher than 1,00,000, The settlement amount will be Rs 1.75 lakh + Rs 0.50 for each unit in paired contracts above 1,75,000 units, subject to a maximum of Rs 5 lakh.The total payable is the sum of both these components, with a cap of Rs 5 lakh under quantity-based calculation.Brokers availing the scheme may also face voluntary debarment ranging from 1 to 6 months, adjusted for any prior suspension or restrictions already served.Brokers named in charge sheets by agencies such as the Economic Offences Wing (EOW) or the Enforcement Directorate (ED) are not eligible. Defaulters with stock exchanges are also excluded.Future charge sheet = Void settlementIf a broker avails the scheme and is later charge-sheeted by a law enforcement agency, the settlement becomes null and void.The scheme applies only to violations of SEBI regulations. It does not interfere with proceedings by other enforcement agencies.Sebi expects this move to reduce legal costs, ease regulatory burden, and allow swifter resolution—while still serving as a deterrent for future violations.SEBI will continue enforcement actions against brokers who are either ineligible or choose not to opt for this scheme.Also Read: Sebi eases delisting norms for PSUs with over 90% government holding The NSEL scam, considered one of India’s biggest financial frauds, unfolded in July 2013 when the NSEL abruptly suspended trading in most commodities, exposing a Rs 5,600 crore default that impacted around 13,000 investors. NSEL, promoted by erstwhile Financial Technologies (India) Ltd (now 63 Moons Technologies ), was set up for spot trading in commodities.NSEL illegally offered paired contracts—buying and selling commodities with guaranteed returns over short durations, violating spot market norms.These contracts were falsely backed by warehouse receipts that had no real stock. When the Forward Markets Commission (FMC) ordered a halt to these illegal contracts, the default was triggered.",
        "scraped_at": "2025-06-19T19:00:24.576578"
    },
    {
        "title": "Gainers & Losers: Vedanta, Siemens Energy among 10 stocks that moved the market today",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-vedanta-siemens-energy-among-10-stocks-that-moved-the-market-today/slideshow/121955028.cms",
        "published": "Thu, 19 Jun 2025 18:08:03 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Vedanta\n\nVedanta shares dropped by 3.7% to Rs 439.50 on the BSE. This decline followed the company's announcement of its first interim dividend for FY26, which is set at Rs 7 per share, amounting to around Rs 2,737 crore.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:24.745158"
    },
    {
        "title": "Nestle board to meet on June 26 to consider bonus share issue",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/nestle-board-to-meet-on-june-26-to-consider-bonus-share-issue/articleshow/121955010.cms",
        "published": "Thu, 19 Jun 2025 18:06:14 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nFMCG major Nestle India will hold a board meeting on June 26, 2025, to consider and approve a proposal for issue of bonus shares. The trading window for dealing in the securities of the company will remain closed from June 19, 2025 to June 28, 2025.The company informed about the development after market hours and shares of Nestle India today ended at Rs 2,313.30 on the NSE, down by Rs 27.50 or 1.17% over the Wednesday closing price.The Maggi-maker reported a 5.2% year-on-year (YoY) decline in standalone net profit to Rs 885 crore for the March quarter, while revenue from operations rose 4.5% YoY to Rs 5,504 crore. Both figures came in slightly above Street estimates.The total sales and domestic sales for the quarter increased by 3.7% and 4.2%, respectively, with the company saying that the domestic sales growth was broad-based.In its outlook, Nestlé India had said that the commodity prices remain firm for coffee, while cocoa prices, though corrected, continue to stay elevated. \"Prices remain stable for edible oils. Milk prices have firmed up cyclically with the onset of summer.\"In FY25, powdered and liquid beverages were the largest growth contributors, posting high double-digit growth. The confectionery segment grew at a high single-digit pace in both value and volume, driven by KITKAT, for which India is the second-largest market globally.Nestle India shares have underperformed the markets witnessing an 8% slide in the past one year. In 2025, its gains have been to the tune of 7%. In contrast Nifty has yielded over 5% returns in the past 12 months while its year-to-date returns stand at 4.4%.",
        "scraped_at": "2025-06-19T19:00:25.335762"
    },
    {
        "title": "Aditya Birla Lifestyle Brands to list on BSE on June 23, post ABFRL demerger",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-lifestyle-brands-to-list-on-bse-on-june-23-post-abfrl-demerger/articleshow/121954851.cms",
        "published": "Thu, 19 Jun 2025 18:03:44 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Aditya Birla Lifestyle Brands Limited (ABLBL) will get listed on BSE from Monday, June 23, following its demerger from Aditya Birla Retail and Fashion Limited (ABFRL).The stock will be placed in the list of T Group of Securities and will be in the Trade-for-Trade segment for 10 trading days, a BSE notice issued today said.Under the scheme of arrangement, ABFRL has demerged its Madura Fashion & Lifestyle (MFL) business and vested it into Aditya Birla Lifestyle Brands.The shareholders of ABFRL will get one share of ABLBL for every one share in ABFRL in addition to their existing shareholding in ABFRL.The business assets and liabilities will be split between the two companies per the prescribed regulatory provisions. In line with this, the overall ABFRL borrowing, which is estimated to be Rs 3,000 crore as of March 31, 2024, will be split between the two companies.The estimated debt to be transferred to ABLBL will be Rs 1,000 crore, and the balance will continue to stay with ABFRL.The demerger is expected to unlock value for the shareholders of ABFRL as each of the listed entities will have their distinct capital structures, independent growth trajectories and value creation opportunities, a company filing said.ABFRL plans to raise Rs 2,500 crore equity capital within 12 months of demerger with promoter participation.Also read: HDB Financial's Rs 12,500 crore IPO to open on June 25, price band announcement later Before the scheme, the paid-up equity capital of ABLBL was Rs 5 lakh, consisting of 50,000 equity shares of Face Value of Rs 10/- each, which shall be cancelled.",
        "scraped_at": "2025-06-19T19:00:25.935974"
    },
    {
        "title": "Stock Market Sectors: Stock market update: Sugar stocks down as market falls",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-sugar-stocks-down-as-market-falls/articleshow/121954224.cms",
        "published": "Thu, 19 Jun 2025 17:25:11 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:26.493560"
    },
    {
        "title": "Eppeltone Engineers IPO subscribed 234 times, GMP robust at 47% on Day 3. Check details",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/eppeltone-engineers-ipo-subscribed-234-times-gmp-robust-at-47-on-day-3-check-details/articleshow/121954163.cms",
        "published": "Thu, 19 Jun 2025 17:22:03 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nAbout Eppeltone Engineers IPO\n\nEppeltone Engineers\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe third day of Eppeltone Engineers’ initial public offering (IPO) witnessed an impressive subscription of 234 times, with the company’s shares trading at a healthy grey market premium (GMP) of 46.9% or Rs 60-62.At 3:20 pm today, 57.49 crore bids were received from the market participants out of 24.56 lakh offered.Retail investors led the demand, submitting 2.47 lakh applications for a total of 24.71 crore shares. Non-Institutional Investors (NIIs) followed with 21,941 applications for nearly 26.41 crore shares.The Qualified Institutional Buyers (QIBs) had placed 91 applications for 7,92,31,000 shares.The Rs 43.96 crore IPO opened for subscription on Tuesday and will close on Thursday, with shares expected to be listed on the NSE SME on June 24.The offering comprises solely a fresh issue of 34.34 lakh equity shares, with a price band of Rs 125 to Rs 128 per share. Retail investors can apply for a minimum of 1,000 shares per lot, requiring an investment of Rs 1.28 lakh. High-net-worth individuals (HNIs) are required to bid for at least two lots, totaling Rs 2.56 lakh.The proceeds from the IPO will be allocated to meet working capital requirements (Rs 30 crore), fund capital expenditure for new machinery (Rs 5 crore), and cover general corporate purposes and issue expenses.Expert Global Consultants is the book-running lead manager, while Skyline Financial Services serves as the registrar.Established in 1977 and based in Noida, the company specializes in the manufacturing and supply of a wide range of energy management solutions, such as static and smart meters, watt-hour meters, BPL kits, LED lighting systems, advanced UPS solutions, battery chargers, and equipment for the railway and power sectors.Its key clients include Indian government agencies, electricity boards, and institutional buyers within the infrastructure sector.Eppeltone operates a 36,000 sq. ft. manufacturing plant in Greater Noida, with additional units in New Delhi. The company employs 59 permanent staff and is known for its robust research and development capabilities, along with a focus on sustainability in its energy products.For FY25, the company reported a 57% year-on-year revenue growth, reaching Rs 125.74 crore. Its profit after tax also grew by 38%, amounting to Rs 11.23 crore.",
        "scraped_at": "2025-06-19T19:00:27.043028"
    },
    {
        "title": "Stock Market Sectors: Stock market update: FMCG stocks down as market falls",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-fmcg-stocks-down-as-market-falls/articleshow/121953624.cms",
        "published": "Thu, 19 Jun 2025 16:54:17 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNEW DELHI: FMCG shares closed lower in the Thursday's session.Tata Consumer Products Ltd.(up 2.17%), Procter & Gamble Hygiene & Healthcare Ltd.(up 0.58%), Zydus Wellness Ltd.(up 0.56%), Gillette India Ltd.(up 0.22%), Marico Ltd.(up 0.14%), Colgate-Palmolive(India)Ltd.(up 0.06%) and Mrs. Bectors Food Specialities Ltd.(up 0.02%) stood among the top gainers.Umang Dairies Ltd.(down 6.07%), Varun Beverages Ltd.(down 4.43%), ADF Foods Ltd.(down 3.77%), Tasty Bite Eatables Ltd.(down 3.71%), JHS Svendgaard Laboratories Ltd.(down 3.46%), Parag Milk Foods Ltd.(down 3.27%), Gopal Snacks Ltd.(down 3.06%), LT Foods Ltd.(down 3.03%), Dodla Dairy Ltd.(down 2.98%) and AWL Agri Business Ltd.(down 2.75%) were among the top losers of the day.The NSE Nifty50 index ended 18.8 points down at 24793.25, while the 30-share BSE Sensex closed down 82.79 points at 81361.87.Tata Consumer Products Ltd.(up 2.17%), Eicher Motors Ltd.(up 1.87%), Mahindra & Mahindra Ltd.(up 1.77%), Wipro Ltd.(up 1.53%), Apollo Hospitals Enterprise Ltd.(up 1.1%), Titan Company Ltd.(up 1.09%), JSW Steel Ltd.(up 0.99%), Dr. Reddy's Laboratories Ltd.(up 0.98%), Grasim Industries Ltd.(up 0.67%) and Kotak Mahindra Bank Ltd.(up 0.66%) stood among the top gainers in the Nifty pack.On the other hand, Adani Ports & Special Economic Zone Ltd.(down 2.53%), Bajaj Finance Ltd.(down 2.02%), Adani Enterprises Ltd.(down 1.57%), Coal India Ltd.(down 1.57%), Tech Mahindra Ltd.(down 1.57%), IndusInd Bank Ltd.(down 1.53%), Shriram Finance Ltd.(down 1.5%), Jio Financial Services Ltd.(down 1.41%), Cipla Ltd.(down 0.95%) and Nestle India Ltd.(down 0.94%) closed in the red.",
        "scraped_at": "2025-06-19T19:00:27.695944"
    },
    {
        "title": "Bank of England keeps rates steady, sees further loosening as jobs market weakens",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-england-keeps-rates-steady-sees-further-loosening-as-jobs-market-weakens/articleshow/121953229.cms",
        "published": "Thu, 19 Jun 2025 16:35:30 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bank of England held interest rates at 4.25% as expected on Thursday but said it was focused on risks from a weaker labour market and higher energy prices as conflict in the Middle East escalates.Noting the elevated global uncertainty and persistent inflation, the Monetary Policy Committee voted 6-3 to keep rates on hold, with Deputy Governor Dave Ramsden joining Swati Dhingra and Alan Taylor to vote for a quarter-point reduction.A Reuters poll of economists had forecast an 7-2 vote to keep rates on hold after the central bank cut borrowing costs last month for the fourth time since August 2024.\"Interest rates remain on a gradual downward path,\" BoE Governor Andrew Bailey said, although policymakers added that interest rates were not on a pre-set path.\"The world is highly unpredictable. In the UK we are seeing signs of softening in the labour market. We will be looking carefully at the extent to which those signs feed through to consumer price inflation,\" he added.The central bank said rising tensions in the Middle East as it held its meeting over the past week had not been key to June's decision to hold rates but would be closely monitored going forward.\"Energy prices had risen owing to an escalation of the conflict in the Middle East. The committee would remain vigilant about these developments and their potential impact on the UK economy,\" the BoE said.Nearly all 60 economists polled by Reuters before the BoE's June meeting had predicted it would keep Bank Rate on hold at 4.25% with the next cut likely in August with a further reduction in the final three months of this year.Before Thursday's rate decision, investors were pricing in around two more quarter-point rate cuts by the BoE to 3.75% by December 2025.The central bank kept its guidance saying it would take a \"gradual and careful\" approach to further rate cuts.But Bank staff analysis struck a less pessimistic tone about the potential impacts of U.S. President Donald Trump's tariffs on the global economy, saying it might be less severe than thought in May. Trade uncertainty would still continue to have an impact on the UK economy, the central bank added.The BoE left its forecast for inflation broadly unchanged for the second half of this year, seeing a peak rate of 3.7% in September and an average of just under 3.5% for the rest of the year.The economy is now expected to grow around 0.25% in the second quarter of this year, slightly stronger than in its May forecast, though it said the underlying pace was weak.Since the middle of last year the BoE has cut interest rates by 1 percentage point, the same as the U.S. Federal Reserve - which on Wednesday held interest rates at the 4.25%-4.50% range - but only half as much as the European Central Bank, which has had less persistent inflation.Markets see just under half a percentage point more easing by the Fed this year and a further quarter-point cut by the ECB.The Fed on Wednesday cut its economic growth forecasts for 2025, raised its inflation projection and said the uncertainty hanging over the economy had diminished but remained elevated.Earlier on Thursday, the Swiss National Bank cut rates by 25 basis points to zero as inflation inflationary pressures decreased and it focused the risk of trade wars for inflation and the global economy.",
        "scraped_at": "2025-06-19T19:00:28.667567"
    },
    {
        "title": "Stock Market Sectors: Stock market update: Fertilisers stocks down as market falls",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-fertilisers-stocks-down-as-market-falls/articleshow/121952887.cms",
        "published": "Thu, 19 Jun 2025 16:21:04 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNEW DELHI: Fertilisers shares closed lower in the Thursday's session.Madhya Bharat Agro Products Ltd.(up 0.64%), Coromandel International Ltd.(up 0.55%), Krishana Phoschem Ltd.(up 0.49%) and Khaitan Chemicals & Fertilizers Ltd.(up 0.18%) stood among the top gainers.Zuari Agro Chemicals Ltd.(down 3.49%), Agro Phos India Ltd.(down 3.36%), National Fertilizers Ltd.(down 3.07%), Madras Fertilizers Ltd.(down 3.03%), Rashtriya Chemicals & Fertilizers Ltd.(down 2.93%), The Fertilisers and Chemicals Travancore Ltd.(down 2.83%), Gujarat State Fertilizer & Chemicals Ltd.(down 2.81%), Sikko Industries Ltd.(down 2.70%), Gujarat Narmada Valley Fertilizers & Chemicals Ltd.(down 2.26%) and Nagarjuna Fertilizers and Chemicals Ltd.(down 2.13%) were among the top losers of the day.The NSE Nifty50 index ended 18.8 points down at 24793.25, while the 30-share BSE Sensex closed down 82.79 points at 81361.87.Tata Consumer Products Ltd.(up 2.17%), Eicher Motors Ltd.(up 1.87%), Mahindra & Mahindra Ltd.(up 1.77%), Wipro Ltd.(up 1.53%), Apollo Hospitals Enterprise Ltd.(up 1.1%), Titan Company Ltd.(up 1.09%), JSW Steel Ltd.(up 0.99%), Dr. Reddy's Laboratories Ltd.(up 0.98%), Grasim Industries Ltd.(up 0.67%) and Kotak Mahindra Bank Ltd.(up 0.66%) stood among the top gainers in the Nifty pack.On the other hand, Adani Ports & Special Economic Zone Ltd.(down 2.53%), Bajaj Finance Ltd.(down 2.02%), Adani Enterprises Ltd.(down 1.57%), Coal India Ltd.(down 1.57%), Tech Mahindra Ltd.(down 1.57%), IndusInd Bank Ltd.(down 1.53%), Shriram Finance Ltd.(down 1.5%), Jio Financial Services Ltd.(down 1.41%), Cipla Ltd.(down 0.95%) and Nestle India Ltd.(down 0.94%) closed in the red.",
        "scraped_at": "2025-06-19T19:00:29.513222"
    },
    {
        "title": "Top 5 midcap stocks with decreasing promoter pledge ratios",
        "url": "https://economictimes.indiatimes.com/markets/web-stories/top-5-midcap-stocks-with-decreasing-promoter-pledge-ratios/slideshow/121952774.cms",
        "published": "Thu, 19 Jun 2025 16:16:33 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Decreasing Promoter Pledge\n\n\"Promoter Decreasing Pledge\" refers to a situation where company promoters reduce the portion of their shares pledged as collateral for loans or financial purposes. In the NSE midcap pack, we have highlighted the top 5 stocks with a decrease in promoter pledge during the March '25 quarter compared to the December '24 quarter, according to StockEdge promoter holding pledge scan.This usually indicates enhanced financial stability or a reduced dependence on borrowing, which is viewed as a positive signal for investors. It suggests that promoters are in a more robust position, reflecting increased confidence in the company's financial health and potentially boosting investor trust.",
        "scraped_at": "2025-06-19T19:00:29.766362"
    },
    {
        "title": "Stock Market Sectors: Stock market update: Mining stocks down as market falls",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-mining-stocks-down-as-market-falls/articleshow/121952750.cms",
        "published": "Thu, 19 Jun 2025 16:15:43 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:30.455868"
    },
    {
        "title": "Share market update: Most active stocks in today's market in terms of volume",
        "url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/share-market-update-most-active-stocks-in-todays-market-in-terms-of-volume/articleshow/121952436.cms",
        "published": "Thu, 19 Jun 2025 16:00:17 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNEW DELHI: Vodafone Idea(numbers of share traded: 64.10 crore), Karda Const(numbers of share traded: 23.83 crore), GTL Infra(numbers of share traded: 13.66 crore), YES Bank(numbers of share traded: 12.11 crore), Vishal Mega Mart Ltd.(numbers of share traded: 10.05 crore), Suzlon Energy(numbers of share traded: 9.07 crore), RattanIndia Power (numbers of share traded: 7.95 crore), Aeroflex Industries(numbers of share traded: 6.50 crore), JP Power(numbers of share traded: 5.74 crore) and Swiggy Ltd.(numbers of share traded: 4.74 crore) emerged top gainers in Thursday's market in terms of trading volume.The NSE Nifty index closed 18.8 points down at 24793.25, while BSE Sensex ended down 82.79 points at 81361.87.On the other hand, Adani Ports & Special Economic Zone Ltd.(down 2.53 per cent), Bajaj Finance Ltd.(down 2.02 per cent), Tech Mahindra Ltd.(down 1.57 per cent), Coal India Ltd.(down 1.57 per cent) and Adani Enterprises Ltd.(down 1.57 per cent) were among the top losers of the day.",
        "scraped_at": "2025-06-19T19:00:31.053087"
    },
    {
        "title": "ArisInfra Solutions IPO subscribed 88% on Day 2: Check GMP, other details",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/arisinfra-solutions-ipo-subscribed-88-on-day-2-check-gmp-other-details/articleshow/121952406.cms",
        "published": "Thu, 19 Jun 2025 15:59:31 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nWhat is the GMP of ArisInfra Solutions?\n\nAbout ArisInfra Solutions\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe initial public offering (IPO) of ArisInfra Solutions was subscribed to 88% by the second day of bidding, largely driven by strong participation from retail investors.As of 2:48 pm on Wednesday, the retail investor category was subscribed 2.5 times, followed by non-institutional investors (NIIs) at 93%, while the qualified institutional buyers (QIBs) category remained muted at 0.31%.According to the minimum bid details, retail investors must apply for at least one lot of 67 shares, translating to an investment of Rs 14,070 at the lower price band or Rs 14,874 at the upper band to qualify for allotment. For sNII (small Non-Institutional Investors), the minimum application size is 14 lots, or 938 shares, requiring an investment of approximately Rs 2,08,236. Meanwhile, NIIs (Non-Institutional Investors) are required to bid for a minimum of 68 lots, equivalent to 4,556 shares, amounting to Rs 10,11,432.Also Read: These 9 Nifty Microcap Index stocks trading below industry PE may rally up to 42% According to the company’s Draft Red Herring Prospectus (DRHP), the net proceeds from the public issue will mainly be used to fund ArisInfra’s working capital needs as it scales up its operations across multiple regions.The IPO, consisting entirely of a fresh issue of equity shares, has set a price band of Rs 210 to Rs 222 per share for its Rs 500 crore offering. The subscription window opened earlier today and will close on June 20.The shares of the company are expected to be listed on the BSE and NSE on June 25. Allotment is likely to be finalised by June 23.The issue is being managed by JM Financial IIFL Capital Services , and Nuvama Wealth Management , with MUFG Intime India (Link Intime) serving as the registrar to the offer.Shares of ArisInfra Solutions, a tech-driven B2B construction materials platform, are trading at a grey market premium of 9.9% or Rs 20-22 in the unlisted market.Founded in 2021, ArisInfra Solutions is a technology-driven B2B procurement platform backed by Siddharth Shah, co-founder of PharmEasy. The company aims to digitally transform the procurement ecosystem for construction materials by catering to institutional buyers such as real estate developers, contractors, and infrastructure firms. It facilitates the bulk supply of essential materials, including steel, cement, and aggregates.ArisInfra’s unified digital platform integrates warehousing, logistics, quality control, and just-in-time delivery, offering clients a streamlined experience. Through its interface, users can place orders, track shipments, manage documentation, and access technical support — positioning ArisInfra as a frontrunner in innovation within the construction supply chain industry.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:31.691160"
    },
    {
        "title": "Explained! What Sebi's nod on co-investment within AIFs means for investors, fund managers",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-sebis-nod-on-co-investment-within-aifs-means-for-investors-fund-managers/articleshow/121952303.cms",
        "published": "Thu, 19 Jun 2025 15:55:38 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nIllustration\n\nWhat Sebi has done?\n\n\n\n1) Simplification of current co-investment process\n\n2) Each co-investment gets a separate scheme\n\n3) Relaxed regulatory norms for CIVs\n\n4) Supports capital formation in startups & unlisted firms\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMarket regulator Securities and Exchange Board of India ( Sebi ) on Wednesday approved a new framework allowing Category I and II Alternative Investment Funds AIFs ) to offer co-investment opportunities directly within the AIF structure. The move aims to ease regulatory hurdles and simplify operations for fund managers and investors.\"With an objective to enhance ease of doing business for Alternative Investment Funds (AIFs), the Board approved the proposal to permit Category I & II AIFs to offer Co-investment scheme (CIV scheme) under SEBI (Alternative Investment Funds) Regulations, 2012. This will further facilitate AIFs and investors to co-invest and will support capital formation in unlisted companies through AIFs,\" a Sebi release said.With this move, the market watchdog aims to streamline investment operations and enhance capital formation in unlisted companies.In market parlance, ‘Co-investment’ refers to investment made by a manager or sponsor of the AIF or by investor of Category I and II AIFs in unlisted investee companies where such Category I or Category II AIF(s) invests.The decision was taken in Sebi's 210th board meeting held yesterday.For instance, a scheme of an AIF is investing in a company for Rs 100 crore on behalf of investors in the pool, as part of the scheme’s portfolio. If the need of the company is Rs 300 crore, the manager of the AIF, may offer this additional investment opportunity to any investor of the scheme of AIF who may want to invest in addition to their investment through the AIF.Also Read: Sebi board meeting: Regulator approves PSU delisting, IPO reforms, dematerialisation of Securities. 10 key takeaways Until now, such co-investments had to be routed through the Portfolio Management Services (PMS) framework. This required managers to register under both AIF and PMS regimes, creating compliance and operational hurdles. The new framework removes this dual-regulation burden.A unique CIV scheme will be created for every co-investment opportunity, with safeguards to ensure it's used for legitimate purposes and to prevent misuse.Certain compliance requirements that apply to standard AIF schemes will be relaxed for CIVs to ensure operational ease without compromising oversight.The initiative will enable large, flexible capital flows to promising unlisted ventures, benefiting both investors and early-stage companies.The move has been backed by public and industry consultation as the reforms follow the May 2025 public consultation paper, which received broad support from stakeholders. SEBI also factored in inputs from the Alternative Investment Policy Advisory Committee.This move is expected to deepen the Indian startup investment ecosystem by offering investors direct, transparent co-investment paths while enabling AIFs to efficiently structure large funding rounds.Also Read: Sebi board meeting: Regulator eases IPO rules for start-up founders, mandates dematerialisation of securities",
        "scraped_at": "2025-06-19T19:00:32.629328"
    },
    {
        "title": "HDB Financial's Rs 12,500 crore IPO to open on June 25, price band announcement later",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/hdb-financial-services-ipo-to-open-on-june-25-report/articleshow/121952286.cms",
        "published": "Thu, 19 Jun 2025 15:55:28 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe much-awaited Rs 12,500 crore IPO of HDB Financial Services, a non-banking financial company backed by HDFC Bank , will open for subscription on June 25. The issue will be available for subscription till June 27.This will be the largest offer since Hyundai Motor India ’s Rs 27,000 crore issue last year and the biggest for the current calendar. The listing will also mark the entry of another major HDFC Group entity into the public markets, following HDFC Bank and the now-merged HDFC.The offer includes reservation of subscription for employees and also eligible HDFC Bank shareholders.HDFC Bank currently owns 94.6% of HDB Financial and will dilute a significant portion of its stake through this offering, as part of broader regulatory and capital optimization objectives.The IPO will consist of Rs 10,000 crore OFS from parent HDFC Bank and a fresh equity sale of Rs 2,500 crore. The price band will be announced soon.HDB Financial Services is a leading non-banking financial company (NBFC), catering to both retail and commercial borrowers. It offers secured and unsecured loans, including personal loans, business loans, vehicle loans, gold loans, and loans against property. The company has built a strong presence across India, particularly in the affordable credit segment for individuals and small businesses.The proceeds from the fresh issue are expected to be used to bolster the company’s capital adequacy and support future lending growth, especially in semi-urban and rural areas.Analysts note that the IPO comes at a time when investor sentiment is upbeat and the primary market is seeing strong activity. The broader Nifty 50 index has rebounded sharply since March, and liquidity remains ample following the Reserve Bank of India’s recent policy stance.HDB Financial’s IPO will be closely watched by institutional and retail investors alike, given its brand backing, scale, and long-term growth potential.",
        "scraped_at": "2025-06-19T19:00:33.409128"
    },
    {
        "title": "Ashish Kacholia-backed smallcap stock jumps 18% on heavy trade volumes. Do you own?",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-smallcap-stock-jumps-18-on-heavy-trade-volumes-do-you-own/articleshow/121952210.cms",
        "published": "Thu, 19 Jun 2025 15:52:14 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Bullish technical setup\n\nLive Events\n\nCapacity expansion, new products add to backdrop\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Aeroflex Industries climbed as much as 17.9% on Thursday to Rs 206.10 on the BSE, as heavy volumes and strong technical momentum powered a sharp rally in the smallcap stock backed by veteran investor Ashish Kacholia More than 571.96 lakh shares of the company changed hands on the NSE alone during the session, far above recent averages.As of the March 2025 quarter, Kacholia held a 1.92% stake in Aeroflex Industries, up from 1.8% in the December quarter.Over the past one month, the stock has rallied 21.2%, and it is up 17% just in the last week. In the last three months, the gain stands at nearly 19%, while the one-year return is 34.4%. However, over a six-month horizon, the stock remains down by 3.3%.The rally on Thursday was supported by strong technical indicators. Aeroflex Industries is currently trading above all eight of its key simple moving averages, from the 5-day to the 200-day, a signal of strength across short-term to long-term charts.The Relative Strength Index (RSI) is at 59.7, placing the stock in neutral territory and indicating that the current move is not yet overextended. Meanwhile, the Moving Average Convergence Divergence (MACD) remains positive at 0.9 and above both the center and signal lines, reinforcing bullish undertones.While Thursday’s move appeared to be driven primarily by market action, recent developments have helped strengthen the company’s fundamental narrative. In January 2025, Aeroflex began commercial production of a new product, Metal Bellows, with an annual capacity of 1,20,000 pieces.The company also expanded its manufacturing capacity from 15 million meters to 16.5 million meters a year, and doubled its Composite Hose production lines from three to six.With momentum picking up, and a prominent investor on board, Aeroflex Industries is firmly on the market’s radar.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
        "scraped_at": "2025-06-19T19:00:34.294842"
    },
    {
        "title": "Market Wrap: D-Street slips as hawkish Fed, Middle East tensions drag; Sensex down 83 pts, Nifty below 24,800",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-slips-as-hawkish-fed-middle-east-tensions-drag-sensex-down-83-pts-nifty-below-24800/articleshow/121952068.cms",
        "published": "Thu, 19 Jun 2025 15:48:40 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Sector Watch\n\nLive Events\n\nExpert Views\n\nGlobal Markets\n\nCrude Impact\n\nRupee vs Dollar\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndian benchmark indices Sensex and Nifty closed lower on Thursday, dragged down by IT and financial stocks, as hawkish signals from the U.S. Federal Reserve and persistent Middle East tensions weighed on sentiment. Heavy selling was seen across midcap and smallcap stocks, reflecting broad-based weakness in the market.The BSE Sensex shed 82.79 points, or 0.1%, to close at 81,361.87, while the NSE Nifty declined 18.8 points, or 0.08%, to settle at 24,793.25.The market capitalization of all listed companies on the BSE shrank by Rs 4.64 lakh crore to Rs 442.55 lakh crore.On the 30-share Sensex pack, Adani Ports Nestle India , and Tata Steel led the laggards, shedding between 1% and 2.5%.The Nifty Financial Services index slipped 0.4%, dragged down by modest losses in heavyweights ICICI Bank and Axis Bank , which fell 0.2% and 0.4%, respectively.IT stocks, which derive a large share of their revenue from the U.S., dropped 0.9%. HCL Tech , Tech Mahindra, Coforge Oracle Financial Services , and Infosys declined between 0.5% and 3.4%.In contrast, the Nifty Auto index bucked the trend to end 0.5% higher, supported by gains in Mahindra & Mahindra after it secured antitrust clearance for its proposed acquisition of SML Isuzu Broader markets underperformed, with the Nifty Smallcap 100 and Nifty Midcap 100 indices falling 2% and 1.6%, respectively.The Indian equity index experienced rangebound movement with a negative bias as cautious sentiment spread across the globe, driven by concerns over potential U.S. involvement in the Middle East conflict, said Vinod Nair, Head of Research, Geojit Investments, adding that investor mood was further affected by the Fed's decision to keep interest rates unchanged while signalling persistent inflation and slower economic growth, which weighed on software export stocks.\"Broader market performance lagged the benchmark index, influenced by selling in mid-caps & small-caps, while better stability was noticed in large-cap growth stocks, keeping a close watch on crude oil prices and global developments,\" said Nair.The Nifty witnessed a lackluster expiry on the NSE, as the index remained within a narrow range throughout the session, indicating indecisiveness ahead of any directional move, said Rupak De, Senior Technical Analyst at LKP Securities, adding that \"on the hourly chart, the index continues to trade below the 200-DMA, reflecting weak market sentiment.\"\"On the daily chart, it has slipped below the 21-EMA, further reinforcing the bearish outlook. This negative sentiment is likely to persist as long as the index remains below 24,850. On the downside, support is seen at 24,550,\" said De.World equities fell on Thursday as investors fled riskier assets in favour of safe havens amid fears of U.S. involvement in the escalating Israel-Iran conflict.On the seventh day of hostilities sparked by Israeli airstrikes on Iranian military and nuclear-linked targets, Tehran’s state media reported that its foreign minister was set to meet European counterparts in Geneva. Meanwhile, Israel reportedly struck Iran’s Arak heavy water reactor in its latest move against the country’s nuclear program. The intensifying conflict has rattled global markets.In the Asian markets, Japan’s Nikkei 225 lost 1%, the Hang Seng dropped 2% amid tech-led selling, and the Shanghai Composite slipped 0.8%.European markets mirrored the slide. France’s CAC 40 dropped 0.8%, Germany’s DAX fell 0.9%, and the UK’s FTSE 100 declined 0.5%. U.S. stock futures also pointed to a weak open, with the S&P 500 and Dow Jones Industrial Average contracts both down 0.4%.The U.S. Federal Reserve held interest rates steady on Wednesday but maintained its forecast for two rate cuts this year. Policymakers flagged concerns over inflation risks, partly linked to higher import tariffs under President Donald Trump, and projected slower growth and a slight rise in unemployment.The Bank of England was also expected to keep rates unchanged at 4.25% at its meeting Thursday, following two cuts earlier this year.Oil prices edged higher on Thursday as escalating hostilities between Israel and Iran, along with heightened geopolitical uncertainty fuelled by U.S. President Donald Trump's stance on the conflict, kept investors wary.Brent crude futures rose 36 cents, or 0.5%, to $77.06 a barrel by 0913 GMT, while U.S. West Texas Intermediate (WTI) crude for July delivery gained 54 cents, or 0.7%, to $75.68.Brent had briefly spiked to a near five-month high of $78.50 on June 13, when Israel launched its initial airstrikes. The conflict entered its seventh day on Thursday, following Israeli strikes on a key Iranian nuclear facility and retaliatory Iranian missile attacks that hit an Israeli hospital.Crude prices have surged 11% over the past week, as the threat of supply disruptions from the Middle East continues to fuel market anxiety.The Indian rupee weakened to its lowest level since mid-March on Thursday, slipping 0.3% to close at 86.7225 against the U.S. dollar, as rising risk aversion amid fears of U.S. involvement in the Israel-Iran conflict weighed on investor sentiment. The currency had earlier touched an intraday low of 86.8925.Meanwhile, the dollar index edged up 0.02% to 98.92, supported by safe-haven demand. However, gains remained limited as investors weighed the Fed’s cautious stance and lack of decisive action.(with inputs from agencies)",
        "scraped_at": "2025-06-19T19:00:34.914583"
    },
    {
        "title": "Rupee hits 3-month low on worries over US role in Middle East conflict",
        "url": "https://economictimes.indiatimes.com/markets/forex/rupee-hits-3-month-low-on-worries-over-us-role-in-middle-east-conflict/articleshow/121952027.cms",
        "published": "Thu, 19 Jun 2025 15:44:03 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Indian rupee fell to its weakest level since mid-March on Thursday as risk aversion gripped financial markets, with investors focused on the possibility of U.S. involvement in the Israel-Iran conflict.The rupee touched a low of 86.8925 on the day before slightly paring losses to close at 86.7225 against the U.S. dollar, down 0.3% on the day. Brent crude oil prices rose to near $77 per barrel after Israel struck a key Iranian nuclear site on Thursday and Iranian missiles hit an Israeli hospital.Risk assets remained under pressure, reflecting investor worries about a broader conflict in the Middle East after U.S. President Donald Trump kept the world guessing about whether the country would join Israel's bombardment of Iranian nuclear sites.ANZ believes the most likely scenario is an extended conflict between Iran and Israel, which would see oil supplies come under direct threat, the firm said in a Thursday note.\"The price outcome for this scenario would be the USD75-85/bbl range,\" while an escalation of the conflict, pegged at 20% probability, could push prices to $90-95 per barrel.Oil is a major component of India's import bill. A $10 barrel increase in crude can widen the current account deficit by up to 0.4% of GDP, economists estimate.Indian government bond yields rose on Thursday as traders squared off positions, fearing further escalation of geopolitical tensions . The country's benchmark equity index, Nifty 50 , dipped 0.1%.Meanwhile, mild dollar sales from state-run banks helped the rupee limit its losses, three traders said. The currency has declined little under 1% this week so far.The rupee could find some support near the psychologically important 87 level and is likely to trade with a weakening bias in the near term, a trader at a foreign bank said.",
        "scraped_at": "2025-06-19T19:00:35.678235"
    },
    {
        "title": "Rich Dad, Poor Dad author Kiyosaki slams false prophets on YouTube, claims he saw 2025 crash coming years ago",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/rich-dad-poor-dad-author-kiyosaki-slams-false-prophets-on-youtube-claims-he-saw-2025-crash-coming-years-ago/articleshow/121951821.cms",
        "published": "Thu, 19 Jun 2025 15:42:54 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:36.518179"
    },
    {
        "title": "Bitcoin holds above $104k as Fed signals hawkish pause; Altcoins trade mixed",
        "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/bitcoin-holds-above-104k-as-fed-signals-hawkish-pause-altcoins-trade-mixed/articleshow/121951668.cms",
        "published": "Thu, 19 Jun 2025 15:31:09 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nCryptocurrencies traded with a slight negative bias on Thursday, as investors weighed the US Federal Reserve’s latest interest rate decision and ongoing geopolitical tensions As of 1:26 pm IST, Bitcoin was down 0.26% at $104,704, while Ethereum slipped 0.45% to $2,521. The global crypto market capitalisation declined by 0.3% to $3.25 trillion, according to CoinMarketCap Among altcoins , BNB dropped 1%, Solana 1.7%, Dogecoin 0.6%, Cardano 2.6%, Hyperliquid 6%, Sui 2%, and Avalanche 4%. Tron rose 1%, Chainlink gained 0.5%, Uniswap added 3.5%, Pepe advanced 1%, while OKB jumped 7%.“Bitcoin is trading in a narrow range between $103,400 and $105,500 after the Fed held rates unchanged at 4.25%–4.50%, maintaining a hawkish tone due to inflation concerns,” said Edul Patel, Co-founder and CEO of Mudrex.He added that Bitcoin continues to hold key support levels despite macroeconomic and geopolitical headwinds. “Notably, Bitcoin ETFs have recorded eight straight days of inflows totalling over $2.2 billion, indicating strong institutional demand. If this momentum continues, Bitcoin could soon test the resistance at $106,500, while support is seen around $103,000.”Also Read: Will Bitcoin hit $1 million by 2030? 'Rich Dad Poor Dad' author Robert Kiyosaki thinks so Vikram Subburaj, CEO of Giottus, noted that while crypto markets reacted mildly to the Fed’s decision, Bitcoin’s tight price structure points to an imminent breakout.“Ask-side liquidity is clustering above $106,000, with nearly $70 million in orders stacked around $106,500. A breakout past this level could trigger a short squeeze, targeting the $109,000–$110,000 zone. Recent bid absorption at $105,000 indicates bulls are still defending this level effectively,” he said.According to Riya Sehgal, Research Analyst at Delta Exchange, Ethereum continues to trade below key resistance and lacks near-term momentum. “ETH is struggling below the $2,600 mark, with resistance in the $2,575–$2,625 zone. Trading below the 100-hour simple moving average, Ethereum risks a drop toward $2,320 if support fails.”On Bitcoin’s outlook, she noted that the price is consolidating between $104,200 and $105,600, with resistance around $105,500. “A breakout above $106,150 could push BTC toward the $108,800–$110,000 zone. However, the current structure of lower highs suggests bounce momentum is weak,” she added.Despite recent volatility, some analysts believe the market is stabilising.“After a turbulent week, Bitcoin is holding firm above $100,000, showing resilience and forming a solid support base,” said Avinash Shekhar, Co-founder and CEO of Pi42. “Ethereum has outperformed Bitcoin in the current geopolitical climate, fuelling early chatter of a potential altseason.”He added that Dogecoin is mirroring past bullish setups last seen in 2020, which preceded strong rallies. “The Fed’s decision to keep rates unchanged has helped calm market nerves. While questions remain about whether Bitcoin has peaked in this cycle, its ability to absorb volatility and defend key levels suggests that bullish sentiment, although cautious, still persists.”(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
        "scraped_at": "2025-06-19T19:00:37.081818"
    },
    {
        "title": "Ambanis bag top 3 spots in India’s under-40 wealth icons, Nikhil Kamath among top 10. Check full list - India’s Under-40 Icons",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/ambanis-bag-top-3-spots-in-indias-under-40-wealth-icons-nikhil-kamath-among-top-10-check-full-list/slideshow/121952157.cms",
        "published": "Thu, 19 Jun 2025 15:28:48 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "India is witnessing a dynamic shift in its wealth landscape, led by a new generation of under-40 wealth creators. According to the inaugural ‘360 ONE Wealth Creators List’ launched by 360 ONE Wealth (WAM) in collaboration with CRISIL, over 2,000 Indian individuals have amassed wealth worth nearly Rs 100 trillion. These young business leaders are reshaping industries with their innovation and enterprise.\n\n\n\nThis new generation of leaders remains actively involved in their businesses, with a significant share of their wealth tied to publicly listed companies. India has 143 active wealth creators under the age of 40, many of whom are pioneering digital-first business models. A majority of India’s first-generation entrepreneurs under the age of 40 have attained wealth by leveraging the digital economy to disrupt traditional business models. Here are the top 10 under-40 icons of India.",
        "scraped_at": "2025-06-19T19:00:37.545460"
    },
    {
        "title": "Swiggy shares rally 8% in 2 days; IIFL sees 46% upside potential",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-rally-8-in-2-days-iifl-sees-46-upside-potential/articleshow/121951363.cms",
        "published": "Thu, 19 Jun 2025 15:21:31 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nQuick commerce in focus\n\nTechnicals turn bullish\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of India’s second-largest foodtech platform Swiggy , climbed as much as 5.1% on Thursday to Rs 383.80 on the BSE, extending their two-day rally to 7.9% after brokerage firm IIFL Capital initiated coverage with a bullish outlook, citing strong growth prospects in both food delivery and quick commerce IIFL Capital launched coverage on Swiggy with a ‘buy’ rating and a target price of Rs 535, a 46% upside from Wednesday’s closing price. The brokerage highlighted “improving execution, strong positioning in food delivery, and underappreciated potential in quick commerce” as key drivers of future gains.Swiggy, which has seen its market share dip in recent quarters, is forecasted to deliver a 28% compound annual revenue growth rate between FY25 and FY28, and turn Ebitda-profitable by FY27, IIFL said.While acknowledging Swiggy lags behind market leader Zomato (now Eternal) by 7–8 quarters in both gross order value and Ebitda margins, the brokerage said this is due to slower execution in the past rather than a competitive disadvantage.“Swiggy’s market share shrunk from 46.5% in FY22 to 42.4% in 1QFY25. We believe this was largely on account of execution issues rather than any competitive disadvantage,” IIFL added.Swiggy has begun regaining lost ground through improved execution and initiatives such as Bolt, its 10-minute delivery service, which now contributes 12% of order volumes. The platform is estimated to hold a 43% share in India’s food delivery market, which IIFL expects to remain a stable duopoly.IIFL projects the food delivery vertical to grow at 18% CAGR over FY25–28, with Adjusted Ebitda margins expanding to 20% by FY28. Swiggy’s contribution margin has already risen from 7.1% of gross order value (GOV) in FY25 to 7.8% in the March quarter, aided by better monetisation, higher ad revenues, and cost optimisation.“We expect Ebitda margins approaching ~5% of GOV by FY28 and stabilising at those levels in the long term,” IIFL said.Swiggy’s food delivery business has been valued at $8.5 billion by the brokerage. Given its market capitalisation of $10.3 billion, that implies the remaining value assigned to its quick commerce (QC) and other businesses is just $1.8 billion, an “88% discount to Blinkit despite being only about half its size,” IIFL noted. The brokerage said this valuation gap offers “meaningful re-rating potential” if Swiggy executes well in QC.Thursday’s gain extended Swiggy’s one-month rally to 19%, with the stock up 7.5% over the past week and 7.5% in the last three months, though still down 33.7% over the past six months.From a technical standpoint, Swiggy is trading above all its key simple moving averages (5-day, 10-day, 20-day, 30-day, 50-day, and 100-day), signalling bullish momentum. The Relative Strength Index (RSI) stands at 62.4, below the overbought threshold of 70. Meanwhile, the MACD is at 9.1 and remains above both its centre and signal lines, a positive sign for the stock.IIFL flagged heightened competition and regulatory uncertainty as key risks to its investment thesis, but maintained a confident tone on Swiggy’s long-term potential: “The stock currently trades at 4.1x FY26 estimated EV/Sales, well below Indian internet peers,” the brokerage said, adding that it expects this discount to narrow as Swiggy scales profitably across verticals.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
        "scraped_at": "2025-06-19T19:00:38.299072"
    },
    {
        "title": "Oswal Pumps IPO: Shares to list tomorrow, GMP at 8.5% ahead of listing. Here’s what to expect",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/oswal-pumps-ipo-shares-to-list-tomorrow-gmp-at-8-5-ahead-of-listing-heres-what-to-expect/articleshow/121951057.cms",
        "published": "Thu, 19 Jun 2025 15:05:12 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "What analysts say about Oswal Pumps IPO?\n\n\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nOswal Pumps shares are set to list on Friday following strong demand, with the IPO subscribed 14.19 times. In the grey market, the stock is trading at a premium of 8.5% or Rs 52–54, indicating potential listing gains However, investors should note that the grey market premium (GMP) is not a guaranteed indicator of the stock’s actual listing performance.At the end of the bidding process, the qualified institutional buyers’ (QIB) category led with a 23.95× subscription, followed closely by non-institutional investors at 27.93×.Retail investors showed decent interest at 2.72×, while anchor investors had fully subscribed to their allocated quota on Day 1.“The IPO received bids for over 22.4 crore shares against an offer of 1.58 crore shares, translating to a total demand of approximately ₹13,778 crore, reflecting strong investor confidence and robust market appetite,” noted Gaurav Garg of Lemonn Markets Desk.“We believe the IPO offers attractive entry for medium- to long-term investors seeking exposure to the confluence of agri-infrastructure and clean energy,” he added.Further, Prashanth Tapse, Senior VP (Research) at Mehta Equities, noted, “Despite prevailing market volatility, the mainboard IPO of Oswal Pumps received a robust response from investors, getting oversubscribed by over 34 times, with particularly strong interest from Qualified Institutional Buyers (QIBs) and Non-Institutional Investors (NIIs).”He said that the response reflects strong institutional confidence in the company’s fundamentals and long-term growth trajectory, even amid near-term market uncertainty.“We believe this overwhelming demand was driven by attractive valuation levels, offering reasonable long-term upside potential along with a well-diversified product portfolio across agriculture, industrial, and domestic water solutions. We also see the company’s strategic positioning to benefit from ongoing government infrastructure and rural development initiatives, especially those focused on water management and irrigation,” Tapse added.Given the strong subscription demand and ongoing market sentiment, Tapse anticipates a decent listing gain in the range of 10–15% for Oswal Pumps' debut.He also views Oswal Pumps as a compelling long-term investment opportunity, well-aligned with the government’s continued emphasis on rural electrification and promotion of solar-powered irrigation systems.“For Allotted investors: We advise a HOLD for the long term, as the company is well-positioned to benefit from structural growth drivers in the agri and infrastructure sectors,” Tapse said.The IPO saw significant oversubscription, reflecting confidence in the company’s fundamentals and valuation. With the allotment already out, investors will eye the stock’s debut on the bourses tomorrow.The shares of Oswal Pumps are scheduled to be listed on NSE and BSE.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:39.005363"
    },
    {
        "title": "Israel’s TA-35 hits 52-week high as markets brush off Iran’s attack on stock exchange",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/israels-ta-35-hits-52-week-high-as-markets-brush-off-irans-attack-on-stock-exchange/articleshow/121950809.cms",
        "published": "Thu, 19 Jun 2025 14:57:07 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIran's missile attack on the Tel Aviv Stock Exchange building failed to deter the bulls as the frontline index TA-35 hit a fresh 52-week high of 2,811.70 on Thursday, rising by 0.20% over the previous closing.Around 2 pm India time (11:24 am GMT+3 Israel time), the TA-35 index was trading at 2,810.45, up by 0.18% with 18 gainers and 17 declines in the 35-stock index.Companies in the defence industry, such as Elbit Systems , were trading with cuts. This stock was down 1.7% around 1:30 pm India time.The top gainers were Ormat Techno Enlight Energy , Navitas PTRO PU, HAREL and Phoenix, which were up by up to 3%, while the top decliners were NICE, Elbit Systems, Camtek, Melirson and Israel Corp, which fell up to 3%The index has rallied 17% in 2025 while its month-to-date gains stand at 4%.The Middle East crisis has just gotten worse with the Iranian missiles striking the stock exchange building and other targets across Israel. The building has been 'extensively damaged' after Iran fired dozens of ballistic missiles.The strike comes after the Iranian missiles damaged the main hospital in southern Israel. Furthermore, Israel's Magen David Adom rescue service said Thursday that at least 32 people were injured following Iran's latest missile strikes.With the air strikes between Iran and Israel entering their seventh consecutive day, Israel's Prime Minister Benjamin Netanyahu on Thursday accused Iran’s leadership of launching missile attacks on Israeli civilian targets, including a hospital.“This morning, Iran's terrorist tyrants launched missiles at Soroka Hospital in Beersheba and at a civilian population in the centre of the country,” Netanyahu wrote in a post on the social media platform X.. “We will exact the full price from the tyrants in Tehran.”Meanwhile, major Asian indices were trading mixed, with India's frontline indices trading slightly down. The Nifty index was trading at 24,793.30, 18.75 points or 0.08% lower. Hong Kong's Hang Seng index and Singapore's FTSE Straits Times Index were down 1% and 0.7%, respectively, while Japan's Nikkei 225 was up 1% and China's Shanghai Composite index was trading flat, albeit with a positive bias.",
        "scraped_at": "2025-06-19T19:00:39.769615"
    },
    {
        "title": "India's Larsen & Toubro may explore another ESG bond issue after debut attracts premium, spokesperson says",
        "url": "https://economictimes.indiatimes.com/markets/bonds/indias-larsen-toubro-may-explore-another-esg-bond-issue-after-debut-attracts-premium-spokesperson-says/articleshow/121950505.cms",
        "published": "Thu, 19 Jun 2025 14:39:27 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:40.381724"
    },
    {
        "title": "NaBFID plans debut overseas fund raise of up to $1 billion, official says",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-plans-debut-overseas-fund-raise-of-up-to-1-billion-official-says/articleshow/121950357.cms",
        "published": "Thu, 19 Jun 2025 14:28:29 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndia's National Bank for Financing Infrastructure and Development is considering raising up to $1 billion in its debut overseas borrowing this fiscal year, as it looks to diversify funding sources, a senior official said on Thursday.The state-run infrastructure lender could raise funds through external commercial borrowings or dollar bonds, \"depending on interest rate conditions\", Managing Director Rajkiran Rai G said in an interview.\"We are looking to tap the overseas market... for the first time in FY26 simply to expand our borrowing sources.\"Indian Prime Minister Narendra Modi-led government has made infrastructure a cornerstone of its economic strategy.Mumbai-based NaBFID, which started operations in fiscal year 2023, had sanctioned loans worth over 2 trillion rupees through March-end, and aims for loan sanctions of 1.2 trillion rupees by the end of this fiscal year, Rai said.The lender funds infrastructure projects for long durations, with over 65%-70% of loans exceeding 15 years.The firm, which lends at floating rates but borrows at fixed rates, has hedged about 70% of its bond borrowing using interest rate derivatives, Rai said.Derivatives are primarily available for tenures of up to 10 years, limiting the feasibility of the firm issuing so-called ultra-long-term bonds, the official said.NaBFID has borrowed around 80 billion rupees in the local bond market so far this fiscal and plans to raise another 350 billion rupees to 400 billion rupees before the fiscal year ends in March, according to Rai.Last fiscal, the firm borrowed 169 billion rupees through bonds, as per Reuters data.NaBFID is working with multilateral institutions like the World Bank and Asian Development Bank to develop tools like credit enhancement for infrastructure bonds, Rai said. ($1 = 86.5040 Indian rupees)",
        "scraped_at": "2025-06-19T19:00:41.102240"
    },
    {
        "title": "Think Beyond PE: Hiren Ved advocates PEG Ratio for smarter valuation assessment",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/think-beyond-pe-hiren-ved-advocates-peg-ratio-for-smarter-valuation-assessment/articleshow/121950090.cms",
        "published": "Thu, 19 Jun 2025 14:23:02 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n\"But if you look at the last three, four, five years, they have not really delivered the kind of returns. The capital market plays have done far better and that is where we are invested frankly,\" says Hiren Ved , Director & CIO, Alchemy Capital.So, again, I mean, this debate has been around for a long time that the large private sector financials is where the value is or where the valuations are reasonable, which is true. But it really depends on in your mix of portfolio what is the average growth that you are looking at. If you look at the latest numbers, credit growth has slowed down to like 9%.So, maybe the efficient private sector companies can grow at 12-13%. But our sense is that while the RBI has given them the ability to fight off a reduction in NIMs because of the CRR cut, but unlikely that unless credit growth picks up in any meaningful manner, that we could see early teens kind of growth in earnings there.On the other hand, if you look at the capital market plays, there is a structural story there and those have actually done far better than the big private banks.So, our sense is that there is this bias that we have because there was such a large weight in the index and therefore these big banks keep looking cheaper to us.But if you look at the last three, four, five years, they have not really delivered the kind of returns. The capital market plays have done far better and that is where we are invested frankly.The right way to look at it in terms of valuation is to not just look at absolute PE, but to look at PEG. So, if earnings are growing at 50% or 30% and then if you end up paying 30 times, you are still okay versus paying 18 and 20 times for 10% or even lower growth. I mean, if you look at it, Nifty trades at what 23, 22 times one year forward, but Nifty earnings growth is 10% or lower. So, what peg are you paying for the Nifty.Correct, and actually that is exactly what we saw in Jan-Feb which is that the largest correction happened in areas where the participation was the highest and also those were the companies that were growing. So, there was a wave of whatever you call it, profit booking, precautionary money taking off the table, taking some risk off the table and when we were looking at it, the next 50 index corrected much more sharply than the Nifty 50 because that is where the money was made and that is where the earnings growth was, so that is where everybody had their exposure and that is where the exposure came off significantly.So, I think that from here on given the broad valuations, we should have reasonable expectations of returns. And we are very clear that money is to be made in the broader markets.Probably barring Bajaj Finance in the top Nifty 50 and maybe companies like Trent and a few handful of ones which can still talk about compounding profits at 20-25% plus, everything else is in single digits or early teens. So, we have to moderate our expectations of growth. If we want to have lower risks, then you have to moderate your return expectation as well. And if you want higher returns, then obviously we will have to pay up for the growth that we have, so that is where we are in the markets today.Yes, I mean, I still feel that while valuations are expensive, but there is a structural growth in those. So, whether it is asset managers, wealth managers, exchanges, I still feel that there is money to be made there. So, to answer your question would you still deploy fresh money? The answer is yes, I would.So, I agree with you. I think EMS is a great growth opportunity still. We are in the early stages of a growth cycle. Probably with the exception of Dixon which is just about going to reach one lakh crore of market cap, a sector which is so large and the opportunity which is so big, I think you will see the birth of many large companies there. And yes, the valuations are quite punchy, but you will have to, therefore, elongate your time horizon for investing.Having said that, we have to be careful because a lot of the growth is in the price and valuations. So, unless you are really willing to bet for the next three to five years and wait for that growth to unfold, there could be intermittent quarters where the numbers may or may not pan out to be good and you could have a very significant draw down in these kind names. But on a structural basis, I still believe there is money to be made. It is a young sector in India relatively.",
        "scraped_at": "2025-06-19T19:00:41.780078"
    },
    {
        "title": "These 9 Nifty Microcap Index stocks trading below industry PE may rally up to 42% - Room to Run",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-nifty-microcap-index-stocks-trading-below-industry-pe-may-rally-up-to-42/slideshow/121950337.cms",
        "published": "Thu, 19 Jun 2025 14:20:25 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Low price-to-earnings (PE) ratio stocks are often viewed as value picks for long-term investors. According to data from Trendlyne, several Nifty Microcap 250 index stocks—including Gulf Oil Lubricants, Karnataka Bank, DCB Bank, and Shriram Pistons—are currently trading at valuations lower than their respective industry averages. Despite operating across diverse sectors, these stocks have the potential to deliver returns of up to 42%.\n\n",
        "scraped_at": "2025-06-19T19:00:42.585449"
    },
    {
        "title": "If West Asia conflict spreads and oil pips $80, it will upset the apple cart for Indian & Asian equities: David Chao",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/if-west-asia-conflict-spreads-and-oil-pips-80-it-will-upset-the-apple-cart-for-indian-asian-equities-david-chao/articleshow/121949905.cms",
        "published": "Thu, 19 Jun 2025 14:10:08 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nYou Might Also Like: Markets in a sideways zone and looking at West Asia development, tariff deadline: Dipan Mehta\n\nYou Might Also Like: Long-term, India is the best story in the making: Anshul Saigal\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n, Global Market Strategist,, says investors are heavily invested in US equities and the US dollar. There are better prospects in European equities and Asian credit . Fiscal and monetary stimulus in Europe, especially in Germany and the UK, should boost the equity market. Asian markets, particularly India, look promising if the US dollar weakens and oil prices stay low.Certainly there was no surprise over the outcome of the FOMC meeting yesterday. The Fed's characterisation of the US economy remains roughly what it was six weeks ago, that the US economy is sound, but there are still concerns over what the tariffs may bring. Back in 2018, during the first tariff war, we did not really see any price level or inflationary impacts from the tariffs and that was because companies absorbed many of the tariffs instead of raising prices. But they also laid off some of their employees. So, the big question this time around as the tariffs continue to work their way through the system is, are consumers going to bear the brunt of it or will the suppliers and the stores do so?Well, I think the equity market has retraced a lot of what it has lost since the Liberation Day and it reflects a continued risk-on sentiment. Now, the bond markets are a lot more wary of both the fiscal situation in the US and also the potential stagflationary winds that the US economy is facing. But we have just come out with our mid-year outlook and we are calling for diversification. We think that investors are overly exposed, overly concentrated in certain assets like the US equity market or even US dollar and we think brighter opportunities currently exist in European equities or in Asian credit.In Europe we continue to have greater fiscal stimulus in places like Germany, the UK, and also monetary stimulus. The ECB has recently cut rates. This further liquidity should boost the equity market. The defence spending addition that Germany has announced is likely to flow down to factories and materials, construction, and infrastructure. We broadly like European equities at these levels.In Asia, the only times that emerging markets have outperformed developed markets over the past 10-15 years has been when the US dollar is weakening, local central banks are cutting rates and oil is below $80 a barrel. So, it makes a good case for investors to stay invested in India. If the West Asia conflict spreads to a wider region and oil goes above $80 that could certainly upset the apple cart for Indian equities and for Asian equities.It means diversifying away from being overly concentrated and we know that foreign investors have been overly concentrated in US equities. The market cap concentration that US stocks have for MSCI Global Index is around 70-80%. The US economy is only around 20% of the global economy. I think reducing concentration, and looking at other places makes sense. I am not saying investors should be selling the US or that US assets are becoming less attractive, I just think that a broader diversification in one's asset allocation is a prudent measure, especially in these times of uncertainty.I think investors are a little too sanguine regarding the tariffs. I do not think that we are out of the woods yet on the tariffs. We were supposed to get a deal announced every single day during these 90-day reprieves. We only got three. It is unlikely that most countries will be able to sign deals before the deadline next month and that could mean more negative tariff headlines. But ultimately, I just want to remind everyone that tariffs are a near-term overhang that we are likely to move through later on in this year. That is when investors will start to focus on fundamentals, on growth, on corporate earnings. There are many bright spots in China, AI or Indian equities or European defence companies, or Asian credit, there are bright opportunities to be had.",
        "scraped_at": "2025-06-19T19:00:43.303586"
    },
    {
        "title": "IPO market gears up for busy week with Rs 15,000 crore worth of offerings",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/ipo-market-set-for-busy-week-with-rs-15000-crore-in-deals/articleshow/121949662.cms",
        "published": "Thu, 19 Jun 2025 13:57:37 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndia's IPO market is set for a busy spell next week, with four companies — Globe Civil Projects, HDB Financial Services, Ellenbarrie Industrial Gases, and Kalpataru — looking to raise a combined Rs 15,000 crore from the public markets.The rush follows a rebound in investor sentiment, driven by a 12% rally in the Nifty 50 index since March and supportive liquidity measures from the Reserve Bank of India, including a surprise 50-basis-point rate cut.Leading the pack is HDB Financial Services, a non-banking financial company backed by HDFC Bank . It is expected to launch its IPO next week, marking the largest offer since Hyundai Motor India’s Rs 27,000 crore issue last year.HDFC Bank, which holds a 94.6% stake in HDB, is expected to offload Rs 10,000 crore worth of shares in the offering. The IPO-bound NBFC provides a range of retail and commercial lending products, including loans against property, consumer credit, and asset financing. Its large distribution network and diversified product suite make it a key player in India’s financial services space.Industrial gas producer Ellenbarrie is also planning to tap the market with an Rs 852 crore IPO. The offer comprises a fresh issue of Rs 400 crore and an offer-for-sale of 1.13 crore shares by promoters Padam Kumar Agarwala and Varun Agarwal.Proceeds from the new issue will be used to repay debt, invest in a new air separation unit at its Uluberia plant, and for general corporate needs. The price band is fixed at Rs 380 to Rs 400 per share.Meanwhile, Mumbai-based real estate developer Kalpataru is seeking to raise Rs 1,590 crore through its initial public offering (IPO), which opens on June 24 and closes on June 26. Known for its residential and commercial projects across key Indian cities, Kalpataru’s IPO is priced in the range of Rs 387 to Rs 414 per share.The company is part of the broader Kalpataru Group, which includes infrastructure and logistics businesses.Also launching on June 24 is the IPO of Globe Civil Projects, a construction and infrastructure company. The price band is set at Rs 67 to Rs 71 per share, with allotment expected on June 27 and listing on July 1.With these four offerings hitting the market in quick succession, investor participation and listing performance will be closely watched as a signal of renewed momentum in India’s primary markets.",
        "scraped_at": "2025-06-19T19:00:44.128168"
    },
    {
        "title": "Hemang Jani’s Stock Picks: Positive on Vedanta, cautious on Jio Fin & Vodafone Idea - Market Structure & Triggers",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/hemang-janis-stock-picks-positive-on-vedanta-cautious-on-jio-fin-amp-vodafone-idea/slideshow/121949956.cms",
        "published": "Thu, 19 Jun 2025 13:46:00 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "According to Jani, the market is currently in a clear phase of sector rotation. Banking and NBFCs had been leading the rally but have taken a breather following the RBI’s policy decision. He remains optimistic about select discretionary and retail sectors in the near term. However, he expresses caution on FMCG stocks due to high valuations and a lack of compelling growth triggers. In contrast, he sees strong upside potential in the cement sector, supported by expected improvements in margins and earnings over the next one to two years\n\n",
        "scraped_at": "2025-06-19T19:00:44.883402"
    },
    {
        "title": "European shares dip as Middle East tensions, U.S. involvement fears weigh",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-dip-as-middle-east-tensions-u-s-involvement-fears-weigh/articleshow/121949291.cms",
        "published": "Thu, 19 Jun 2025 13:36:49 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:45.848079"
    },
    {
        "title": "Vedanta shares fall over 3% after declaring first interim dividend for FY26",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-fall-over-3-after-declaring-first-interim-dividend-for-fy26/articleshow/121949277.cms",
        "published": "Thu, 19 Jun 2025 13:36:13 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:46.770463"
    },
    {
        "title": "Mukul Agrawal-backed Ellenbarrie Industrial Gases sets price band for Rs 852 crore IPO",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/ellenbarrie-industrial-gases-sets-price-band-for-rs-852-crore-ipo-check-gmp-and-other-details/articleshow/121949242.cms",
        "published": "Thu, 19 Jun 2025 13:33:58 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:47.489364"
    },
    {
        "title": "Pharma, chemicals offer contrarian bets in stock-specific market: Hiren Ved",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/pharma-chemicals-offer-contrarian-bets-in-stock-specific-market-hiren-ved/articleshow/121949141.cms",
        "published": "Thu, 19 Jun 2025 13:32:12 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n\"I personally feel that given the level of monetary policy action that the RBI gave, had it not been for this geopolitical issue, my sense is that the markets would have probably broken out on the upside because it is a fairly strong monetary stimulus that you have given to the economy. Unfortunately, it all got diluted in the near term because of what we are seeing on the geopolitical front,\" says Hiren Ved , Director & CIO, Alchemy Capital What it is telling you is that the markets are probably stuck in this range because of what we are seeing on the geopolitical front.Yes, I mean, so there are opposing forces. It has been pretty resilient, the markets, in the face of what we are seeing globally. And I guess that there is a little bit of the confidence that is coming back from the fact that finally in the Q4 earnings we have seen at least earnings stabilise a little bit. And typically, in the short run while the markets tend to focus on a lot of narratives like we saw in the case of tariffs, I think what the markets want to see is that if because of all the geopolitical situation, unless oil goes above $85, we will be okay and we should see a better earnings picture next year.I personally feel that given the level of monetary policy action that the RBI gave, had it not been for this geopolitical issue, my sense is that the markets would have probably broken out on the upside because it is a fairly strong monetary stimulus that you have given to the economy. Unfortunately, it all got diluted in the near term because of what we are seeing on the geopolitical front.Well, the level of supply is definitely a concern in my view in this market, but it also tells you the psyche of most people who are selling because they believe like we said in the beginning of our interaction that market should have corrected by now. So, people feel that okay this is a godsend gift, let us take some money off the table, let us create some liquidity.And there has been a barrage of supply ever since we have seen a pick up in the market from the lows of March and so on and so forth. But I think that also apart from other reasons, this is also one of the reasons why the Nifty is stuck in this range because there is a barrage of supply that is coming in.And when I speak to brokers, they say that this is just the beginning, there is a whole line of more supply that is likely to come up. In a way, it signals the depth of Indian markets now. But we should be very careful and especially in companies where promoters are just selling because the price is good.So, you rightly mentioned, I mean the market is not really cheap and I think that what is seemingly cheap, there is no growth. So, let us say, if you take the fourth quarter numbers itself and we were doing some analysis that the largecap definition as per AMFI which is probably the top 100 companies, the pat growth was 7%. But if I take out the next 50 and just leave the top Nifty 50 companies, it was 3%. That tells you that your top largecap companies there is no earnings growth.On the midcap side in Q4 the earnings growth was 28% and on the smallcap side it was 18%. So, really what the market is telling you is while most market commentators and strategists are telling you that stick to largecaps because that is where the value is, the problem is that there is no growth in earnings there, that is why probably they are available at the valuation at which they are available.But equally the dilemma is that if you want to buy where there is growth, you have to pay up. So, I guess we are in this nice little equilibrium where we should stay invested. But having said that, I think there are always bottom-up opportunities that are there. There could be sectors where there is a lot of pessimism priced in. Pharma could be one of them, chemicals also is coming off a very low base. So, there can always be one-off opportunities that you could find in this market as well. While at a very broad level we might be thinking that valuations are full up, but this is a stock specific market in my view.",
        "scraped_at": "2025-06-19T19:00:48.488306"
    },
    {
        "title": "Will Bitcoin hit $1 million by 2030? 'Rich Dad Poor Dad' author Robert Kiyosaki thinks so",
        "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/will-bitcoin-hit-1-million-by-2030-rich-dad-poor-dad-author-robert-kiyosaki-thinks-so/articleshow/121949177.cms",
        "published": "Thu, 19 Jun 2025 13:29:59 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "PRICE vs QUANTITY\n\n\n\nPoor people focus on price.\n\nRich people on quantity.\n\n\n\nI do not care much about the spot price of gold or silver.\n\n\n\nI do care about how many ounces of gold and silver I control.\n\n\n\nThe same with Bitcoin. While I watch the price of Bitcoin I focus on how many…",
        "scraped_at": "2025-06-19T19:00:49.319427"
    },
    {
        "title": "Unique Picks: These 11 stocks held by only one MF scheme surge 15-30% in over a month - Top Performers",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-these-11-stocks-held-by-only-one-mf-scheme-surge-15-30-in-over-a-month/slideshow/121949096.cms",
        "published": "Thu, 19 Jun 2025 13:12:39 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "ETMarkets analyse mutual fund portfolios to identify stocks exclusively held by a single scheme. The initial list, compiled in May 2025, included 137 such stocks. This was then refined to include only those with a market capitalisation above Rs 20 crore as of May 2025 and a share price return between 15% and 75% since the beginning of May. After applying these criteria, 11 stocks made the cut. Notably, three of them delivered gains of over 50% in just over a month. (Data Source: ACE MF, ACE Equity).\n\n",
        "scraped_at": "2025-06-19T19:00:50.584993"
    },
    {
        "title": "Siemens Energy may see up to $180 million in outflows after MSCI exit",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-energy-may-see-up-to-180-million-in-outflows-after-msci-exit/articleshow/121948616.cms",
        "published": "Thu, 19 Jun 2025 13:10:27 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:51.375562"
    },
    {
        "title": "Japan's Nikkei retreats from 4-month high as US-Iran tensions weigh",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-retreats-from-4-month-high-as-us-iran-tensions-weigh/articleshow/121948515.cms",
        "published": "Thu, 19 Jun 2025 13:06:28 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nJapan's Nikkei share average retreated from a four-month high on Thursday, as escalating tensions between the United States and Iran dampened demand for higher-yielding assets.The Nikkei 225 Index closed 1% lower, snapping a three-day winning streak that had pushed the gauge to the highest since February 20. The broader Topix lost 0.6%.The Israel-Iran conflict entered its seventh day, and U.S. President Donald Trump was ambiguous about whether Washington would join in bombardment of Iran's nuclear sites.\"Heightened tensions in the Middle East continue to cool investor sentiment, with the downside appearing to widen,\" said Nomura strategist Fumika Shimizu.There were 62 advancers in the Nikkei index against 159 decliners. The largest percentage losses in the index were Trend Micro, down 8.4%, followed by Screen Holdings which skidded 4%.Nippon Steel was among the top gainers, rising 2.3% after completing its long-awaited $14.9 billion acquisition of U.S. Steel.",
        "scraped_at": "2025-06-19T19:00:52.099185"
    },
    {
        "title": "NSE changes bidding rules for SME IPOs from July 1. Check details here",
        "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/nse-changes-bidding-rules-for-sme-ipos-from-july-1-check-details-here/articleshow/121948498.cms",
        "published": "Thu, 19 Jun 2025 13:05:29 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Here are the changes made by the stock exchange:\n\n\n\nThe \"Retail Individual Investor\" category is now called \"Individual Investor\" (This is defined as an Individual Investor who is applying for at least 2 lots, worth over Rs 2 lakhs).\n\n\n\nMinimum bid for Individual Investors: 2 lots (worth over Rs 2 lakhs).\n\n\n\nBids at “Cut-off price” are not allowed for any category.\n\n\n\nNo changes or cancellations are allowed after placing the bid.\n\n\n\nOn the last day, bidding closes at 4:00 PM.\n\n\n\nUPI approvals (mandates) can be completed till 5:00 PM on the last day.\n\n\n\nFor special/reserved categories:\n\n\n\nEmployees: Minimum 2 lots (over Rs 2 lakhs), up to Rs 5 lakhs\n\nShareholders/Policyholders: Minimum 2 lots (over Rs 2 lakhs)\n\n\n\nQIBs (Qualified Institutional Buyers) and NIIs (Non-Institutional Investors) must apply for more than 2 lots.\n\n\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe National Stock Exchange ( NSE ) has announced certain updates to the bidding process for Small and Medium Enterprises' (SME) initial public offerings (IPOs). These updates are aimed at improving transparency, efficiency, and investor participation in the SME segment of the market . The revised bidding mechanism is scheduled to come into effect on July 1, 2025.According to the official circular issued by the NSE, both the current (existing) bidding system and the newly introduced one will be functional simultaneously for all SME IPOs that are launched on or before June 30, 2025. This overlap period likely aims to ensure a smooth transition without disrupting ongoing IPO processes.In the event of any spillover or delay, the dual system will continue to be in operation until July 11, 2025, to accommodate all in-progress IPOs. After this transitional period, from July 12, 2025 onwards, the new bidding mechanism will become mandatory and will be implemented for all future SME IPOs without exception.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:52.841875"
    },
    {
        "title": "2025 Wealth Trends: Who Gained, Who Lagged? - Record-Breaking Wealth Growth in the U.S.",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/2025-wealth-trends-who-gained-who-lagged/slideshow/121948335.cms",
        "published": "Thu, 19 Jun 2025 12:51:34 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Looking ahead, UBS projects that average wealth per adult will continue to grow over the next five years. This growth will be primarily driven by the United States, which remains a global leader in wealth accumulation. Greater China is also expected to play a major role, although its pace will be somewhat slower, contributing significantly to the reshaping of global wealth dynamics.\n\n\n\n(Disclaimer: This slideshow has been sourced from Reuters)\n\n",
        "scraped_at": "2025-06-19T19:00:53.476542"
    },
    {
        "title": "Gold Price Prediction: Yellow metal dips to Rs 99,258/10 gms amid hawkish fed comments; analysts eye recovery",
        "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-price-prediction-yellow-metal-dips-to-rs-99258/10-gms-amid-hawkish-fed-comments-analysts-eye-recovery/articleshow/121947710.cms",
        "published": "Thu, 19 Jun 2025 12:37:49 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\nHow to trade gold?\n\nGold has support at Rs 99,100-98,670 and resistance at Rs 99,900-1,00,350\n\nSilver has support at Rs 1,07,750-1,07,000 and resistance at Rs 1,09,200-1,10,000\n\nBuy MCX August Gold futures at Rs 99,500 with a stop loss of Rs 99,200 and a price target of Rs 1,00,000\n\nBuy MCX July Silver futures at Rs 1,08,000 with a stop loss of Rs 1,06,000 and a price target of Rs 1,11,000\n\nGold rates in physical markets\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nGold prices opened lower after a hawkish commentary from the US Federal Reserve , which kept interest rates steady at 4.25–4.50%. On the Multi Commodity Exchange (MCX), August gold futures opened at Rs 99,258 per 10 grams, down Rs 279 or 0.28%.Silver futures for July delivery also saw a modest dip, opening Rs 256 lower at Rs 1,08,310 per kg, a decline of 0.24%.On Wednesday, gold and silver settled on a slightly weaker note in the domestic markets and on a mixed note in the international markets. Gold August futures contract settled at Rs 99,537 per 10 grams with a loss of 0.001% and the silver July futures contract settled at Rs 1,08,566 per kilogram with a loss of 0.39%.Gold and silver showed high volatility and settled on a mixed note amid a hawkish stance of the U.S. Fed on interest rates. The U.S. Fed maintained a status quo on interest rates and left interest rates unchanged between the 4.25-4.50% range. The U.S. Fed also diminished the chances of aggressive interest rate cuts for the years 2025-2027.Fed chairman Jerome Powell projected that inflation remains elevated, economic growth remains slower, and job markets are under pressure due to higher trade tariffs and global uncertainty.“The U.S. Fed’s hawkish stance on interest rate cuts limits gains of precious metals. However, escalation in the Israel-Iran war and global central banks' buying are supporting precious metal prices,” said Manoj Kumar Jain of Prithvifinmart Commodity Research.Today, the US Dollar Index, DXY, was hovering near the 99.03 mark, gaining 0.12 or 0.12%.“We expect gold and silver prices to remain volatile this week amid volatility in the dollar index and geopolitical tensions and gold prices could hold their key support level of $3,284 per troy ounce and silver prices could also hold $34.00 per troy ounce levels on a weekly closing basis,” he added.The Fed Chairman maintained a neutral stance, noting readiness to respond to external risks. Meanwhile, US data showed a softening labor market and weak housing figures.“Gold prices held their upward bias after the Federal Reserve decided to keep policy unchanged, aligning with market expectations,” said Neha Qureshi, Senior Technical & Derivative Analyst, Anand Rathi Commodities & Currencies.The Relative Strength Index (RSI) remains bullish but steady, suggesting further gains are possible.Manoj Kumar Jain suggested the following ranges for gold and silver on MCX:Jain suggests buying gold on dips around Rs 99,000 with a stop loss of Rs 98,570 for a target of Rs 99,700.Intraday trading strategy by Neha Qureshi:Standard gold (22 carat) prices in Delhi stand at Rs 57,832/8 grams while pure gold (24 carat) prices stand at Rs 61,608/8 grams.Standard gold (22 carat) prices in Mumbai stand at Rs 57,576/8 grams while pure gold (24 carat) prices stand at Rs 61,392/8 grams.ennaiStandard gold (22 carat) prices in Chennai stand at Rs 56,760/8 grams while pure gold (24 carat) prices stand at Rs 60,472/8 grams.Standard gold (22 carat) prices in Hyderabad stand at Rs 57,080/8 grams while pure gold (24 carat) prices stand at Rs 60,880/8 grams.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:54.361459"
    },
    {
        "title": "Bajaj Auto, Tata Power among 13 companies to trade ex-dividend on Friday. Last chance to buy!",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-tata-power-among-13-companies-to-trade-ex-dividend-on-friday-last-chance-to-buy/articleshow/121947558.cms",
        "published": "Thu, 19 Jun 2025 12:30:11 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:55.205803"
    },
    {
        "title": "Bharti Airtel outperforms; Vodafone Idea remains a value trap: Hemang Jani",
        "url": "https://economictimes.indiatimes.com/markets/expert-view/bharti-airtel-outperforms-vodafone-idea-remains-a-value-trap-hemang-jani/articleshow/121947270.cms",
        "published": "Thu, 19 Jun 2025 12:20:53 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n\"Some of the API companies have started doing well and Laurus in particular after subdued performance for more than one-and-a-half, two years, now it looks like the earnings growth could look much better with slew of launches,\" says Hemang Jani , Independent Market Expert.Yes, so some of the API companies have started doing well and Laurus in particular after subdued performance for more than one-and-a-half, two years, now it looks like the earnings growth could look much better with slew of launches. Even the API business per se is looking much better in terms of price and volume both.Only issue here is that if we have the news on the tariff on the pharma companies, then you may see a bit of a knee-jerk reaction like what we have seen in the past couple of days, but I do not think there is going to be any materially negative impact on the pharma companies per se.So, our preferred picks would be apart from Laurus Labs, I think Divi’s is something that is looking quite interesting, even its business model, contract manufacturing side and the expansion which they have completed, but the large generic plays we are not too sure, something like Sun, Lupin we are avoiding at this point of time for want of further clarity on the tariffs.Yes, I do think auto selectively should do better. On the rural side what we are hearing is that the traction should be much better and particularly when you enter into festive season you will see the kind of growth that one can really look at in the current scenario.So, we do like auto, but given the high base, it may not be across the board kind.So, Mahindra & Mahindra is something that we have been liking for their overall growth trajectory of 20-21%. Bajaj has corrected quite a lot and is trying to stabilise around these levels. The monthly numbers continue to be reasonably good with EV being at the higher growth trajectory for them. Export side they are going reasonably okay. So, some of the two-wheeler companies like Bajaj, maybe TVS, and Mahindra & Mahindra these are the names that we like.So, I was saying that metal as a pack is very well placed given the trend in the base metal prices and listen names like Vedanta across majority of their products, be it the oil and gas, the aluminium, copper, zinc, even silver which is doing so well.So, they stand to benefit quite a lot. I am extremely positive on Vedanta, Hindalco which has consistently been doing well, so positive view on the metal companies at this point of time.Yes, absolutely. Overall, if you see, Bharti has been one of the best performing stocks, pure play digital and even if you compare their performance versus Jio, most of the parameters be it the ARPU growth, overall EBITA margins, overall growth in the profitability it has done much better, so no two ways about it, Bharti by far is the best play on the telecom.But I really want to play Idea at this point. See, people like a low price stock, particularly the retail investors, but last five years if you see hardly anybody has made money, creates a lot of excitement when you have some on the AGR, fundraise, or all kinds of things, but by and large it becomes a trap, even if you have a small uptake, so not tempted, I think things are not looking to clear on their balance sheet front or how the company is going to survive and more importantly whether they will have any strategy to stop the market share loss which they are seeing for the past many years, not comfortable buying into an Idea.So, a lot of promise, lot of interesting developments happening on that front, but when I look at the market cap and the valuations, fact that this entire space is not going to be easy to navigate given the fact that on the financial services side you have very big companies to compete with.So, I am not somebody who wants to buy a company because it has a great promoter or pedigree. We should give more importance to the earnings trajectory even from a one- or two-year perspective. So, I am staying away from Jio Finance at this point.",
        "scraped_at": "2025-06-19T19:00:56.029497"
    },
    {
        "title": "​Fed Holds Fire: Inflation fears delays rate cut​ - ​Fed Holds Steady, Market Hopes Waver",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/fed-holds-fire-inflation-fears-delays-rate-cut/slideshow/121947265.cms",
        "published": "Thu, 19 Jun 2025 12:14:55 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Stephen Dover of Franklin Templeton sees better opportunities abroad. With U.S. growth slowing and political risks rising, global assets and short-duration bonds are gaining investor favor.\n\n\n\n\n\n(Disclaimer: This slideshow has been sourced from Reuters)",
        "scraped_at": "2025-06-19T19:00:56.686958"
    },
    {
        "title": "IT stocks slip up to 3.5% after Fed holds rates, flags persistent inflation",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-slip-up-to-3-5-after-fed-holds-rates-flags-persistent-inflation/articleshow/121947083.cms",
        "published": "Thu, 19 Jun 2025 12:04:58 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIndian IT stocks declined on Thursday after the US Federal Reserve left its benchmark interest rate unchanged, maintaining the target range at 4.25% to 4.5%, while signaling persistent inflation concerns and a cautious outlook on the economy.Although the Fed kept rates steady for the sixth straight meeting, it maintained projections for two rate cuts in 2025, according to the updated “dot plot” — a chart that reflects individual policymakers’ forecasts. However, the central bank trimmed its rate cut projections for 2026 and 2027, signaling a more gradual easing path.The update also revealed growing internal divergence. Seven of the 19 Federal Open Market Committee (FOMC) members now expect no rate cuts in 2025, compared to just four in March. Still, the committee unanimously approved the latest policy statement.Following the announcement, Indian IT stocks came under pressure. LTIMindtree dropped 3.5% to Rs 5,259.5, while Tech Mahindra fell nearly 3% to Rs 1,662.6. OFSS, Persistent Systems Mphasis , and Infosys declined between 1% and 2.6%.Within the Nifty IT pack, Wipro was the only gainer, trading 0.7% higher, while the Nifty IT index slipped 1.4%.Alongside the rate decision, the Fed downgraded its growth outlook. GDP growth for 2025 is now forecast at 1.4%, down from 1.7% in March, reflecting signs of economic moderation.On inflation, the Fed raised its core Personal Consumption Expenditure (PCE) projection — its preferred inflation measure — to 3.1% for 2025, up from 2.8% previously. Headline PCE is also expected to reach 3%, indicating lingering price pressures.The unemployment rate is now projected to rise slightly to 4.5%, up from the earlier estimate of 4.4%.At the post-meeting press conference, Fed Chair Jerome Powell reiterated the central bank’s cautious stance, saying there is still time to assess incoming data before considering rate cuts.“Uncertainty about the economic outlook has diminished but remains elevated,” the FOMC said in its statement. “The Committee is attentive to the risks to both sides of its dual mandate.”The Fed described the economy as continuing to grow at a “solid pace,” with unemployment remaining low, though inflation is “somewhat elevated.”: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
        "scraped_at": "2025-06-19T19:00:57.527509"
    },
    {
        "title": "Siemens Energy shares zoom 5%, hit upper circuit post listing; brokerages project 30% upside",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-energy-shares-zoom-5-hit-upper-circuit-post-listing-brokerages-project-30-upside/articleshow/121947014.cms",
        "published": "Thu, 19 Jun 2025 12:02:13 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "Here’s what brokerages say:\n\n\n\nJefferies: Buy| Target price: Rs 3,700| Upside potential: 29.8%\n\n\n\nLive Events\n\nAntique Broking: Buy| Target price: Rs 3,179| Upside potential: 11.5%\n\n\n\nMotilal Oswal: Buy| Target price: Rs 3,000| Upside potential: 5.3%\n\n\n\n\n\nHDFC Securities: Buy| Target price: Rs 3,000| Upside potential: 5.3%\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe shares of Siemens Energy India , the demerged arm of Siemens Ltd , zoomed 5% in Thursday's early trade to hit their upper circuit at Rs 2,992.45 on the BSE after listing at Rs 2,850. With this listing, brokerage firms project up to 30% upside potential in the stock, setting a target price as high as Rs 3,700.Analysts expect the newly carved-out entity to emerge as a leading beneficiary of India’s accelerating power transmission and distribution (T&D) investment cycle.Also Read: Siemens Energy shares list at Rs 2,850 on BSE after demerger; growth prospects bullish Siemens Energy on listing should be India’s largest listed pure-play power T&D equipment player at $10 billion+ market cap, followed by Hitachi and GE at $6.8-9.6 billion.Jefferies believes that the company should see 40% EPS CAGR in FY24-27E, driven by the robust T&D pipeline and operating leverage, implying healthy upside potential below Rs 3,000/share.Siemens Energy India provides integrated products, solutions, and services across the energy value chain, focusing on oil and gas production, power generation, and transmission. The company aids customers in achieving decarbonization and net-zero targets.Siemens Energy operates over ten state-of-the-art factories in India and has exclusive rights in South Asia (Bhutan, Nepal, Sri Lanka, and Maldives). The company is well-positioned to capitalize on industrial decarbonization and T&D spending, with a capex of Rs 9.2 trillion planned by FY32.Motilal Oswal expects the company to benefit from a strong addressable market in the T&D business. Based on the financial details available for FY24, the brokerage firm arrived at pro-forma financials for the energy business.They expect revenue/PAT CAGR of 25%/31% over FY25-27, with EBITDA margin expanding to 21.4% by FY27. Margins have already started expanding in 5MFY25.Siemens Energy India (SEL) is a key player in decarbonization, offering a range of solutions including power generation, grid automation, green hydrogen, and battery storage. With exclusive rights for several South Asian countries, SEL has developed new business lines in PEM electrolyzers, hydrogen blend gas turbines, and battery storage.The company has a strong revenue outlook with robust cash flow and a projected 30% PAT CAGR. The brokerage firm’s optimistic view is based on its growing market presence and innovative technologies.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
        "scraped_at": "2025-06-19T19:00:58.380415"
    },
    {
        "title": "Reliance Infra shares rally over 1,400% in 5 years. Is there more upside left?",
        "url": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-shares-rally-over-1400-in-5-years-is-there-more-upside-left/articleshow/121946601.cms",
        "published": "Thu, 19 Jun 2025 11:49:07 +0530",
        "source": "https://economictimes.indiatimes.com/rss/markets/rssfeeds/1977021501.cms",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
        "scraped_at": "2025-06-19T19:00:59.578842"
    },
    {
        "title": "What to expect from Q3 results of IndiGo, SpiceJet, Jet Airways",
        "url": "https://www.livemint.com/Money/IuUJ4KylX5R559ervLGXFL/Q3-results-of-IndiGo-SpiceJet-Jet-Airways.html",
        "published": "Fri, 18 Jan 2019 08:30:45 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "For one, during Q3, average ATF prices remained high, rising by 5% from the September quarter. Fuel comprises the bulk of airlines’ costs and therefore, high fuel prices erode profits. Secondly, the rupee depreciated against the dollar on a year-on-year basis, which swells other dollar-denominated costs. These factors will weigh on aviation firms’ financials for the third quarter.\n\nHaving said that, Q3 is a seasonally strong period and that could help offset the impact of high crude oil prices and a weak rupee to some extent. This means the cumulative net loss of ₹ 2,340 crore that the listed airlines posted in the September quarter is set to narrow in the December quarter.\n\nICICI Securities Ltd expects all the three airlines to report significantly lower Ebitda losses compared to the September quarter. Ebitda is short for earnings before interest, tax, depreciation and amortization.\n\n“Aggregate domestic capacity addition was 19% in Oct-Nov 2018 whereas passenger growth was 12%,” wrote Ansuman Deb of ICICI Securities in a 10 January report. This, and the fact that airlines raised fares, resulted in a drop in passenger load factors. Higher overall volumes and fares vis-à-vis the September quarter should however result in lower losses, say analysts.\n\nIt goes without saying that yield performance will be worth tracking for these airlines. IndiGo’s commentary on capacity addition will be another measure investors should follow closely.\n\nALSO READ | What 2019 augurs for Jet Airways, IndiGo and SpiceJet\n\nGiven the hit on profitability, investors haven’t had much luck on airline stocks. Shares of the three airlines have underperformed the BSE 500 index so far this fiscal year. Jet Airways, of course, has lagged the most due to its financial troubles.",
        "scraped_at": "2025-06-19T19:01:00.681881"
    },
    {
        "title": "Forget privatisation, govt has hugged its banks tighter",
        "url": "https://www.livemint.com/Money/86BDC9r6zqgl995QQ7qJiL/Forget-privatisation-govt-has-hugged-its-banks-tighter.html",
        "published": "Fri, 18 Jan 2019 08:08:26 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "A stitch in time saves nine. The government has, over the years, received advice from numerous quarters to reduce its stake in public sector banks (PSU banks) to below 51%, so that these lenders have sufficient capital for growth. While the government has rejected this line of thought, it had itself talked of reducing its stake from existing levels to around 52% by allowing banks to raise equity capital from other sources. But things have gone in the opposite direction, as the chart below shows, with the government’s stake rising above 95% in one case.\n\nThis is a direct outcome of the unprecedented capital infusion the government has done after it committed to give R 2.11 trillion over two fiscal years to its struggling lenders under the PSU bank recapitalisation plan. In December, it upsized its commitment by another ₹ 41,000 crore, considering PSU banks weren’t able to raise money from the markets.\n\nOne may argue that the centre can’t be blamed, considering it did its job of helping the banks as the largest shareholder by infusing money. But from a minority shareholders’ perspective, the equity dilution has been immense in these banks, with the government having waited far too long to act on bank recapitalisation. While the government dragged its feet over recapitalisation, there was an erosion of market value and net worth of these banks. It too suffered as a shareholder due to the erosion. Now, it also finds itself in a situation where coming down to the desired 52% stake looks like a pipe dream.\n\nAnother fallout of the increase in government ownership is that these banks are now flouting minimum public shareholding norms set by the capital market regulator. This, in turn, has led to a slew of announcements by public sector banks to make large issuances under the employee stock option mode, with a view to meet these norms. Syndicate Bank, for instance, will issue as many as 300 million shares to employees, on an equity base of 1.6 billion shares.\n\nPart of the capital infusion in FY18 was done through recapitalisation bonds. In this route, the government issues bonds to banks and uses the proceeds to buy their shares to infuse capital. This route was frowned upon since the banks ended up shifting money from their investment book to their capital base.",
        "scraped_at": "2025-06-19T19:01:01.653074"
    },
    {
        "title": "Flat profit, rising debt are growing worries for Reliance",
        "url": "https://www.livemint.com/Money/oi23Lg12aO3MWoBs0Ha5MJ/RIL-Q3-result-Flat-profit-rising-debt-are-a-growing-worry.html",
        "published": "Fri, 18 Jan 2019 07:51:11 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "Shares of Reliance Industries Ltd (RIL) have risen 22% in the past year, compared to a 6% decline in the Nifty 500 index. This is despite the fact that refining margins are subdued right now and spreads in the petrochemicals business have come off. While the consumer businesses—Reliance Jio Infocomm Ltd and Reliance Retail—are growing at a brisk pace, they account for roughly a fifth of overall profits. As such, the heavy lifting, as far as driving growth goes, stays with the mainstay refining and petrochemicals businesses.\n\nRIL’s December quarter (Q3) results show things have indeed slowed down in these segments. Together, their earnings before interest and tax (Ebit) rose 1% on a quarter-on-quarter basis, down from 1.9% in the September quarter and 11.2% in the June quarter. This translated into sluggish growth at the consolidated level as well, with Ebitda (Ebit plus depreciation and amortization) growing by only around 1% sequentially.\n\nWhile this may be on expected lines, flat profit is a worry because RIL’s debt has been rising at a rapid pace. Ahead of the results announcement, analysts at Jefferies India said in a note to clients, “Rising debt at telecom & retail is likely to leave consolidated net liabilities about $2.5bn higher sequentially to ₹ 3.2 trillion.”\n\nIt’s little wonder RIL has begun talking about deleveraging. It is in the process of transferring its fibre business and its tower business out of Reliance Jio Infocomm Ltd to separate firms. This is a precursor to a stake sale in these businesses. V. Srikanth, joint chief financial officer, said, “If you were to look at the asset monetisation, be it tower or fibre, it means that our balance sheet next year will be even more stronger, because you have cash on one side and some of these assets not being in the balance sheet.”\n\nIt should be noted here that while reported profits at Reliance Jio have been on the rise, cash burn remains high. In Q3, Reliance Jio reported cash profits of ₹ 2,515 crore, but capital expenditure remained high at ₹ 14,000 crore, resulting in huge cash burn. The fact that the company is looking at asset monetization, rather than a strategy of increasing cash flows by raising telco tariffs is a worry, not only for its competitors, but also its own investors. Sure, parts of its digital business are yet to generate cash, although it remains to be seen how far segments such as broadband contribute to cash flows.\n\nComing back to RIL Q3 results, growth in its telecom business has stayed impressive, with revenue growing by over 12% sequentially. Reliance Jio’s competition is expected to report a decline in revenues in Q3. The retail segment—the other leg in the consumer business—has delivered yet another strong quarter with segment Ebit increasing 21.5% on a sequential basis. As expected, the segment got a boost owing to the festival season. The segment performance was also helped by new store openings. According to the company, footfalls for Reliance Retail increased 21% year-on-year.\n\nIn the energy businesses, analysts say refining margins may be close to bottoming out. Under the new rules issued by the International Maritime Organization, the limit for sulphur content in fuel oil used by ships has been lowered starting 2020. Accordingly, product cracks are anticipated to increase owing to the expected boost to demand for low sulphur diesel/ middle distillates globally. In Q3, RIL’s gross refining margin of $8.8 a barrel was broadly in line with analysts’ expectations. In the petchem division, strength in polyesters offset softness in the chemicals business, resulting in slightly better profits sequentially. This is better than some estimates that profits for the division would be flat.",
        "scraped_at": "2025-06-19T19:01:02.250335"
    },
    {
        "title": "Q3 results: HUL growth off a high base shows it’s on a roll",
        "url": "https://www.livemint.com/Money/eVIEihV4xTUzhsKJOJhp7K/Q3-results-HUL-growth-off-a-high-base-shows-its-on-a-roll.html",
        "published": "Fri, 18 Jan 2019 04:09:53 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "Premium valuations notwithstanding, shares of Hindustan Unilever Ltd (HUL) have gained 11.5% after it announced its September quarter (Q2) results, compared to a 4% rise in the Nifty. HUL Q3 results should help maintain the positive momentum. Volumes during the December quarter increased 10%. This is the fifth consecutive quarter of double-digit growth, commendable considering the growth comes on a high base. Growth in the earlier four quarters was aided by demonetisation and goods and services tax (GST) disruptions in the base year.\n\nRevenue growth stood at 11.3%. Excluding exports, the 13% growth in the domestic business slightly lagged some estimates, reflecting lower-than-expected price realizations. Analysts had assumed price hikes during the quarter were higher. Even so, that does not amount to a major upset.\n\nImportantly key business segments continue to see good growth momentum, helped by steady demand from rural areas and growing sales of premium products. Home care—which includes the detergents business and accounts for close to a third of HUL’s overall revenue—grew by 14.8%. Beauty and personal care—which generates nearly half of overall revenues—grew 11%, primarily driven by premiumization of the product portfolio. The food and refreshment segment also did well, registering a growth of 9.9%.\n\nThe healthy growth in volume and cost rationalization measures helped the company expand its profitability margins by 170 basis points to 21.4%. Raw material costs, while volatile, have eased towards the end of the quarter. One hundred basis points equal one percentage point.\n\nThe management said the demand environment should be stable in the near term, with its focus remaining on volume-led growth. The government’s focus on rural areas and the expected thrust to rural spends ahead of the elections should aid HUL. Approximately, 40% of the company’s revenue comes from rural areas.\n\nFurther, the amalgamation (expected to be completed in the coming quarters) of GlaxoSmithKline Consumer Healthcare Ltd should give a fillip to HUL’s foods business, providing a significant growth lever.\n\nFor investors focused on the earnings trajectory in the near term, much will depend on raw material costs and how HUL handles them. While crude and palm oil rates eased from the highs in 2018, prices of other consumables used in tea and toothpaste have remained firm.",
        "scraped_at": "2025-06-19T19:01:02.976068"
    },
    {
        "title": "1 step forward, 2 steps back. Is GST going the VAT way?",
        "url": "https://www.livemint.com/Money/kQ9lEhekbWaksC4BdVuqZO/1-step-forward-2-steps-back-Is-GST-going-the-VAT-way.html",
        "published": "Thu, 17 Jan 2019 07:19:59 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "By doubling the goods and services tax (GST) eligibility limit, India’s version of GST has inched closer to the global format. However, tax experts say India has kept finding ways to make things complicated, with the recent introduction of cess for Kerala taking things from bad to worse.\n\nAlthough for a limited period, the move defeats the purpose of GST, because this mammoth tax change was introduced so that multiple cesses could be done away with.\n\n“Re-introduction of cess sets a bad precedent. It may be for a noble cause, but instead of levying cess, the Centre could have funded the cause directly,” said Anita Rastogi, indirect tax partner at PwC India. The council allowed flood-hit Kerala to levy a calamity cess of 1% on intra-state sales for a maximum period of two years.\n\nA moot question is if this takes us back to the days of VAT, or value added tax, which also started off with noble intentions before getting muddled. Drawing parallels with earlier tax regime, Saloni Roy, senior director at Deloitte India, said, “When VAT was introduced in 2004, its purpose just like GST was to have a unified tax system across the country. But after a while, states started drifting away. For example, some states like Haryana, Uttar Pradesh and Gujarat had additional tax on certain items which others didn’t. My concern with bringing back cess is that, are we going back to where we started from?”\n\nAnother important decision taken at the GST Council’s 32nd meeting was the extension of composition scheme to services providers. Services providers with a turnover limit of up to ₹50 lakh are now allowed to avail of the composition scheme at a rate of 6%.\n\nWhile the objective here is to encourage more businesses to come under the GST ambit, tax experts fear that introduction of a new tax rate makes the law more complex and could lead to non-compliance. Currently, businesses under the composition scheme are taxed under various slabs of 1% (manufacturers), 2% (traders) and 5% (restaurants).\n\n“They have extended the composition scheme for service providers, aimed at widening the tax base, but at a new tax rate of 6%. Anyway, we had three different tax rates for goods providers who have opted for this scheme and this complicates the law even further. The more the complex law, more difficult it is to comply. A simple law leads to more compliance and increased revenue to the government—this is tried and tested globally in countries where GST/VAT is practised,” added Rastogi.",
        "scraped_at": "2025-06-19T19:01:03.496971"
    },
    {
        "title": "Mindtree delivers stable Q3 results after a shock Q2",
        "url": "https://www.livemint.com/Money/02GInJ84rC1NYJVYppdeTN/Mindtree-delivers-stable-Q3-results-after-a-shock-Q2.html",
        "published": "Thu, 17 Jan 2019 07:02:46 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "Shares of Mindtree Ltd have lost 14% since its second quarter (Q2) earnings announcement in October. During the same time, the Nifty IT index has declined only 2%. Revenue growth missed Street estimates in the September quarter, and management commentary had turned cautious too.\n\nThe December quarter (Q3) results should bring some stability, at least as far as the financial performance goes. Revenue in constant currency increased 2.4% on a sequential basis, slightly ahead of estimates. Profit margins expanded 50 basis points. Encouragingly, dependency on the top clients, a bugbear for investors, moderated a bit. Revenue contribution of the top 10 clients moderated from 44.8% in Q2 to 44.1%, implying some diversification of the revenue base.\n\nOne basis point is one-hundredth of a percentage point.\n\nThe $1 million client bucket has seen five additions and deal wins have picked up compared to a year ago. Deal pipeline is strong. Management expects the growth in the current quarter to be slightly better than Q3, aided by incremental recovery in the banking, financial services and insurance (BFSI) vertical. Margins are expected to be stable, with the company planning to reinvest efficiency gains emanating from the higher revenue.\n\nThe stable commentary should aid the stock. That said, much depends on the recovery in the BFSI vertical.\n\nFrom 24.8% in the year ago and 22.4% in Q2, the contribution of the BFSI vertical to revenues dropped to 21.7% last quarter.\n\nTo be sure, the segment continues to see good deal momentum. But the ramp-down (reduction in revenue contribution) of a large client lowered the segment’s contribution. There is no clarity yet when this segment will pick up pace.\n\nOutlook for the rest of the three business verticals—media, retail and manufacturing, and travel and hospitality—is encouraging with the firm seeing strong momentum in the travel segment.\n\nSo Mindtree may as well end the current fiscal year on a positive note, with double-digit year-on-year growth. How the momentum builds into the next fiscal year remains a question mark and this will play a key role in the stock trajectory.",
        "scraped_at": "2025-06-19T19:01:03.978142"
    },
    {
        "title": "Q3 results: ICICI Securities loses its retail broking crown",
        "url": "https://www.livemint.com/Money/0wAmnRIRzxhkIfTRQemjiI/Q3-results-ICICI-Securities-loses-its-retail-broking-crown.html",
        "published": "Wed, 16 Jan 2019 06:14:10 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "Broking firm ICICI Securities Ltd has had a rough ride from the day it debuted on stock exchanges in April 2018. Investors have given a cold shoulder to not just its stock but, from the looks of it, also its platform.\n\nICICI Securities reported a net profit of ₹101.2 crore in the December quarter (Q3), which is 34% lower from a year ago. Revenue fell 18% from a year ago, dragged by a lacklustre performance in all segments. The company makes money every time customers use its platform to trade or buy investment products off its shelves.\n\nBroking has a lion’s share of total revenues and therefore, the 17% fall in brokerage revenues contributed to the drop in overall revenues. Recall that equity markets were roiled by the liquidity crisis in the non-banking finance space in September and October. Since these volatile times gave retail customers cold feet, ICICI Securities saw its retail brokerage slip, while business from institutions grew a bit.\n\nThe company’s distribution business struggled as well, with revenue here coming 11% lower than last year. But the blame for this can be partly laid at the doors of the market regulator for banning up-fronting of distribution commission, and lowering expense ratios. The impact of this twin blow will be felt even in the coming quarters and the ICICI Securities management has guided 25-30% decline in distribution yields from FY18 levels, according to HDFC Securities Ltd.\n\nICICI Securities saw its active customer base grow at a modest 10% in the third quarter. It has lost the crown of being the largest retail broking firm to rival Zerodha, which saw its active customer base surge to 847,000 as of December, marginally higher than ICICI Securities’ base of 845,000, BloombergQuint reported citing data from the National Stock Exchange.\n\nThe silver lining for ICICI Securities was that average daily trading volume continued to remain robust, providing some visibility on earnings from its broking operations.\n\nWhat is in store for the firm in the coming quarters?\n\nThe outlook for the brokerage firm is not sanguine. ICICI Securities needs to diversify its revenue but it had little success in the past quarter. That said, distribution income from insurance is expected to be better in the final quarter of FY19, according to HDFC Securities.\n\nBut prospects for the stock are not encouraging. It has halved from its initial public offering (IPO) price, underperforming the Nifty 500 index and its closest listed peer Motilal Oswal Financial Securities Ltd.",
        "scraped_at": "2025-06-19T19:01:04.539325"
    },
    {
        "title": "High drug approvals to keep up pricing pressure for pharma firms",
        "url": "https://www.livemint.com/Money/ypJwdHV7X03aHVwn7BgoyH/High-drug-approvals-to-keep-up-pricing-pressure-for-pharma-f.html",
        "published": "Wed, 16 Jan 2019 05:59:34 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "December quarter earnings of pharmaceutical companies may see incremental improvement helped by a favourable base and steady domestic business. But if the drug approvals trend in the US is anything to go by, pricing pressure in the key market is unlikely to abate anytime soon.\n\nAs approval rates gathered pace and increased competition eroded prices, earnings of domestic pharmaceutical firms came under pressure, forcing reorganization of their US businesses. With new business lines yet to acquire scale, the generic drugs business still remains core to the companies’ earnings.\n\nAs the chart shows, the year ended September 2018 has seen a record 781 abbreviated new drug application (ANDA) approvals by the US Food and Drug Administration (FDA). ANDA is an application for a US generic drug. At 278, approvals remained high in the December quarter as well. The US FDA follows a October-September fiscal year.\n\nWith a large number of applications pending, the pace of approvals is likely to remain high. “FDA’s alacrity is unlikely to die down anytime soon and FY19 may surpass FY18, given that ANDA backlog is still over 3,500 in our view. Thus, the full impact of ever-increasing approvals is likely to continue in FY20 for US-focused Indian companies,” Antique Stock Broking Ltd said in a note.\n\nOn the positive side, competition and price erosion have triggered a rethink among firms. Filings for drug approvals slowed in October and November. The steep price erosion is leading to portfolio rationalization at the pharmaceutical firms, which are weeding out low-margin drugs.\n\nBut withdrawals are happening in ultra-competitive drugs. The market otherwise continues to see a large number of generic drug sellers. The majority of the drugs that were approved in December have more than six sellers, said Antique Broking.",
        "scraped_at": "2025-06-19T19:01:05.058803"
    },
    {
        "title": "Roads sector: Toll collections set to surge, but risks loom for developers",
        "url": "https://www.livemint.com/Money/2jgaRco1lLY3r4oIGK1tzO/Roads-sector-Toll-collections-set-to-surge-but-risks-loom.html",
        "published": "Tue, 15 Jan 2019 00:01:09 +0530",
        "source": "https://www.livemint.com/rss/market",
        "content": "Rating agency Icra Ltd’s forecast of a double-digit growth in toll collections during FY20 signals better times for road developers. It paves the way for higher revenue growth and improved cash flows, particularly for firms with operational road assets.\n\nAfter recovering from the aftermath of demonetization and the goods and services tax (GST), toll collections have been improving steadily since March 2018. These toll collections are a function of toll rates and traffic growth. Currently, developers are in a sweet spot as both are rising, albeit on a low base.\n\nToll rate revisions are linked partly to the Wholesale Price Index. So far this year, the index has risen 4.7%, higher than the 3% growth in FY18. Meanwhile, traffic growth is robust too. Icra’s analysis of 48 road projects shows that the implied traffic growth has improved from 0.4% year-on-year in the March 2018 quarter to 1.7% and 4% in the June and September quarters, respectively.\n\nThis is mirrored well in the robust double-digit revenue growth for road developers in the recent past.\n\nNote that the revenue of road construction firms with higher mix of operational toll assets had plummeted for many quarters after December 2016 on account of demonetization and GST implementation. That’s not all—project construction too was impacted. Firms such as Dilip Buildcon Ltd, PNC Infratech Ltd and NCC Ltd too portrayed sharp revenue contraction with profitability and cash flows at risk. In the last one year, their shares have plummeted 40-50%.\n\nNow, with toll collections expected to grow in double digits, revenue accretion looks promising. According to analysts, in operational road projects, higher revenue directly helps the developer to service interest costs as profitability is relatively high when compared to other infrastructure assets. This was portrayed in improved interest cover ratio (interest/operating profit) on the back of higher toll collections in the last three quarters. If this trend continues, the sector’s leverage may reduce, translating into better investor appetite, which is currently dull.\n\nThe confidence in improving toll collections stems also from the hefty growth in truck and passenger vehicle sales over the last two years. “While the former accounts for nearly 70% of the total traffic movement on most of the national highways, the latter comprises the balance,” explains Rajeshwar Burla, assistant vice-president and associate head (corporate ratings) at Icra.\n\nThat said, the recent slowdown in these vehicular segments is a worry. Along with it, possibility of weak order flows in the wake of the general election and the tight liquidity scenario, has put investors again on the back foot. Although the mining ban has been lifted, industrial and manufacturing activity is wobbly.\n\nFurther, there have been very few private equity deals in the sector. This could have helped developers monetize assets.",
        "scraped_at": "2025-06-19T19:01:05.674851"
    }
]